*** crates/tla-eval/src/builtin.rs:102:5: replace constant -> Option<Value> with None

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace constant -> Option<Value> with None
@@ -94,23 +94,17 @@
             Ok(Value::Bool(true))
         }
         _ => Err(Error::Undefined(name.to_string())),
     }
 }
 
 /// Nullary names the standard modules provide.
 pub fn constant(name: &str) -> Option<Value> {
-    Some(match name {
-        "Nat" => Value::Infinite(Infinite::Nat),
-        "Int" => Value::Infinite(Infinite::Int),
-        "STRING" => Value::Infinite(Infinite::Strings),
-        "BOOLEAN" => Value::Set(BTreeSet::from([Value::Bool(false), Value::Bool(true)])),
-        _ => return None,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.
 fn index_range(lo: i64, hi: i64) -> (usize, usize) {
     let to_index = |n: i64| usize::try_from(n).expect("clamped to the sequence's own bounds");
     (to_index(lo) - 1, to_index(hi))
 }

---- an_infinite_set_cannot_be_enumerated stdout ----

thread 'an_infinite_set_cannot_be_enumerated' (183190) panicked at crates/tla-eval/tests/standard_operators.rs:150:5:
assertion failed: failure("\\E n \\in Nat : n = 1").contains("cannot be enumerated")

---- cardinality_of_an_infinite_set_is_refused stdout ----

thread 'cardinality_of_an_infinite_set_is_refused' (183194) panicked at crates/tla-eval/tests/standard_operators.rs:66:5:
assertion failed: failure("Cardinality(Nat)").contains("infinite")

---- is_finite_set_distinguishes_the_enumerable stdout ----

thread 'is_finite_set_distinguishes_the_enumerable' (183198) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `IsFiniteSet(Nat)`: `Nat` is not defined

failures:
    an_infinite_set_cannot_be_enumerated
    cardinality_of_an_infinite_set_is_refused
    is_finite_set_distinguishes_the_enumerable
    the_infinite_sets_decide_membership

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
