*** crates/tla-eval/src/builtin.rs:103:9: delete match arm "Nat" in constant

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Nat" in constant
@@ -95,17 +95,17 @@
         }
         _ => Err(Error::Undefined(name.to_string())),
     }
 }
 
 /// Nullary names the standard modules provide.
 pub fn constant(name: &str) -> Option<Value> {
     Some(match name {
-        "Nat" => Value::Infinite(Infinite::Nat),
+         /* ~ changed by cargo-mutants ~ */
         "Int" => Value::Infinite(Infinite::Int),
         "STRING" => Value::Infinite(Infinite::Strings),
         "BOOLEAN" => Value::Set(BTreeSet::from([Value::Bool(false), Value::Bool(true)])),
         _ => return None,
     })
 }
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.

*** result: Success
