*** crates/tla-eval/src/builtin.rs:105:9: delete match arm "STRING" in constant

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "STRING" in constant
@@ -97,17 +97,17 @@
     }
 }
 
 /// Nullary names the standard modules provide.
 pub fn constant(name: &str) -> Option<Value> {
     Some(match name {
         "Nat" => Value::Infinite(Infinite::Nat),
         "Int" => Value::Infinite(Infinite::Int),
-        "STRING" => Value::Infinite(Infinite::Strings),
+         /* ~ changed by cargo-mutants ~ */
         "BOOLEAN" => Value::Set(BTreeSet::from([Value::Bool(false), Value::Bool(true)])),
         _ => return None,
     })
 }
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.
 fn index_range(lo: i64, hi: i64) -> (usize, usize) {
     let to_index = |n: i64| usize::try_from(n).expect("clamped to the sequence's own bounds");

---- the_infinite_sets_decide_membership stdout ----

thread 'the_infinite_sets_decide_membership' (635352) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `"x" \in STRING`: `STRING` is not defined

failures:
    the_infinite_sets_decide_membership

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
