*** crates/tla-eval/src/builtin.rs:10:23: replace == with != in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace == with != in call
@@ -2,17 +2,17 @@
 
 use crate::error::{Error, Result, type_error};
 use crate::value::{Infinite, Value, count};
 
 /// Operators from the standard modules that specifications `EXTENDS`. They are
 /// resolved after the module's own definitions, so a spec may shadow one.
 pub fn call(name: &str, args: &[Value]) -> Result<Value> {
     let arity = |n: usize| -> Result<()> {
-        if args.len() == n {
+        if args.len() != /* ~ changed by cargo-mutants ~ */ n {
             Ok(())
         } else {
             Err(Error::Malformed(format!(
                 "{name} takes {n} argument(s), given {}",
                 args.len()
             )))
         }
     };

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (4041592) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4041589) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
Len takes 1 argument(s), given 1

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4041595) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Malformed("Cardinality takes 1 argument(s), given 1")

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term

test result: FAILED. 10 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
