*** crates/tla-eval/src/builtin.rs:113:5: replace index_range -> (usize, usize) with (1, 0)

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace index_range -> (usize, usize) with (1, 0)
@@ -105,18 +105,17 @@
         "STRING" => Value::Infinite(Infinite::Strings),
         "BOOLEAN" => Value::Set(BTreeSet::from([Value::Bool(false), Value::Bool(true)])),
         _ => return None,
     })
 }
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.
 fn index_range(lo: i64, hi: i64) -> (usize, usize) {
-    let to_index = |n: i64| usize::try_from(n).expect("clamped to the sequence's own bounds");
-    (to_index(lo) - 1, to_index(hi))
+    (1, 0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn seq<'a>(v: &'a Value, who: &str) -> Result<&'a [Value]> {
     match v {
         Value::Seq(items) => Ok(items),
         other => type_error(format!("{who} expects a sequence, got {other}")),
     }
 }

*** result: Success
