*** crates/tla-eval/src/builtin.rs:118:5: replace seq -> Result<&'a[Value]> with Ok(Vec::leak(Vec::new()))

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace seq -> Result<&'a[Value]> with Ok(Vec::leak(Vec::new()))
@@ -110,20 +110,17 @@
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.
 fn index_range(lo: i64, hi: i64) -> (usize, usize) {
     let to_index = |n: i64| usize::try_from(n).expect("clamped to the sequence's own bounds");
     (to_index(lo) - 1, to_index(hi))
 }
 
 fn seq<'a>(v: &'a Value, who: &str) -> Result<&'a [Value]> {
-    match v {
-        Value::Seq(items) => Ok(items),
-        other => type_error(format!("{who} expects a sequence, got {other}")),
-    }
+    Ok(Vec::leak(Vec::new())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn int(v: &Value, who: &str) -> Result<i64> {
     match v {
         Value::Int(n) => Ok(*n),
         other => type_error(format!("{who} expects an integer, got {other}")),
     }
 }

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (639643) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (639638) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (639645) panicked at crates/tla-eval/tests/evaluate_specs.rs:505:5:
assertion `left == right` failed
  left: "buf' = Append(buf, nextVal)"
 right: "Len(buf) < Capacity"

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
