*** crates/tla-eval/src/builtin.rs:125:5: replace int -> Result<i64> with Ok(1)

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace int -> Result<i64> with Ok(1)
@@ -117,13 +117,10 @@
 fn seq<'a>(v: &'a Value, who: &str) -> Result<&'a [Value]> {
     match v {
         Value::Seq(items) => Ok(items),
         other => type_error(format!("{who} expects a sequence, got {other}")),
     }
 }
 
 fn int(v: &Value, who: &str) -> Result<i64> {
-    match v {
-        Value::Int(n) => Ok(*n),
-        other => type_error(format!("{who} expects an integer, got {other}")),
-    }
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }

---- subseq_clamps_and_can_be_empty stdout ----

thread 'subseq_clamps_and_can_be_empty' (188468) panicked at crates/tla-eval/tests/standard_operators.rs:92:5:
assertion `left == right` failed
  left: Seq([Int(1)])
 right: Seq([Int(2), Int(3)])

failures:
    subseq_clamps_and_can_be_empty

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
