*** crates/tla-eval/src/builtin.rs:125:5: replace int -> Result<i64> with Ok(-1)

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace int -> Result<i64> with Ok(-1)
@@ -117,13 +117,10 @@
 fn seq<'a>(v: &'a Value, who: &str) -> Result<&'a [Value]> {
     match v {
         Value::Seq(items) => Ok(items),
         other => type_error(format!("{who} expects a sequence, got {other}")),
     }
 }
 
 fn int(v: &Value, who: &str) -> Result<i64> {
-    match v {
-        Value::Int(n) => Ok(*n),
-        other => type_error(format!("{who} expects an integer, got {other}")),
-    }
+    Ok(-1) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
