*** crates/tla-eval/src/builtin.rs:20:9: delete match arm "Cardinality" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Cardinality" in call
@@ -12,26 +12,17 @@
         } else {
             Err(Error::Malformed(format!(
                 "{name} takes {n} argument(s), given {}",
                 args.len()
             )))
         }
     };
     match name {
-        "Cardinality" => {
-            arity(1)?;
-            match &args[0] {
-                Value::Set(s) => Ok(Value::Int(count(s.len()))),
-                Value::Infinite(_) => Err(Error::Unbounded(
-                    "Cardinality of an infinite set".to_string(),
-                )),
-                other => type_error(format!("Cardinality expects a set, got {other}")),
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         "IsFiniteSet" => {
             arity(1)?;
             Ok(Value::Bool(matches!(args[0], Value::Set(_))))
         }
         "Len" => {
             arity(1)?;
             seq(&args[0], name).map(|s| Value::Int(count(s.len())))
         }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (175272) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Undefined("Cardinality")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (175294) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Undefined("Cardinality")

---- raft_rejects_a_second_vote_in_the_same_term stdout ----

thread 'raft_rejects_a_second_vote_in_the_same_term' (175312) panicked at crates/tla-eval/tests/evaluate_specs.rs:263:66:
called `Result::unwrap()` on an `Err` value: Undefined("Cardinality")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
