*** crates/tla-eval/src/builtin.rs:30:9: delete match arm "IsFiniteSet" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "IsFiniteSet" in call
@@ -22,20 +22,17 @@
             match &args[0] {
                 Value::Set(s) => Ok(Value::Int(count(s.len()))),
                 Value::Infinite(_) => Err(Error::Unbounded(
                     "Cardinality of an infinite set".to_string(),
                 )),
                 other => type_error(format!("Cardinality expects a set, got {other}")),
             }
         }
-        "IsFiniteSet" => {
-            arity(1)?;
-            Ok(Value::Bool(matches!(args[0], Value::Set(_))))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Len" => {
             arity(1)?;
             seq(&args[0], name).map(|s| Value::Int(count(s.len())))
         }
         "Head" => {
             arity(1)?;
             seq(&args[0], name)?
                 .first()

---- is_finite_set_distinguishes_the_enumerable stdout ----

thread 'is_finite_set_distinguishes_the_enumerable' (175343) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `IsFiniteSet({1, 2})`: `IsFiniteSet` is not defined

failures:
    is_finite_set_distinguishes_the_enumerable

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
