*** crates/tla-eval/src/builtin.rs:38:9: delete match arm "Head" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Head" in call
@@ -30,23 +30,17 @@
         "IsFiniteSet" => {
             arity(1)?;
             Ok(Value::Bool(matches!(args[0], Value::Set(_))))
         }
         "Len" => {
             arity(1)?;
             seq(&args[0], name).map(|s| Value::Int(count(s.len())))
         }
-        "Head" => {
-            arity(1)?;
-            seq(&args[0], name)?
-                .first()
-                .cloned()
-                .ok_or_else(|| Error::Type("Head of an empty sequence".to_string()))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Tail" => {
             arity(1)?;
             let s = seq(&args[0], name)?;
             if s.is_empty() {
                 return type_error("Tail of an empty sequence");
             }
             Ok(Value::Seq(s[1..].to_vec()))
         }

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4039962) panicked at crates/tla-eval/tests/evaluate_specs.rs:35:50:
called `Result::unwrap()` on an `Err` value: Undefined("Head")

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (4039963) panicked at crates/tla-eval/tests/evaluate_specs.rs:46:51:
called `Result::unwrap()` on an `Err` value: Undefined("Head")

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (4039964) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:51:
called `Result::unwrap()` on an `Err` value: Undefined("Head")

failures:
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
