*** crates/tla-eval/src/builtin.rs:53:9: delete match arm "Append" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Append" in call
@@ -45,22 +45,17 @@
         "Tail" => {
             arity(1)?;
             let s = seq(&args[0], name)?;
             if s.is_empty() {
                 return type_error("Tail of an empty sequence");
             }
             Ok(Value::Seq(s[1..].to_vec()))
         }
-        "Append" => {
-            arity(2)?;
-            let mut s = seq(&args[0], name)?.to_vec();
-            s.push(args[1].clone());
-            Ok(Value::Seq(s))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "SubSeq" => {
             arity(3)?;
             let s = seq(&args[0], name)?;
             let lo = int(&args[1], name)?.max(1);
             let hi = int(&args[2], name)?.min(count(s.len()));
             if hi < lo {
                 return Ok(Value::Seq(Vec::new()));
             }

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (4042032) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4042035) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:50:
called `Result::unwrap()` on an `Err` value: Undefined("Append")

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (4042040) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:51:
called `Result::unwrap()` on an `Err` value: Undefined("Append")

failures:
    an_allowed_step_has_nothing_to_explain
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
