*** crates/tla-eval/src/builtin.rs:59:9: delete match arm "SubSeq" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "SubSeq" in call
@@ -51,27 +51,17 @@
             Ok(Value::Seq(s[1..].to_vec()))
         }
         "Append" => {
             arity(2)?;
             let mut s = seq(&args[0], name)?.to_vec();
             s.push(args[1].clone());
             Ok(Value::Seq(s))
         }
-        "SubSeq" => {
-            arity(3)?;
-            let s = seq(&args[0], name)?;
-            let lo = int(&args[1], name)?.max(1);
-            let hi = int(&args[2], name)?.min(count(s.len()));
-            if hi < lo {
-                return Ok(Value::Seq(Vec::new()));
-            }
-            let (lo, hi) = index_range(lo, hi);
-            Ok(Value::Seq(s[lo..hi].to_vec()))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Seq" => {
             arity(1)?;
             Ok(Value::Infinite(Infinite::Sequences(Box::new(
                 args[0].clone(),
             ))))
         }
         "Assert" => {
             arity(2)?;

---- subseq_clamps_and_can_be_empty stdout ----

thread 'subseq_clamps_and_can_be_empty' (177668) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `SubSeq(<<1, 2, 3>>, 2, 3)`: `SubSeq` is not defined

failures:
    subseq_clamps_and_can_be_empty

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
