*** crates/tla-eval/src/builtin.rs:76:9: delete match arm "Assert" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Assert" in call
@@ -68,24 +68,17 @@
             Ok(Value::Seq(s[lo..hi].to_vec()))
         }
         "Seq" => {
             arity(1)?;
             Ok(Value::Infinite(Infinite::Sequences(Box::new(
                 args[0].clone(),
             ))))
         }
-        "Assert" => {
-            arity(2)?;
-            if args[0] == Value::Bool(true) {
-                Ok(Value::Bool(true))
-            } else {
-                Err(Error::Malformed(format!("assertion failed: {}", args[1])))
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         "ToString" => {
             arity(1)?;
             Ok(Value::Str(args[0].to_string()))
         }
         "Print" => {
             arity(2)?;
             Ok(args[1].clone())
         }

---- assert_passes_or_reports_its_message stdout ----

thread 'assert_passes_or_reports_its_message' (177332) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `Assert(TRUE, "unused")`: `Assert` is not defined

failures:
    assert_passes_or_reports_its_message

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
