*** crates/tla-eval/src/builtin.rs:78:24: replace == with != in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace == with != in call
@@ -70,17 +70,17 @@
         "Seq" => {
             arity(1)?;
             Ok(Value::Infinite(Infinite::Sequences(Box::new(
                 args[0].clone(),
             ))))
         }
         "Assert" => {
             arity(2)?;
-            if args[0] == Value::Bool(true) {
+            if args[0] != /* ~ changed by cargo-mutants ~ */ Value::Bool(true) {
                 Ok(Value::Bool(true))
             } else {
                 Err(Error::Malformed(format!("assertion failed: {}", args[1])))
             }
         }
         "ToString" => {
             arity(1)?;
             Ok(Value::Str(args[0].to_string()))

---- assert_passes_or_reports_its_message stdout ----

thread 'assert_passes_or_reports_its_message' (181121) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `Assert(TRUE, "unused")`: assertion failed: "unused"

failures:
    assert_passes_or_reports_its_message

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
