*** crates/tla-eval/src/builtin.rs:84:9: delete match arm "ToString" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "ToString" in call
@@ -76,20 +76,17 @@
         "Assert" => {
             arity(2)?;
             if args[0] == Value::Bool(true) {
                 Ok(Value::Bool(true))
             } else {
                 Err(Error::Malformed(format!("assertion failed: {}", args[1])))
             }
         }
-        "ToString" => {
-            arity(1)?;
-            Ok(Value::Str(args[0].to_string()))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Print" => {
             arity(2)?;
             Ok(args[1].clone())
         }
         "PrintT" => {
             arity(1)?;
             Ok(Value::Bool(true))
         }

---- printing_operators_pass_their_value_through stdout ----

thread 'printing_operators_pass_their_value_through' (630233) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `ToString(<<1, 2>>)`: `ToString` is not defined

failures:
    printing_operators_pass_their_value_through

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
