*** crates/tla-eval/src/builtin.rs:88:9: delete match arm "Print" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Print" in call
@@ -80,20 +80,17 @@
             } else {
                 Err(Error::Malformed(format!("assertion failed: {}", args[1])))
             }
         }
         "ToString" => {
             arity(1)?;
             Ok(Value::Str(args[0].to_string()))
         }
-        "Print" => {
-            arity(2)?;
-            Ok(args[1].clone())
-        }
+         /* ~ changed by cargo-mutants ~ */
         "PrintT" => {
             arity(1)?;
             Ok(Value::Bool(true))
         }
         _ => Err(Error::Undefined(name.to_string())),
     }
 }

---- printing_operators_pass_their_value_through stdout ----

thread 'printing_operators_pass_their_value_through' (631474) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `Print("label", 42)`: `Print` is not defined

failures:
    printing_operators_pass_their_value_through

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
