*** crates/tla-eval/src/builtin.rs:92:9: delete match arm "PrintT" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "PrintT" in call
@@ -84,20 +84,17 @@
         "ToString" => {
             arity(1)?;
             Ok(Value::Str(args[0].to_string()))
         }
         "Print" => {
             arity(2)?;
             Ok(args[1].clone())
         }
-        "PrintT" => {
-            arity(1)?;
-            Ok(Value::Bool(true))
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(Error::Undefined(name.to_string())),
     }
 }
 
 /// Nullary names the standard modules provide.
 pub fn constant(name: &str) -> Option<Value> {
     Some(match name {
         "Nat" => Value::Infinite(Infinite::Nat),

---- printing_operators_pass_their_value_through stdout ----

thread 'printing_operators_pass_their_value_through' (180001) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `PrintT("label")`: `PrintT` is not defined

failures:
    printing_operators_pass_their_value_through

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
