*** crates/tla-eval/src/diagnose.rs:100:18: replace >= with < in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace >= with < in Evaluator<'m>::probe
@@ -92,17 +92,17 @@
     fn probe(
         &self,
         e: &'m Expr,
         ctx: &mut Ctx<'m, '_>,
         label: Option<&str>,
         found: &mut Probe,
         depth: usize,
     ) -> Result<()> {
-        if depth >= MAX_DEPTH {
+        if depth < /* ~ changed by cargo-mutants ~ */ MAX_DEPTH {
             return Ok(());
         }
         match e {
             Expr::Binary(Op::Or, lhs, rhs) => {
                 self.probe(lhs, ctx, label, found, depth + 1)?;
                 self.probe(rhs, ctx, label, found, depth + 1)
             }
             Expr::Quant {

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4056416) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4056424) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4056435) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
