*** crates/tla-eval/src/diagnose.rs:104:13: delete match arm Expr::Binary(Op::Or, lhs, rhs) in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ delete match arm Expr::Binary(Op::Or, lhs, rhs) in Evaluator<'m>::probe
@@ -96,20 +96,17 @@
         label: Option<&str>,
         found: &mut Probe,
         depth: usize,
     ) -> Result<()> {
         if depth >= MAX_DEPTH {
             return Ok(());
         }
         match e {
-            Expr::Binary(Op::Or, lhs, rhs) => {
-                self.probe(lhs, ctx, label, found, depth + 1)?;
-                self.probe(rhs, ctx, label, found, depth + 1)
-            }
+             /* ~ changed by cargo-mutants ~ */
             Expr::Quant {
                 kind: QuantKind::Exists,
                 bounds,
                 body,
             } => {
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);
                     let walked = self.probe(body, ctx, label, found, depth + 1);

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4057340) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4057359) panicked at crates/tla-eval/tests/evaluate_specs.rs:504:5:
assertion `left == right` failed
  left: "Put \\/ Get"
 right: "Put"

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4057385) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "Timeout(s) \\/ BecomeLeader(s) \\/ (\\E c \\in Server : UpdateTerm(s, c) \\/ GrantVote(s, c))"
 right: "BecomeLeader(c = \"s1\")"

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
