*** crates/tla-eval/src/diagnose.rs:106:58: replace + with * in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with * in Evaluator<'m>::probe
@@ -98,17 +98,17 @@
         depth: usize,
     ) -> Result<()> {
         if depth >= MAX_DEPTH {
             return Ok(());
         }
         match e {
             Expr::Binary(Op::Or, lhs, rhs) => {
                 self.probe(lhs, ctx, label, found, depth + 1)?;
-                self.probe(rhs, ctx, label, found, depth + 1)
+                self.probe(rhs, ctx, label, found, depth * /* ~ changed by cargo-mutants ~ */ 1)
             }
             Expr::Quant {
                 kind: QuantKind::Exists,
                 bounds,
                 body,
             } => {
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);

*** result: Success
