*** crates/tla-eval/src/diagnose.rs:115:76: replace + with - in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with - in Evaluator<'m>::probe
@@ -107,17 +107,17 @@
             }
             Expr::Quant {
                 kind: QuantKind::Exists,
                 bounds,
                 body,
             } => {
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);
-                    let walked = self.probe(body, ctx, label, found, depth + 1);
+                    let walked = self.probe(body, ctx, label, found, depth - /* ~ changed by cargo-mutants ~ */ 1);
                     ctx.locals.truncate(restore);
                     walked?;
                 }
                 Ok(())
             }
             Expr::Let { defs, body } => {
                 let base = ctx.locals.len();
                 let scope = base + defs.len();

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (197994) panicked at crates/tla-eval/src/diagnose.rs:115:70:
attempt to subtract with overflow

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
