*** crates/tla-eval/src/diagnose.rs:121:13: delete match arm Expr::Let{defs, body} in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ delete match arm Expr::Let{defs, body} in Evaluator<'m>::probe
@@ -113,27 +113,17 @@
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);
                     let walked = self.probe(body, ctx, label, found, depth + 1);
                     ctx.locals.truncate(restore);
                     walked?;
                 }
                 Ok(())
             }
-            Expr::Let { defs, body } => {
-                let base = ctx.locals.len();
-                let scope = base + defs.len();
-                for def in defs {
-                    ctx.locals
-                        .push((def.name.clone(), Local::Def { def, scope }));
-                }
-                let walked = self.probe(body, ctx, label, found, depth + 1);
-                ctx.locals.truncate(base);
-                walked
-            }
+             /* ~ changed by cargo-mutants ~ */
             Expr::Apply(head, args) => {
                 if let Expr::Ident(name) = &**head
                     && let Some((_, def)) = self.spec.definition(ctx.module, name)
                 {
                     return self.enter(def, args, ctx, found, depth);
                 }
                 self.record(e, ctx, label, found);
                 Ok(())

*** result: Success
