*** crates/tla-eval/src/diagnose.rs:132:13: delete match arm Expr::Apply(head, args) in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ delete match arm Expr::Apply(head, args) in Evaluator<'m>::probe
@@ -124,25 +124,17 @@
                 for def in defs {
                     ctx.locals
                         .push((def.name.clone(), Local::Def { def, scope }));
                 }
                 let walked = self.probe(body, ctx, label, found, depth + 1);
                 ctx.locals.truncate(base);
                 walked
             }
-            Expr::Apply(head, args) => {
-                if let Expr::Ident(name) = &**head
-                    && let Some((_, def)) = self.spec.definition(ctx.module, name)
-                {
-                    return self.enter(def, args, ctx, found, depth);
-                }
-                self.record(e, ctx, label, found);
-                Ok(())
-            }
+             /* ~ changed by cargo-mutants ~ */
             Expr::Ident(name) => {
                 if let Some((_, def)) = self.spec.definition(ctx.module, name)
                     && def.params.is_empty()
                 {
                     return self.enter(def, &[], ctx, found, depth);
                 }
                 self.record(e, ctx, label, found);
                 Ok(())

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4059022) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "BecomeLeader(s)"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
