*** crates/tla-eval/src/diagnose.rs:141:13: delete match arm Expr::Ident(name) in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ delete match arm Expr::Ident(name) in Evaluator<'m>::probe
@@ -133,25 +133,17 @@
                 if let Expr::Ident(name) = &**head
                     && let Some((_, def)) = self.spec.definition(ctx.module, name)
                 {
                     return self.enter(def, args, ctx, found, depth);
                 }
                 self.record(e, ctx, label, found);
                 Ok(())
             }
-            Expr::Ident(name) => {
-                if let Some((_, def)) = self.spec.definition(ctx.module, name)
-                    && def.params.is_empty()
-                {
-                    return self.enter(def, &[], ctx, found, depth);
-                }
-                self.record(e, ctx, label, found);
-                Ok(())
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 self.record(e, ctx, label, found);
                 Ok(())
             }
         }
     }
 
     /// Step into a named action, naming it by the arguments it was given.

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4058437) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Get

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4058444) panicked at crates/tla-eval/tests/evaluate_specs.rs:504:5:
assertion `left == right` failed
  left: "Get"
 right: "Put"

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
