*** crates/tla-eval/src/diagnose.rs:181:76: replace + with * in Evaluator<'m>::enter

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with * in Evaluator<'m>::enter
@@ -173,17 +173,17 @@
         let label = render_call(&def.name, &def.params, &values);
 
         // An operator sees its parameters and the module, never the locals of
         // whoever called it -- the same rule evaluation follows.
         let hidden = std::mem::take(&mut ctx.locals);
         for (param, value) in def.params.iter().zip(values) {
             ctx.locals.push((param.name.clone(), Local::Val(value)));
         }
-        let walked = self.probe(&def.body, ctx, Some(&label), found, depth + 1);
+        let walked = self.probe(&def.body, ctx, Some(&label), found, depth * /* ~ changed by cargo-mutants ~ */ 1);
         ctx.locals = hidden;
         walked
     }
 
     /// Evaluate a leaf action conjunct by conjunct and keep the furthest it got.
     fn record(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>, label: Option<&str>, found: &mut Probe) {
         let parts = conjuncts(e);
         let mut satisfied = 0;

*** result: Success
