*** crates/tla-eval/src/diagnose.rs:188:9: replace Evaluator<'m>::record with ()

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace Evaluator<'m>::record with ()
@@ -180,54 +180,17 @@
         }
         let walked = self.probe(&def.body, ctx, Some(&label), found, depth + 1);
         ctx.locals = hidden;
         walked
     }
 
     /// Evaluate a leaf action conjunct by conjunct and keep the furthest it got.
     fn record(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>, label: Option<&str>, found: &mut Probe) {
-        let parts = conjuncts(e);
-        let mut satisfied = 0;
-        let mut first_failure = None;
-        for part in &parts {
-            // A conjunct after a failed guard may not be evaluable at all --
-            // `Head(buf)` once `Len(buf) > 0` is false. That is a failure to
-            // satisfy it, not a reason to abandon the whole diagnosis.
-            match self.eval_bool(part, ctx) {
-                Ok(true) => satisfied += 1,
-                Ok(false) => {
-                    first_failure.get_or_insert((*part, None));
-                }
-                Err(e) => {
-                    first_failure.get_or_insert((*part, Some(e.to_string())));
-                }
-            }
-        }
-        let Some((part, error)) = first_failure else {
-            found.allowed = true;
-            return;
-        };
-
-        let action = label.map_or_else(|| truncate(&e.to_string()), ToString::to_string);
-        let candidate = Blocked {
-            action: action.clone(),
-            satisfied,
-            total: parts.len(),
-            conjunct: truncate(&part.to_string()),
-            about_next_state: part.mentions_next_state(),
-            error,
-        };
-        let key = action.split('(').next().unwrap_or(&action).to_string();
-        match found.best.get(&key) {
-            Some(existing) if existing.closer_than(&candidate).is_ge() => {}
-            _ => {
-                found.best.insert(key, candidate);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn conjuncts(e: &Expr) -> Vec<&Expr> {
     match e {
         Expr::Binary(Op::And, lhs, rhs) => {
             let mut out = conjuncts(lhs);
             out.extend(conjuncts(rhs));

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4066113) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4066120) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4066128) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
