*** crates/tla-eval/src/diagnose.rs:196:39: replace += with -= in Evaluator<'m>::record

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace += with -= in Evaluator<'m>::record
@@ -188,17 +188,17 @@
         let parts = conjuncts(e);
         let mut satisfied = 0;
         let mut first_failure = None;
         for part in &parts {
             // A conjunct after a failed guard may not be evaluable at all --
             // `Head(buf)` once `Len(buf) > 0` is false. That is a failure to
             // satisfy it, not a reason to abandon the whole diagnosis.
             match self.eval_bool(part, ctx) {
-                Ok(true) => satisfied += 1,
+                Ok(true) => satisfied -= /* ~ changed by cargo-mutants ~ */ 1,
                 Ok(false) => {
                     first_failure.get_or_insert((*part, None));
                 }
                 Err(e) => {
                     first_failure.get_or_insert((*part, Some(e.to_string())));
                 }
             }
         }

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (656869) panicked at crates/tla-eval/src/diagnose.rs:196:29:
attempt to subtract with overflow

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (656867) panicked at crates/tla-eval/src/diagnose.rs:196:29:
attempt to subtract with overflow

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (656874) panicked at crates/tla-eval/src/diagnose.rs:196:29:
attempt to subtract with overflow

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_allowed_step_has_nothing_to_explain
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
