*** crates/tla-eval/src/diagnose.rs:221:31: replace match guard existing.closer_than(&candidate).is_ge() with true in Evaluator<'m>::record

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace match guard existing.closer_than(&candidate).is_ge() with true in Evaluator<'m>::record
@@ -213,17 +213,17 @@
             satisfied,
             total: parts.len(),
             conjunct: truncate(&part.to_string()),
             about_next_state: part.mentions_next_state(),
             error,
         };
         let key = action.split('(').next().unwrap_or(&action).to_string();
         match found.best.get(&key) {
-            Some(existing) if existing.closer_than(&candidate).is_ge() => {}
+            Some(existing) if true /* ~ changed by cargo-mutants ~ */ => {}
             _ => {
                 found.best.insert(key, candidate);
             }
         }
     }
 }
 
 fn conjuncts(e: &Expr) -> Vec<&Expr> {

*** result: Success
