*** crates/tla-eval/src/diagnose.rs:221:31: replace match guard existing.closer_than(&candidate).is_ge() with false in Evaluator<'m>::record

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace match guard existing.closer_than(&candidate).is_ge() with false in Evaluator<'m>::record
@@ -213,17 +213,17 @@
             satisfied,
             total: parts.len(),
             conjunct: truncate(&part.to_string()),
             about_next_state: part.mentions_next_state(),
             error,
         };
         let key = action.split('(').next().unwrap_or(&action).to_string();
         match found.best.get(&key) {
-            Some(existing) if existing.closer_than(&candidate).is_ge() => {}
+            Some(existing) if false /* ~ changed by cargo-mutants ~ */ => {}
             _ => {
                 found.best.insert(key, candidate);
             }
         }
     }
 }
 
 fn conjuncts(e: &Expr) -> Vec<&Expr> {

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4067359) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "UpdateTerm(v = \"s3\", c = \"s3\")"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
