*** crates/tla-eval/src/diagnose.rs:241:5: replace render_call -> String with String::new()

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace render_call -> String with String::new()
@@ -233,25 +233,17 @@
             out.extend(conjuncts(rhs));
             out
         }
         other => vec![other],
     }
 }
 
 fn render_call(name: &str, params: &[Param], values: &[Value]) -> String {
-    if params.is_empty() {
-        return name.to_string();
-    }
-    let bindings: Vec<String> = params
-        .iter()
-        .zip(values)
-        .map(|(param, value)| format!("{} = {value}", param.name))
-        .collect();
-    format!("{name}({})", bindings.join(", "))
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 const MAX_RENDERED: usize = 160;
 
 fn truncate(text: &str) -> String {
     if text.chars().count() <= MAX_RENDERED {
         return text.to_string();
     }

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (659006) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (659013) panicked at crates/tla-eval/tests/evaluate_specs.rs:504:5:
assertion `left == right` failed
  left: ""
 right: "Put"

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (659025) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: ""
 right: "BecomeLeader(c = \"s1\")"

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
