*** crates/tla-eval/src/diagnose.rs:255:29: replace <= with > in truncate

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace <= with > in truncate
@@ -247,14 +247,14 @@
         .map(|(param, value)| format!("{} = {value}", param.name))
         .collect();
     format!("{name}({})", bindings.join(", "))
 }
 
 const MAX_RENDERED: usize = 160;
 
 fn truncate(text: &str) -> String {
-    if text.chars().count() <= MAX_RENDERED {
+    if text.chars().count() > /* ~ changed by cargo-mutants ~ */ MAX_RENDERED {
         return text.to_string();
     }
     let head: String = text.chars().take(MAX_RENDERED).collect();
     format!("{head}...")
 }

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (661010) panicked at crates/tla-eval/tests/evaluate_specs.rs:505:5:
assertion `left == right` failed
  left: "Len(buf) < Capacity..."
 right: "Len(buf) < Capacity"

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (661018) panicked at crates/tla-eval/tests/evaluate_specs.rs:483:5:
assertion `left == right` failed
  left: "Cardinality(votesGranted[c]) * 2 > Cardinality(Server)..."
 right: "Cardinality(votesGranted[c]) * 2 > Cardinality(Server)"

failures:
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
