*** crates/tla-eval/src/diagnose.rs:49:25: replace * with / in Blocked::closer_than

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace * with / in Blocked::closer_than
@@ -41,17 +41,17 @@
     /// FALSE — a guard that would have protected it has already failed.
     pub error: Option<String>,
 }
 
 impl Blocked {
     /// Closeness as a fraction of the action's conjuncts, compared without
     /// floating point.
     fn closer_than(&self, other: &Self) -> std::cmp::Ordering {
-        (self.satisfied * other.total).cmp(&(other.satisfied * self.total))
+        (self.satisfied / /* ~ changed by cargo-mutants ~ */ other.total).cmp(&(other.satisfied * self.total))
     }
 }
 
 /// Actions are not followed deeper than this; a specification that nests
 /// disjunctions further is reported on as far as it was explored.
 const MAX_DEPTH: usize = 16;
 
 #[derive(Default)]

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (642742) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "UpdateTerm(v = \"s3\", c = \"s3\")"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
