*** crates/tla-eval/src/diagnose.rs:49:62: replace * with + in Blocked::closer_than

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace * with + in Blocked::closer_than
@@ -41,17 +41,17 @@
     /// FALSE — a guard that would have protected it has already failed.
     pub error: Option<String>,
 }
 
 impl Blocked {
     /// Closeness as a fraction of the action's conjuncts, compared without
     /// floating point.
     fn closer_than(&self, other: &Self) -> std::cmp::Ordering {
-        (self.satisfied * other.total).cmp(&(other.satisfied * self.total))
+        (self.satisfied * other.total).cmp(&(other.satisfied + /* ~ changed by cargo-mutants ~ */ self.total))
     }
 }
 
 /// Actions are not followed deeper than this; a specification that nests
 /// disjunctions further is reported on as far as it was explored.
 const MAX_DEPTH: usize = 16;
 
 #[derive(Default)]

*** result: Success
