*** crates/tla-eval/src/diagnose.rs:49:62: replace * with / in Blocked::closer_than

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace * with / in Blocked::closer_than
@@ -41,17 +41,17 @@
     /// FALSE — a guard that would have protected it has already failed.
     pub error: Option<String>,
 }
 
 impl Blocked {
     /// Closeness as a fraction of the action's conjuncts, compared without
     /// floating point.
     fn closer_than(&self, other: &Self) -> std::cmp::Ordering {
-        (self.satisfied * other.total).cmp(&(other.satisfied * self.total))
+        (self.satisfied * other.total).cmp(&(other.satisfied / /* ~ changed by cargo-mutants ~ */ self.total))
     }
 }
 
 /// Actions are not followed deeper than this; a specification that nests
 /// disjunctions further is reported on as far as it was explored.
 const MAX_DEPTH: usize = 16;
 
 #[derive(Default)]

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (191321) panicked at crates/tla-eval/tests/evaluate_specs.rs:504:5:
assertion `left == right` failed
  left: "Get"
 right: "Put"

failures:
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
