*** crates/tla-eval/src/diagnose.rs:74:9: replace Evaluator<'m>::why_not -> Result<Vec<Blocked>> with Ok(vec![])

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace Evaluator<'m>::why_not -> Result<Vec<Blocked>> with Ok(vec![])
@@ -66,30 +66,17 @@
 impl<'m> Evaluator<'m> {
     /// The actions that came closest to permitting `from -> to`, closest
     /// first.
     ///
     /// Empty when the step is allowed. Every action other than the one taken
     /// fails at such a step, and reporting those would be noise rather than a
     /// diagnosis.
     pub fn why_not(&self, name: &str, from: &State, to: &State) -> Result<Vec<Blocked>> {
-        let body = self.body_of(name)?;
-        let mut ctx = self.ctx(from, Some(to));
-        let mut found = Probe::default();
-        self.probe(body, &mut ctx, None, &mut found, 0)?;
-        if found.allowed {
-            return Ok(Vec::new());
-        }
-        let mut out: Vec<Blocked> = found.best.into_values().collect();
-        out.sort_by(|a, b| {
-            b.closer_than(a)
-                .then_with(|| b.satisfied.cmp(&a.satisfied))
-                .then_with(|| a.action.cmp(&b.action))
-        });
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Walk the disjunctive structure of an action, keeping track of which
     /// named action the current branch belongs to.
     fn probe(
         &self,
         e: &'m Expr,
         ctx: &mut Ctx<'m, '_>,

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4056697) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4056705) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (4056713) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
