*** crates/tla-eval/src/eval.rs:1030:5: replace symbol_operator -> Option<Op> with None

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace symbol_operator -> Option<Op> with None
@@ -1022,34 +1022,17 @@
             .ok_or_else(|| Error::Type(format!("EXCEPT: {base} is not a function")))?;
         entries.insert(key, replacement);
         Ok(Value::function(entries))
     }
 }
 
 /// The operator a bare symbol names, for `FoldSet(+, 0, S)`.
 fn symbol_operator(name: &str) -> Option<Op> {
-    const CANDIDATES: &[Op] = &[
-        Op::Plus,
-        Op::Minus,
-        Op::Times,
-        Op::Div,
-        Op::Mod,
-        Op::Pow,
-        Op::Cup,
-        Op::Cap,
-        Op::SetMinus,
-        Op::Concat,
-        Op::AtAt,
-        Op::And,
-        Op::Or,
-        Op::Eq,
-        Op::DotDot,
-    ];
-    CANDIDATES.iter().copied().find(|op| op.symbol() == name)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn lookup<'m>(name: &str, ctx: &Ctx<'m, '_>) -> Option<Local<'m>> {
     ctx.locals
         .iter()
         .rev()
         .find(|(n, _)| n == name)
         .map(|(_, local)| local.clone())

---- an_operator_symbol_may_be_passed stdout ----

thread 'an_operator_symbol_may_be_passed' (246318) panicked at crates/tla-eval/tests/modules.rs:113:53:
called `Result::unwrap()` on an `Err` value: Undefined("+")

failures:
    an_operator_symbol_may_be_passed

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
