*** crates/tla-eval/src/eval.rs:1047:54: replace == with != in symbol_operator

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in symbol_operator
@@ -1039,17 +1039,17 @@
         Op::SetMinus,
         Op::Concat,
         Op::AtAt,
         Op::And,
         Op::Or,
         Op::Eq,
         Op::DotDot,
     ];
-    CANDIDATES.iter().copied().find(|op| op.symbol() == name)
+    CANDIDATES.iter().copied().find(|op| op.symbol() != /* ~ changed by cargo-mutants ~ */ name)
 }
 
 fn lookup<'m>(name: &str, ctx: &Ctx<'m, '_>) -> Option<Local<'m>> {
     ctx.locals
         .iter()
         .rev()
         .find(|(n, _)| n == name)
         .map(|(_, local)| local.clone())

---- an_operator_symbol_may_be_passed stdout ----

thread 'an_operator_symbol_may_be_passed' (4099593) panicked at crates/tla-eval/tests/modules.rs:112:5:
assertion `left == right` failed
  left: Int(-1)
 right: Int(5)

failures:
    an_operator_symbol_may_be_passed

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
