*** crates/tla-eval/src/eval.rs:1054:26: replace == with != in lookup

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in lookup
@@ -1046,17 +1046,17 @@
     ];
     CANDIDATES.iter().copied().find(|op| op.symbol() == name)
 }
 
 fn lookup<'m>(name: &str, ctx: &Ctx<'m, '_>) -> Option<Local<'m>> {
     ctx.locals
         .iter()
         .rev()
-        .find(|(n, _)| n == name)
+        .find(|(n, _)| n != /* ~ changed by cargo-mutants ~ */ name)
         .map(|(_, local)| local.clone())
 }
 
 pub(crate) fn push(ctx: &mut Ctx<'_, '_>, binding: &[(String, Value)]) -> usize {
     let restore = ctx.locals.len();
     for (name, value) in binding {
         ctx.locals.push((name.clone(), Local::Val(value.clone())));
     }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (247632) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (247652) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Type("expected a set, got a string (\"n1\")")

---- raft_rejects_a_second_vote_in_the_same_term stdout ----

thread 'raft_rejects_a_second_vote_in_the_same_term' (247651) panicked at crates/tla-eval/tests/evaluate_specs.rs:263:66:
called `Result::unwrap()` on an `Err` value: Malformed("`Timeout` is a value, and cannot be applied to arguments")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
