*** crates/tla-eval/src/eval.rs:1059:5: replace push -> usize with 1

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace push -> usize with 1
@@ -1051,21 +1051,17 @@
     ctx.locals
         .iter()
         .rev()
         .find(|(n, _)| n == name)
         .map(|(_, local)| local.clone())
 }
 
 pub(crate) fn push(ctx: &mut Ctx<'_, '_>, binding: &[(String, Value)]) -> usize {
-    let restore = ctx.locals.len();
-    for (name, value) in binding {
-        ctx.locals.push((name.clone(), Local::Val(value.clone())));
-    }
-    restore
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// The value a binding contributes to a set or a function's domain: the single
 /// bound variable, or the tuple of them.
 fn element_of(binding: &[(String, Value)]) -> Value {
     if let [(_, only)] = binding {
         only.clone()
     } else {

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (700504) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Undefined("x")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (700512) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Undefined("s")

---- raft_rejects_a_second_vote_in_the_same_term stdout ----

thread 'raft_rejects_a_second_vote_in_the_same_term' (700513) panicked at crates/tla-eval/tests/evaluate_specs.rs:263:66:
called `Result::unwrap()` on an `Err` value: Undefined("s")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
