*** crates/tla-eval/src/eval.rs:1086:39: replace >> with << in powerset

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace >> with << in powerset
@@ -1078,17 +1078,17 @@
     let count = 1usize.checked_shl(bits).unwrap_or(usize::MAX);
     check_size(count, "SUBSET")?;
     let mut out = BTreeSet::new();
     for mask in 0..count {
         out.insert(Value::set(
             items
                 .iter()
                 .enumerate()
-                .filter(|(i, _)| mask >> i & 1 == 1)
+                .filter(|(i, _)| mask << /* ~ changed by cargo-mutants ~ */ i & 1 == 1)
                 .map(|(_, v)| v.clone()),
         ));
     }
     Ok(Value::Set(out))
 }
 
 fn check_size(count: usize, what: &str) -> Result<()> {
     if count > MAX_ELEMENTS {

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (702599) panicked at crates/tla-eval/tests/evaluate_specs.rs:332:5:
assertion failed: e.holds_at("TypeOK", &init).unwrap()

failures:
    ring_election_builds_its_initial_state

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
