*** crates/tla-eval/src/eval.rs:1094:14: replace > with < in check_size

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace > with < in check_size
@@ -1086,17 +1086,17 @@
                 .filter(|(i, _)| mask >> i & 1 == 1)
                 .map(|(_, v)| v.clone()),
         ));
     }
     Ok(Value::Set(out))
 }
 
 fn check_size(count: usize, what: &str) -> Result<()> {
-    if count > MAX_ELEMENTS {
+    if count < /* ~ changed by cargo-mutants ~ */ MAX_ELEMENTS {
         return Err(Error::Unbounded(format!(
             "{what} would have {count} elements, over the {MAX_ELEMENTS} limit"
         )));
     }
     Ok(())
 }
 
 /// Every member of a set, for the operations that have to visit them all.

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (252282) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:39:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 1048576 limit")

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (252291) panicked at crates/tla-eval/tests/evaluate_specs.rs:401:39:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 1048576 limit")

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (252298) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 1048576 limit")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
