*** crates/tla-eval/src/eval.rs:1094:14: replace > with >= in check_size

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace > with >= in check_size
@@ -1086,17 +1086,17 @@
                 .filter(|(i, _)| mask >> i & 1 == 1)
                 .map(|(_, v)| v.clone()),
         ));
     }
     Ok(Value::Set(out))
 }
 
 fn check_size(count: usize, what: &str) -> Result<()> {
-    if count > MAX_ELEMENTS {
+    if count >= /* ~ changed by cargo-mutants ~ */ MAX_ELEMENTS {
         return Err(Error::Unbounded(format!(
             "{what} would have {count} elements, over the {MAX_ELEMENTS} limit"
         )));
     }
     Ok(())
 }
 
 /// Every member of a set, for the operations that have to visit them all.

*** result: Success
