*** crates/tla-eval/src/eval.rs:1094:5: replace check_size -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace check_size -> Result<()> with Ok(())
@@ -1086,22 +1086,17 @@
                 .filter(|(i, _)| mask >> i & 1 == 1)
                 .map(|(_, v)| v.clone()),
         ));
     }
     Ok(Value::Set(out))
 }
 
 fn check_size(count: usize, what: &str) -> Result<()> {
-    if count > MAX_ELEMENTS {
-        return Err(Error::Unbounded(format!(
-            "{what} would have {count} elements, over the {MAX_ELEMENTS} limit"
-        )));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Every member of a set, for the operations that have to visit them all.
 /// Membership of an infinite set is decidable where enumeration is not, so the
 /// two failures are reported differently.
 fn elements(v: &Value) -> Result<Vec<Value>> {
     if matches!(v, Value::Infinite(_)) {
         return Err(Error::Unbounded(format!("{v} cannot be enumerated")));

*** result: Success
