*** crates/tla-eval/src/eval.rs:1106:5: replace elements -> Result<Vec<Value>> with Ok(vec![])

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace elements -> Result<Vec<Value>> with Ok(vec![])
@@ -1098,20 +1098,17 @@
     }
     Ok(())
 }
 
 /// Every member of a set, for the operations that have to visit them all.
 /// Membership of an infinite set is decidable where enumeration is not, so the
 /// two failures are reported differently.
 fn elements(v: &Value) -> Result<Vec<Value>> {
-    if matches!(v, Value::Infinite(_)) {
-        return Err(Error::Unbounded(format!("{v} cannot be enumerated")));
-    }
-    Ok(set_of(v)?.iter().cloned().collect())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn member(elem: &Value, set: &Value) -> Result<bool> {
     match set {
         Value::Set(s) => Ok(s.contains(elem)),
         Value::Infinite(Infinite::Nat) => Ok(matches!(elem, Value::Int(n) if *n >= 0)),
         Value::Infinite(Infinite::Int) => Ok(matches!(elem, Value::Int(_))),
         Value::Infinite(Infinite::Strings) => Ok(matches!(elem, Value::Str(_))),

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (706200) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (706210) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (706208) panicked at crates/tla-eval/tests/evaluate_specs.rs:239:5:
assertion failed: e.step_allowed("Next", &two_votes, &legal).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
