*** crates/tla-eval/src/eval.rs:1107:5: replace member -> Result<bool> with Ok(true)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace member -> Result<bool> with Ok(true)
@@ -1099,34 +1099,17 @@
     Ok(())
 }
 
 fn elements(v: &Value) -> Result<Vec<Value>> {
     Ok(set_of(v)?.iter().cloned().collect())
 }
 
 fn member(elem: &Value, set: &Value) -> Result<bool> {
-    match set {
-        Value::Set(s) => Ok(s.contains(elem)),
-        Value::Infinite(Infinite::Nat) => Ok(matches!(elem, Value::Int(n) if *n >= 0)),
-        Value::Infinite(Infinite::Int) => Ok(matches!(elem, Value::Int(_))),
-        Value::Infinite(Infinite::Strings) => Ok(matches!(elem, Value::Str(_))),
-        Value::Infinite(Infinite::Sequences(of)) => {
-            let Value::Seq(items) = elem else {
-                return Ok(false);
-            };
-            for item in items {
-                if !member(item, of)? {
-                    return Ok(false);
-                }
-            }
-            Ok(true)
-        }
-        other => type_error(format!("\\in expects a set on the right, got {other}")),
-    }
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn set_of(v: &Value) -> Result<&BTreeSet<Value>> {
     match v {
         Value::Set(s) => Ok(s),
         Value::Infinite(_) => Err(Error::Unbounded(format!(
             "{v} cannot take part in a set operation"
         ))),

*** result: Success
