*** crates/tla-eval/src/eval.rs:1113:5: replace member -> Result<bool> with Ok(false)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace member -> Result<bool> with Ok(false)
@@ -1105,34 +1105,17 @@
 fn elements(v: &Value) -> Result<Vec<Value>> {
     if matches!(v, Value::Infinite(_)) {
         return Err(Error::Unbounded(format!("{v} cannot be enumerated")));
     }
     Ok(set_of(v)?.iter().cloned().collect())
 }
 
 fn member(elem: &Value, set: &Value) -> Result<bool> {
-    match set {
-        Value::Set(s) => Ok(s.contains(elem)),
-        Value::Infinite(Infinite::Nat) => Ok(matches!(elem, Value::Int(n) if *n >= 0)),
-        Value::Infinite(Infinite::Int) => Ok(matches!(elem, Value::Int(_))),
-        Value::Infinite(Infinite::Strings) => Ok(matches!(elem, Value::Str(_))),
-        Value::Infinite(Infinite::Sequences(of)) => {
-            let Value::Seq(items) = elem else {
-                return Ok(false);
-            };
-            for item in items {
-                if !member(item, of)? {
-                    return Ok(false);
-                }
-            }
-            Ok(true)
-        }
-        other => type_error(format!("\\in expects a set on the right, got {other}")),
-    }
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 fn set_of(v: &Value) -> Result<&BTreeSet<Value>> {
     match v {
         Value::Set(s) => Ok(s),
         Value::Infinite(_) => Err(Error::Unbounded(format!(
             "{v} cannot take part in a set operation"
         ))),

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (254660) panicked at crates/tla-eval/tests/evaluate_specs.rs:29:5:
assertion failed: e.holds_at("TypeOK", &empty).unwrap()

---- two_phase_accepts_prepare_and_abort stdout ----

thread 'two_phase_accepts_prepare_and_abort' (254672) panicked at crates/tla-eval/tests/evaluate_specs.rs:90:5:
assertion failed: e.holds_at("TPTypeOK", &init).unwrap()

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (254664) panicked at crates/tla-eval/tests/evaluate_specs.rs:402:5:
assertion failed: e.holds_at("TypeOK", &init).unwrap()

failures:
    bounded_buffer_accepts_the_protocol
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort

test result: FAILED. 14 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
