*** crates/tla-eval/src/eval.rs:1123:20: delete ! in member

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in member
@@ -1115,17 +1115,17 @@
         Value::Infinite(Infinite::Nat) => Ok(matches!(elem, Value::Int(n) if *n >= 0)),
         Value::Infinite(Infinite::Int) => Ok(matches!(elem, Value::Int(_))),
         Value::Infinite(Infinite::Strings) => Ok(matches!(elem, Value::Str(_))),
         Value::Infinite(Infinite::Sequences(of)) => {
             let Value::Seq(items) = elem else {
                 return Ok(false);
             };
             for item in items {
-                if !member(item, of)? {
+                if  /* ~ changed by cargo-mutants ~ */member(item, of)? {
                     return Ok(false);
                 }
             }
             Ok(true)
         }
         other => type_error(format!("\\in expects a set on the right, got {other}")),
     }
 }

---- the_set_of_sequences_supports_membership_only stdout ----

thread 'the_set_of_sequences_supports_membership_only' (707062) panicked at crates/tla-eval/tests/standard_operators.rs:103:5:
assertion `left == right` failed
  left: Bool(false)
 right: Bool(true)

failures:
    the_set_of_sequences_supports_membership_only

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
