*** crates/tla-eval/src/eval.rs:1134:5: replace set_of -> Result<&BTreeSet<Value>> with Ok(Box::leak(Box::new(BTreeSet::new())))

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace set_of -> Result<&BTreeSet<Value>> with Ok(Box::leak(Box::new(BTreeSet::new())))
@@ -1126,26 +1126,17 @@
             }
             Ok(true)
         }
         other => type_error(format!("\\in expects a set on the right, got {other}")),
     }
 }
 
 fn set_of(v: &Value) -> Result<&BTreeSet<Value>> {
-    match v {
-        Value::Set(s) => Ok(s),
-        Value::Infinite(_) => Err(Error::Unbounded(format!(
-            "{v} cannot take part in a set operation"
-        ))),
-        other => type_error(format!(
-            "expected a set, got {} ({other})",
-            other.type_name()
-        )),
-    }
+    Ok(Box::leak(Box::new(BTreeSet::new()))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn as_int(v: &Value) -> Result<i64> {
     match v {
         Value::Int(n) => Ok(*n),
         other => type_error(format!("expected an integer, got {other}")),
     }
 }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (256295) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (256302) panicked at crates/tla-eval/tests/evaluate_specs.rs:189:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (256300) panicked at crates/tla-eval/tests/evaluate_specs.rs:401:5:
assertion failed: e.holds_at("Init", &init).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
