*** crates/tla-eval/src/eval.rs:1147:5: replace as_int -> Result<i64> with Ok(0)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace as_int -> Result<i64> with Ok(0)
@@ -1139,20 +1139,17 @@
         other => type_error(format!(
             "expected a set, got {} ({other})",
             other.type_name()
         )),
     }
 }
 
 fn as_int(v: &Value) -> Result<i64> {
-    match v {
-        Value::Int(n) => Ok(*n),
-        other => type_error(format!("expected an integer, got {other}")),
-    }
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn as_bool(v: &Value) -> Result<bool> {
     match v {
         Value::Bool(b) => Ok(*b),
         other => type_error(format!("expected a boolean, got {other}")),
     }
 }

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (256677) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: false

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (256676) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (256679) panicked at crates/tla-eval/tests/evaluate_specs.rs:284:5:
assertion `left == right` failed
  left: Int(0)
 right: Int(10)

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    closeness_is_measured_over_all_of_an_actions_conjuncts
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
