*** crates/tla-eval/src/eval.rs:14:35: replace << with >>

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace << with >>
@@ -6,17 +6,17 @@
 use crate::builtin;
 use crate::error::{Error, Result, type_error};
 use crate::spec::Spec;
 use crate::value::{Infinite, Value};
 
 /// Nothing enumerable is materialized beyond this many elements. The bound
 /// exists so a `SUBSET` or `[S -> T]` over an unexpectedly large set reports a
 /// limit instead of exhausting memory.
-pub const MAX_ELEMENTS: usize = 1 << 20;
+pub const MAX_ELEMENTS: usize = 1 >> /* ~ changed by cargo-mutants ~ */ 20;
 
 const MAX_DEPTH: usize = 512;
 
 /// A binding of every variable the specification declares.
 pub type State = BTreeMap<String, Value>;
 
 #[derive(Debug)]
 pub struct Evaluator<'m> {

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4070465) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:39:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 0 limit")

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (4070472) panicked at crates/tla-eval/tests/evaluate_specs.rs:189:39:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 0 limit")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (4070473) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Unbounded("a quantifier would have 1 elements, over the 0 limit")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
