*** crates/tla-eval/src/eval.rs:246:9: replace Evaluator<'m>::eval_bool -> Result<bool> with Ok(true)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::eval_bool -> Result<bool> with Ok(true)
@@ -238,20 +238,17 @@
             Expr::ActionAngle { .. } | Expr::Fairness { .. } => Err(Error::NotGround(
                 "a fairness or angle-bracket formula is about behaviours, not about one step"
                     .to_string(),
             )),
         }
     }
 
     pub(crate) fn eval_bool(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<bool> {
-        match self.eval(e, ctx)? {
-            Value::Bool(b) => Ok(b),
-            other => type_error(format!("expected a boolean, got {other}")),
-        }
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     fn eval_all(&self, items: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Vec<Value>> {
         items.iter().map(|e| self.eval(e, ctx)).collect()
     }
 
     fn key(&self, args: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let mut values = self.eval_all(args, ctx)?;

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4073627) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4073626) panicked at crates/tla-eval/tests/evaluate_specs.rs:442:10:
Spec is a temporal formula: true

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4073629) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: true

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_rejects_a_proposal_without_a_quorum
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id

test result: FAILED. 6 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
