*** crates/tla-eval/src/eval.rs:246:9: replace Evaluator<'m>::eval_bool -> Result<bool> with Ok(false)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::eval_bool -> Result<bool> with Ok(false)
@@ -238,20 +238,17 @@
             Expr::ActionAngle { .. } | Expr::Fairness { .. } => Err(Error::NotGround(
                 "a fairness or angle-bracket formula is about behaviours, not about one step"
                     .to_string(),
             )),
         }
     }
 
     pub(crate) fn eval_bool(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<bool> {
-        match self.eval(e, ctx)? {
-            Value::Bool(b) => Ok(b),
-            other => type_error(format!("expected a boolean, got {other}")),
-        }
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     fn eval_all(&self, items: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Vec<Value>> {
         items.iter().map(|e| self.eval(e, ctx)).collect()
     }
 
     fn key(&self, args: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let mut values = self.eval_all(args, ctx)?;

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (214027) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (214028) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: false

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (214030) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
