*** crates/tla-eval/src/eval.rs:309:16: delete ! in Evaluator<'m>::ident

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in Evaluator<'m>::ident
@@ -301,17 +301,17 @@
             return source.get(name).cloned().ok_or_else(|| {
                 Error::Malformed(format!("the state gives no value for variable `{name}`"))
             });
         }
         if let Some(v) = self.constants.get(name) {
             return Ok(v.clone());
         }
         if let Some((module, def)) = self.spec.definition(ctx.module, name) {
-            if !def.params.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */def.params.is_empty() {
                 return Err(Error::Malformed(format!(
                     "`{name}` takes {} argument(s) but was used as a value",
                     def.params.len()
                 )));
             }
             return self.in_module(module, ctx, |me, ctx| me.call(def, 0, &[], ctx));
         }
         if self.spec.declares_constant(ctx.module, name) {

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4075263) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
`Init` takes 0 argument(s) but was used as a value

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4075265) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
`Put` takes 0 argument(s) but was used as a value

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (4075269) panicked at crates/tla-eval/tests/evaluate_specs.rs:46:51:
called `Result::unwrap()` on an `Err` value: Malformed("`Put` takes 0 argument(s) but was used as a value")

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort

test result: FAILED. 7 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
