*** crates/tla-eval/src/eval.rs:419:42: replace == with != in Evaluator<'m>::invoke

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::invoke
@@ -411,17 +411,17 @@
                 "`{}` takes {} argument(s), given {}",
                 def.name,
                 def.params.len(),
                 args.len()
             )));
         }
         let mut bindings = Vec::with_capacity(args.len());
         for (param, arg) in def.params.iter().zip(args) {
-            bindings.push(if param.arity == 0 {
+            bindings.push(if param.arity != /* ~ changed by cargo-mutants ~ */ 0 {
                 Local::Val(self.eval(arg, ctx)?)
             } else {
                 self.operator_argument(arg, ctx)?
             });
         }
         self.run(&def.name, &def.body, scope, &def.params, bindings, ctx)
     }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (217277) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Malformed("`S` is an operator and must be applied to arguments")

---- raft_rejects_a_second_vote_in_the_same_term stdout ----

thread 'raft_rejects_a_second_vote_in_the_same_term' (217286) panicked at crates/tla-eval/tests/evaluate_specs.rs:263:66:
called `Result::unwrap()` on an `Err` value: Malformed("`s` is an operator and must be applied to arguments")

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (217288) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:56:
called `Result::unwrap()` on an `Err` value: Malformed("`v` is an operator and must be applied to arguments")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
