*** crates/tla-eval/src/eval.rs:437:25: replace != with == in Evaluator<'m>::enter_closure

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace != with == in Evaluator<'m>::enter_closure
@@ -429,17 +429,17 @@
         &self,
         name: &str,
         params: &'m [Param],
         body: &'m Expr,
         scope: usize,
         args: &'m [Expr],
         ctx: &mut Ctx<'m, '_>,
     ) -> Result<Value> {
-        if params.len() != args.len() {
+        if params.len() == /* ~ changed by cargo-mutants ~ */ args.len() {
             return Err(Error::Malformed(format!(
                 "`{name}` takes {} argument(s), given {}",
                 params.len(),
                 args.len()
             )));
         }
         let mut bindings = Vec::with_capacity(args.len());
         for (param, arg) in params.iter().zip(args) {

---- a_lambda_may_be_passed_and_applied stdout ----

thread 'a_lambda_may_be_passed_and_applied' (217973) panicked at crates/tla-eval/tests/modules.rs:102:53:
called `Result::unwrap()` on an `Err` value: Malformed("`f` takes 1 argument(s), given 1")

---- a_lambda_sees_the_state_it_was_written_in stdout ----

thread 'a_lambda_sees_the_state_it_was_written_in' (217975) panicked at crates/tla-eval/tests/modules.rs:123:51:
called `Result::unwrap()` on an `Err` value: Malformed("`op` takes 2 argument(s), given 2")

---- an_operator_may_be_passed_by_name stdout ----

thread 'an_operator_may_be_passed_by_name' (217986) panicked at crates/tla-eval/tests/modules.rs:92:51:
called `Result::unwrap()` on an `Err` value: Malformed("`f` takes 1 argument(s), given 1")

failures:
    a_lambda_may_be_passed_and_applied
    a_lambda_sees_the_state_it_was_written_in
    an_operator_may_be_passed_by_name

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
