*** crates/tla-eval/src/eval.rs:446:42: replace == with != in Evaluator<'m>::enter_closure

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::enter_closure
@@ -438,17 +438,17 @@
             return Err(Error::Malformed(format!(
                 "`{name}` takes {} argument(s), given {}",
                 params.len(),
                 args.len()
             )));
         }
         let mut bindings = Vec::with_capacity(args.len());
         for (param, arg) in params.iter().zip(args) {
-            bindings.push(if param.arity == 0 {
+            bindings.push(if param.arity != /* ~ changed by cargo-mutants ~ */ 0 {
                 Local::Val(self.eval(arg, ctx)?)
             } else {
                 self.operator_argument(arg, ctx)?
             });
         }
         self.run(name, body, scope, params, bindings, ctx)
     }

---- a_lambda_may_be_passed_and_applied stdout ----

thread 'a_lambda_may_be_passed_and_applied' (4077029) panicked at crates/tla-eval/tests/modules.rs:102:53:
called `Result::unwrap()` on an `Err` value: Malformed("an operator was expected here, but f(v) is an expression")

---- a_lambda_sees_the_state_it_was_written_in stdout ----

thread 'a_lambda_sees_the_state_it_was_written_in' (4077030) panicked at crates/tla-eval/tests/modules.rs:123:51:
called `Result::unwrap()` on an `Err` value: Malformed("`a` is an operator and must be applied to arguments")

---- an_operator_may_be_passed_by_name stdout ----

thread 'an_operator_may_be_passed_by_name' (4077037) panicked at crates/tla-eval/tests/modules.rs:92:51:
called `Result::unwrap()` on an `Err` value: Malformed("an operator was expected here, but f(v) is an expression")

failures:
    a_lambda_may_be_passed_and_applied
    a_lambda_sees_the_state_it_was_written_in
    an_operator_may_be_passed_by_name

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
