*** crates/tla-eval/src/eval.rs:561:9: replace Evaluator<'m>::bind_substitutions -> usize with 1

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::bind_substitutions -> usize with 1
@@ -553,29 +553,17 @@
         // written in, so they are bound before the arguments are read.
         let scope = Self::bind_substitutions(found, ctx);
         let out = self.in_module(module, ctx, |me, ctx| me.invoke(def, scope, args, ctx));
         ctx.locals.truncate(scope);
         out
     }
 
     fn bind_substitutions(instance: &'m crate::spec::Instance, ctx: &mut Ctx<'m, '_>) -> usize {
-        let outer = ctx.locals.len();
-        let here = ctx.module;
-        for (name, expr) in &instance.subs {
-            ctx.locals.push((
-                name.clone(),
-                Local::Subst {
-                    expr,
-                    module: here,
-                    scope: outer,
-                },
-            ));
-        }
-        ctx.locals.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Evaluate a body with its parameters bound and the caller's locals
     /// hidden, which is the one rule operator application has to follow.
     fn run(
         &self,
         name: &str,
         body: &'m Expr,

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (4078661) panicked at crates/tla-eval/src/eval.rs:580:33:
`at` split index (is 1) should be <= len (is 0)

---- an_instance_substitutes_constants_and_variables stdout ----

thread 'an_instance_substitutes_constants_and_variables' (4078663) panicked at crates/tla-eval/src/eval.rs:580:33:
`at` split index (is 1) should be <= len (is 0)

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (4078667) panicked at crates/tla-eval/src/eval.rs:580:33:
`at` split index (is 1) should be <= len (is 0)

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    an_instance_substitutes_constants_and_variables
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
