*** crates/tla-eval/src/eval.rs:587:22: replace >= with < in Evaluator<'m>::run

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace >= with < in Evaluator<'m>::run
@@ -579,17 +579,17 @@
         &self,
         name: &str,
         body: &'m Expr,
         scope: usize,
         params: &[Param],
         bindings: Vec<Local<'m>>,
         ctx: &mut Ctx<'m, '_>,
     ) -> Result<Value> {
-        if ctx.depth >= MAX_DEPTH {
+        if ctx.depth < /* ~ changed by cargo-mutants ~ */ MAX_DEPTH {
             return Err(Error::Malformed(format!(
                 "`{name}` recursed more than {MAX_DEPTH} deep"
             )));
         }
         let hidden = ctx.locals.split_off(scope);
         for (param, binding) in params.iter().zip(bindings) {
             ctx.locals.push((param.name.clone(), binding));
         }

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4078742) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
`Init` recursed more than 512 deep

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4078744) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
`Put` recursed more than 512 deep

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4078747) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:50:
called `Result::unwrap()` on an `Err` value: Malformed("`Put` recursed more than 512 deep")

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state

test result: FAILED. 5 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
