*** crates/tla-eval/src/eval.rs:596:19: replace += with *= in Evaluator<'m>::run

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace += with *= in Evaluator<'m>::run
@@ -588,17 +588,17 @@
             return Err(Error::Malformed(format!(
                 "`{name}` recursed more than {MAX_DEPTH} deep"
             )));
         }
         let hidden = ctx.locals.split_off(scope);
         for (param, binding) in params.iter().zip(bindings) {
             ctx.locals.push((param.name.clone(), binding));
         }
-        ctx.depth += 1;
+        ctx.depth *= /* ~ changed by cargo-mutants ~ */ 1;
         let out = self.eval(body, ctx);
         ctx.depth -= 1;
         ctx.locals.truncate(scope);
         ctx.locals.extend(hidden);
         out
     }
 
     fn call(

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4080075) panicked at crates/tla-eval/src/eval.rs:598:9:
attempt to subtract with overflow

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4080077) panicked at crates/tla-eval/src/eval.rs:598:9:
attempt to subtract with overflow

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4080079) panicked at crates/tla-eval/src/eval.rs:598:9:
attempt to subtract with overflow

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
