*** crates/tla-eval/src/eval.rs:633:39: delete ! in Evaluator<'m>::unary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in Evaluator<'m>::unary
@@ -625,17 +625,17 @@
     fn unary(&self, op: Op, inner: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         if let Some((module, def)) = self.spec.definition(ctx.module, op.symbol())
             && def.params.len() == 1
         {
             let values = vec![self.eval(inner, ctx)?];
             return self.in_module(module, ctx, |me, ctx| me.call(def, 0, &values, ctx));
         }
         match op {
-            Op::Not => Ok(Value::Bool(!self.eval_bool(inner, ctx)?)),
+            Op::Not => Ok(Value::Bool( /* ~ changed by cargo-mutants ~ */self.eval_bool(inner, ctx)?)),
             Op::Minus => match self.eval(inner, ctx)? {
                 Value::Int(n) => Ok(Value::Int(-n)),
                 other => type_error(format!("cannot negate {other}")),
             },
             Op::Domain => {
                 let v = self.eval(inner, ctx)?;
                 v.domain()
                     .map(Value::Set)

*** result: Success
