*** crates/tla-eval/src/eval.rs:635:48: delete - in Evaluator<'m>::unary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete - in Evaluator<'m>::unary
@@ -627,17 +627,17 @@
             && def.params.len() == 1
         {
             let values = vec![self.eval(inner, ctx)?];
             return self.in_module(module, ctx, |me, ctx| me.call(def, 0, &values, ctx));
         }
         match op {
             Op::Not => Ok(Value::Bool(!self.eval_bool(inner, ctx)?)),
             Op::Minus => match self.eval(inner, ctx)? {
-                Value::Int(n) => Ok(Value::Int(-n)),
+                Value::Int(n) => Ok(Value::Int( /* ~ changed by cargo-mutants ~ */n)),
                 other => type_error(format!("cannot negate {other}")),
             },
             Op::Domain => {
                 let v = self.eval(inner, ctx)?;
                 v.domain()
                     .map(Value::Set)
                     .ok_or_else(|| Error::Type(format!("DOMAIN of {v}, which is not a function")))
             }

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (224401) panicked at crates/tla-eval/tests/evaluate_specs.rs:401:5:
assertion failed: e.holds_at("Init", &init).unwrap()

failures:
    paxos_accepts_a_first_phase

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
