*** crates/tla-eval/src/eval.rs:681:13: delete match arm Op::And in Evaluator<'m>::binary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete match arm Op::And in Evaluator<'m>::binary
@@ -673,21 +673,17 @@
         Ok(Value::Bool(before == after))
     }
 
     fn binary(&self, op: Op, lhs: &'m Expr, rhs: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         // The propositional connectives must not evaluate their right operand
         // when the left already decides the answer: a guard like
         // `Len(buf) > 0 /\ Head(buf) = x` relies on it.
         match op {
-            Op::And => {
-                return Ok(Value::Bool(
-                    self.eval_bool(lhs, ctx)? && self.eval_bool(rhs, ctx)?,
-                ));
-            }
+             /* ~ changed by cargo-mutants ~ */
             Op::Or => {
                 return Ok(Value::Bool(
                     self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
                 ));
             }
             Op::Implies => {
                 return Ok(Value::Bool(
                     !self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (226129) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
And is not an infix operator

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (226127) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
And is not an infix operator

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (226132) panicked at crates/tla-eval/tests/evaluate_specs.rs:28:40:
called `Result::unwrap()` on an `Err` value: Malformed("And is not an infix operator")

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state

test result: FAILED. 5 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
