*** crates/tla-eval/src/eval.rs:686:13: delete match arm Op::Or in Evaluator<'m>::binary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete match arm Op::Or in Evaluator<'m>::binary
@@ -678,21 +678,17 @@
         // when the left already decides the answer: a guard like
         // `Len(buf) > 0 /\ Head(buf) = x` relies on it.
         match op {
             Op::And => {
                 return Ok(Value::Bool(
                     self.eval_bool(lhs, ctx)? && self.eval_bool(rhs, ctx)?,
                 ));
             }
-            Op::Or => {
-                return Ok(Value::Bool(
-                    self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
-                ));
-            }
+             /* ~ changed by cargo-mutants ~ */
             Op::Implies => {
                 return Ok(Value::Bool(
                     !self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
                 ));
             }
             _ => {}
         }
         // `\prec`, `\oplus`, `&` and the rest have a symbol and a precedence

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (226793) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:50:
called `Result::unwrap()` on an `Err` value: Malformed("Or is not an infix operator")

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (226794) panicked at crates/tla-eval/tests/evaluate_specs.rs:46:51:
called `Result::unwrap()` on an `Err` value: Malformed("Or is not an infix operator")

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (226795) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:51:
called `Result::unwrap()` on an `Err` value: Malformed("Or is not an infix operator")

failures:
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
