*** crates/tla-eval/src/eval.rs:716:36: replace == with != in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in combine
@@ -708,17 +708,17 @@
         combine(op, left, right)
     }
 }
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
-        Op::Eq => Ok(Value::Bool(a == b)),
+        Op::Eq => Ok(Value::Bool(a != /* ~ changed by cargo-mutants ~ */ b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4086528) panicked at crates/tla-eval/tests/evaluate_specs.rs:442:10:
Spec is a temporal formula: false

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4086533) panicked at crates/tla-eval/tests/evaluate_specs.rs:28:5:
assertion failed: e.holds_at("Init", &empty).unwrap()

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (4086531) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
