*** crates/tla-eval/src/eval.rs:717:37: replace != with == in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace != with == in combine
@@ -709,17 +709,17 @@
     }
 }
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
-        Op::Neq => Ok(Value::Bool(a != b)),
+        Op::Neq => Ok(Value::Bool(a == /* ~ changed by cargo-mutants ~ */ b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4087190) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:5:
assertion failed: e.step_allowed("Next", &init, &moved).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
