*** crates/tla-eval/src/eval.rs:718:46: replace < with <= in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace < with <= in combine
@@ -710,17 +710,17 @@
 }
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
-        Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
+        Op::Lt => Ok(Value::Bool(as_int(&a)? <= /* ~ changed by cargo-mutants ~ */ as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),
         Op::Mod => arith(&a, &b, i64::checked_rem_euclid, "%"),

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (232802) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:5:
assertion failed: !e.step_allowed("Next", &full, &over).unwrap()

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (232803) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

failures:
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
