*** crates/tla-eval/src/eval.rs:719:46: replace > with >= in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace > with >= in combine
@@ -711,17 +711,17 @@
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
-        Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
+        Op::Gt => Ok(Value::Bool(as_int(&a)? >= /* ~ changed by cargo-mutants ~ */ as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),
         Op::Mod => arith(&a, &b, i64::checked_rem_euclid, "%"),
         Op::Pow => {

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (685863) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "UpdateTerm(v = \"s2\", c = \"s2\")"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
