*** crates/tla-eval/src/eval.rs:720:46: replace <= with > in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace <= with > in combine
@@ -712,17 +712,17 @@
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
-        Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
+        Op::Le => Ok(Value::Bool(as_int(&a)? > /* ~ changed by cargo-mutants ~ */ as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),
         Op::Mod => arith(&a, &b, i64::checked_rem_euclid, "%"),
         Op::Pow => {
             let exp = u32::try_from(as_int(&b)?)

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4090279) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: false

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4090282) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:5:
Put

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (4090280) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

failures:
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bounded_buffer_accepts_the_protocol
    closeness_is_measured_over_all_of_an_actions_conjuncts
    ring_election_builds_its_initial_state

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
