*** crates/tla-eval/src/eval.rs:721:46: replace >= with < in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace >= with < in combine
@@ -713,17 +713,17 @@
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
-        Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
+        Op::Ge => Ok(Value::Bool(as_int(&a)? < /* ~ changed by cargo-mutants ~ */ as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),
         Op::Mod => arith(&a, &b, i64::checked_rem_euclid, "%"),
         Op::Pow => {
             let exp = u32::try_from(as_int(&b)?)
                 .map_err(|_| Error::Type("exponent out of range".to_string()))?;

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4090438) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:5:
assertion failed: e.step_allowed("Next", &init, &moved).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
