*** crates/tla-eval/src/eval.rs:737:37: delete ! in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in combine
@@ -729,17 +729,17 @@
                 .map_err(|_| Error::Type("exponent out of range".to_string()))?;
             as_int(&a)?
                 .checked_pow(exp)
                 .map(Value::Int)
                 .ok_or_else(|| Error::Type("^ overflowed".to_string()))
         }
         Op::DotDot => Ok(Value::interval(as_int(&a)?, as_int(&b)?)),
         Op::In => Ok(Value::Bool(member(&a, &b)?)),
-        Op::NotIn => Ok(Value::Bool(!member(&a, &b)?)),
+        Op::NotIn => Ok(Value::Bool( /* ~ changed by cargo-mutants ~ */member(&a, &b)?)),
         Op::Subseteq => {
             for item in elements(&a)? {
                 if !member(&item, &b)? {
                     return Ok(Value::Bool(false));
                 }
             }
             Ok(Value::Bool(true))
         }

*** result: Success
