*** crates/tla-eval/src/eval.rs:740:20: delete ! in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in combine
@@ -732,17 +732,17 @@
                 .map(Value::Int)
                 .ok_or_else(|| Error::Type("^ overflowed".to_string()))
         }
         Op::DotDot => Ok(Value::interval(as_int(&a)?, as_int(&b)?)),
         Op::In => Ok(Value::Bool(member(&a, &b)?)),
         Op::NotIn => Ok(Value::Bool(!member(&a, &b)?)),
         Op::Subseteq => {
             for item in elements(&a)? {
-                if !member(&item, &b)? {
+                if  /* ~ changed by cargo-mutants ~ */member(&item, &b)? {
                     return Ok(Value::Bool(false));
                 }
             }
             Ok(Value::Bool(true))
         }
         Op::Supseteq => {
             for item in elements(&b)? {
                 if !member(&item, &a)? {

*** result: Success
