*** crates/tla-eval/src/eval.rs:775:13: delete match arm (Value::Seq(x), Value::Seq(y)) in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete match arm (Value::Seq(x), Value::Seq(y)) in combine
@@ -767,17 +767,17 @@
             for x in set_of(&a)? {
                 for y in set_of(&b)? {
                     out.insert(Value::Seq(vec![x.clone(), y.clone()]));
                 }
             }
             Ok(Value::Set(out))
         }
         Op::Concat => match (&a, &b) {
-            (Value::Seq(x), Value::Seq(y)) => Ok(Value::Seq(x.iter().chain(y).cloned().collect())),
+             /* ~ changed by cargo-mutants ~ */
             _ => type_error(format!("\\o expects two sequences, got {a} and {b}")),
         },
         Op::OneTo => Ok(Value::function(BTreeMap::from([(a, b)]))),
         Op::AtAt => {
             let mut left = a
                 .entries()
                 .ok_or_else(|| Error::Type(format!("@@ expects functions, got {a}")))?;
             let right = b

---- sequence_operators stdout ----

thread 'sequence_operators' (688797) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `<<1, 2>> \o <<3>>`: \o expects two sequences, got <<1, 2>> and <<3>>

failures:
    sequence_operators

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
