*** crates/tla-eval/src/eval.rs:869:58: replace % with + in Evaluator<'m>::fn_set

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace % with + in Evaluator<'m>::fn_set
@@ -861,17 +861,17 @@
             .checked_pow(u32::try_from(keys.len()).unwrap_or(u32::MAX))
             .unwrap_or(usize::MAX);
         check_size(count, "a function set")?;
 
         let mut out = BTreeSet::new();
         for mut index in 0..count {
             let mut entries = BTreeMap::new();
             for key in &keys {
-                entries.insert(key.clone(), values[index % values.len()].clone());
+                entries.insert(key.clone(), values[index + /* ~ changed by cargo-mutants ~ */ values.len()].clone());
                 index /= values.len();
             }
             out.insert(Value::function(entries));
         }
         if keys.is_empty() {
             out.insert(Value::Seq(Vec::new()));
         }
         Ok(Value::Set(out))

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (238682) panicked at crates/tla-eval/src/eval.rs:869:51:
index out of bounds: the len is 8 but the index is 8

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (238678) panicked at crates/tla-eval/src/eval.rs:869:51:
index out of bounds: the len is 3 but the index is 3

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (238675) panicked at crates/tla-eval/src/eval.rs:869:51:
index out of bounds: the len is 3 but the index is 3

failures:
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    ring_election_builds_its_initial_state
    two_phase_accepts_prepare_and_abort

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
