*** crates/tla-eval/src/eval.rs:870:23: replace /= with %= in Evaluator<'m>::fn_set

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace /= with %= in Evaluator<'m>::fn_set
@@ -862,17 +862,17 @@
             .unwrap_or(usize::MAX);
         check_size(count, "a function set")?;
 
         let mut out = BTreeSet::new();
         for mut index in 0..count {
             let mut entries = BTreeMap::new();
             for key in &keys {
                 entries.insert(key.clone(), values[index % values.len()].clone());
-                index /= values.len();
+                index %= /* ~ changed by cargo-mutants ~ */ values.len();
             }
             out.insert(Value::function(entries));
         }
         if keys.is_empty() {
             out.insert(Value::Seq(Vec::new()));
         }
         Ok(Value::Set(out))
     }

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (238621) panicked at crates/tla-eval/tests/evaluate_specs.rs:332:5:
assertion failed: e.holds_at("TypeOK", &init).unwrap()

failures:
    ring_election_builds_its_initial_state

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
