*** crates/tla-eval/src/eval.rs:870:23: replace /= with *= in Evaluator<'m>::fn_set

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace /= with *= in Evaluator<'m>::fn_set
@@ -862,17 +862,17 @@
             .unwrap_or(usize::MAX);
         check_size(count, "a function set")?;
 
         let mut out = BTreeSet::new();
         for mut index in 0..count {
             let mut entries = BTreeMap::new();
             for key in &keys {
                 entries.insert(key.clone(), values[index % values.len()].clone());
-                index /= values.len();
+                index *= /* ~ changed by cargo-mutants ~ */ values.len();
             }
             out.insert(Value::function(entries));
         }
         if keys.is_empty() {
             out.insert(Value::Seq(Vec::new()));
         }
         Ok(Value::Set(out))
     }

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (4093919) panicked at crates/tla-eval/tests/evaluate_specs.rs:190:5:
assertion failed: e.holds_at("TypeOK", &init).unwrap()

---- two_phase_accepts_prepare_and_abort stdout ----

thread 'two_phase_accepts_prepare_and_abort' (4093925) panicked at crates/tla-eval/tests/evaluate_specs.rs:90:5:
assertion failed: e.holds_at("TPTypeOK", &init).unwrap()

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (4093922) panicked at crates/tla-eval/tests/evaluate_specs.rs:332:5:
assertion failed: e.holds_at("TypeOK", &init).unwrap()

failures:
    raft_accepts_an_election
    ring_election_builds_its_initial_state
    two_phase_accepts_prepare_and_abort

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
