*** crates/tla-eval/src/eval.rs:887:27: replace == with != in Evaluator<'m>::quantify

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::quantify
@@ -879,17 +879,17 @@
 
     fn quantify(
         &self,
         kind: QuantKind,
         bounds: &'m [Bound],
         body: &'m Expr,
         ctx: &mut Ctx<'m, '_>,
     ) -> Result<Value> {
-        let wanted = kind == QuantKind::Exists;
+        let wanted = kind != /* ~ changed by cargo-mutants ~ */ QuantKind::Exists;
         for binding in self.expand(bounds, ctx)? {
             let restore = push(ctx, &binding);
             let holds = self.eval_bool(body, ctx);
             ctx.locals.truncate(restore);
             if holds? == wanted {
                 return Ok(Value::Bool(wanted));
             }
         }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4094594) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:5:
assertion failed: e.step_allowed("Next", &init, &moved).unwrap()

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (4094605) panicked at crates/tla-eval/tests/evaluate_specs.rs:365:5:
assertion failed: e.step_allowed("Next", &init, &discarded).unwrap()

---- paxos_rejects_a_proposal_without_a_quorum stdout ----

thread 'paxos_rejects_a_proposal_without_a_quorum' (4094600) panicked at crates/tla-eval/tests/evaluate_specs.rs:421:5:
assertion failed: !e.step_allowed("Next", &init, &proposed).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort

test result: FAILED. 13 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
