*** crates/tla-eval/src/eval.rs:924:9: replace Evaluator<'m>::expand -> Result<Vec<Vec<(String, Value)>>> with Ok(vec![vec![]])

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::expand -> Result<Vec<Vec<(String, Value)>>> with Ok(vec![vec![]])
@@ -916,20 +916,17 @@
     /// All the ways the bound variables can be assigned. A later bound's
     /// domain may mention an earlier bound's variable, so they are evaluated
     /// with the bindings so far in scope.
     pub(crate) fn expand(
         &self,
         bounds: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,
     ) -> Result<Vec<Vec<(String, Value)>>> {
-        let mut out = Vec::new();
-        let mut current = Vec::new();
-        self.expand_into(bounds, ctx, &mut current, &mut out)?;
-        Ok(out)
+        Ok(vec![vec![]]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn expand_into(
         &self,
         bounds: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,
         current: &mut Vec<(String, Value)>,
         out: &mut Vec<Vec<(String, Value)>>,

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4096115) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (4096122) panicked at crates/tla-eval/tests/evaluate_specs.rs:189:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (4096125) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Undefined("m")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
