*** crates/tla-eval/src/eval.rs:938:34: replace + with - in Evaluator<'m>::expand_into

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace + with - in Evaluator<'m>::expand_into
@@ -930,17 +930,17 @@
     fn expand_into(
         &self,
         bounds: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,
         current: &mut Vec<(String, Value)>,
         out: &mut Vec<Vec<(String, Value)>>,
     ) -> Result<()> {
         let Some((first, rest)) = bounds.split_first() else {
-            check_size(out.len() + 1, "a quantifier")?;
+            check_size(out.len() - /* ~ changed by cargo-mutants ~ */ 1, "a quantifier")?;
             out.push(current.clone());
             return Ok(());
         };
         let Some(domain) = &first.domain else {
             return Err(Error::Unbounded(format!(
                 "`{}` is quantified over no set, so it cannot be enumerated",
                 first.names.join(", ")
             )));

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (242275) panicked at crates/tla-eval/src/eval.rs:938:24:
attempt to subtract with overflow

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (242285) panicked at crates/tla-eval/src/eval.rs:938:24:
attempt to subtract with overflow

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (242286) panicked at crates/tla-eval/src/eval.rs:938:24:
attempt to subtract with overflow

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 9 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
