*** crates/tla-eval/src/eval.rs:93:9: replace Evaluator<'m>::holds_at -> Result<bool> with Ok(true)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::holds_at -> Result<bool> with Ok(true)
@@ -85,18 +85,17 @@
                 missing.join(", ")
             )));
         }
         Ok(Self { spec, constants })
     }
 
     /// Does the named state predicate hold at `state`?
     pub fn holds_at(&self, name: &str, state: &State) -> Result<bool> {
-        let body = self.body_of(name)?;
-        self.eval_bool(body, &mut self.ctx(state, None))
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Is `from -> to` a step the named action permits?
     pub fn step_allowed(&self, name: &str, from: &State, to: &State) -> Result<bool> {
         let body = self.body_of(name)?;
         self.eval_bool(body, &mut self.ctx(from, Some(to)))
     }

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (663036) panicked at crates/tla-eval/tests/evaluate_specs.rs:442:10:
Spec is a temporal formula: true

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (663038) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: true

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
