*** crates/tla-eval/src/eval.rs:984:9: replace Evaluator<'m>::product -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::product -> Result<()> with Ok(())
@@ -976,28 +976,17 @@
         &self,
         names: &[String],
         items: &[Value],
         rest: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,
         current: &mut Vec<(String, Value)>,
         out: &mut Vec<Vec<(String, Value)>>,
     ) -> Result<()> {
-        let Some((name, more)) = names.split_first() else {
-            return self.expand_into(rest, ctx, current, out);
-        };
-        for item in items {
-            let restore = ctx.locals.len();
-            current.push((name.clone(), item.clone()));
-            ctx.locals.push((name.clone(), Local::Val(item.clone())));
-            self.product(more, items, rest, ctx, current, out)?;
-            current.pop();
-            ctx.locals.truncate(restore);
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// One `![a][b] = e` update. `@` inside `e` is the value being replaced.
     fn update(
         &self,
         base: Value,
         path: &'m [ExceptPath],
         rhs: &'m Expr,

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (245150) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (245161) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (245162) panicked at crates/tla-eval/tests/evaluate_specs.rs:365:5:
assertion failed: e.step_allowed("Next", &init, &discarded).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
