*** crates/tla-eval/src/eval.rs:99:9: replace Evaluator<'m>::step_allowed -> Result<bool> with Ok(true)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::step_allowed -> Result<bool> with Ok(true)
@@ -91,18 +91,17 @@
     /// Does the named state predicate hold at `state`?
     pub fn holds_at(&self, name: &str, state: &State) -> Result<bool> {
         let body = self.body_of(name)?;
         self.eval_bool(body, &mut self.ctx(state, None))
     }
 
     /// Is `from -> to` a step the named action permits?
     pub fn step_allowed(&self, name: &str, from: &State, to: &State) -> Result<bool> {
-        let body = self.body_of(name)?;
-        self.eval_bool(body, &mut self.ctx(from, Some(to)))
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn value_of(&self, name: &str, state: &State) -> Result<Value> {
         let body = self.body_of(name)?;
         self.eval(body, &mut self.ctx(state, None))
     }
 
     pub fn eval_at(&self, expr: &'m Expr, from: &State, to: Option<&State>) -> Result<Value> {

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4071915) panicked at crates/tla-eval/tests/evaluate_specs.rs:291:5:
assertion failed: !e.step_allowed("Next", &nearly_empty, &overdrawn).unwrap()

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (4071917) panicked at crates/tla-eval/tests/evaluate_specs.rs:46:5:
assertion failed: !e.step_allowed("Next", &full, &lifo).unwrap()

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (4071918) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:5:
assertion failed: !e.step_allowed("Next", &full, &over).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_rejects_a_proposal_without_a_quorum
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
