*** crates/tla-eval/src/eval.rs:99:9: replace Evaluator<'m>::step_allowed -> Result<bool> with Ok(false)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::step_allowed -> Result<bool> with Ok(false)
@@ -91,18 +91,17 @@
     /// Does the named state predicate hold at `state`?
     pub fn holds_at(&self, name: &str, state: &State) -> Result<bool> {
         let body = self.body_of(name)?;
         self.eval_bool(body, &mut self.ctx(state, None))
     }
 
     /// Is `from -> to` a step the named action permits?
     pub fn step_allowed(&self, name: &str, from: &State, to: &State) -> Result<bool> {
-        let body = self.body_of(name)?;
-        self.eval_bool(body, &mut self.ctx(from, Some(to)))
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn value_of(&self, name: &str, state: &State) -> Result<Value> {
         let body = self.body_of(name)?;
         self.eval(body, &mut self.ctx(state, None))
     }
 
     pub fn eval_at(&self, expr: &'m Expr, from: &State, to: Option<&State>) -> Result<Value> {

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (664145) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:5:
assertion failed: e.step_allowed("Next", &init, &moved).unwrap()

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (664147) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (664146) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:5:
Put

failures:
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
