*** crates/tla-eval/src/spec.rs:109:9: replace Spec::constants -> impl Iterator<Item =&str> with ::std::iter::empty()

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::constants -> impl Iterator<Item =&str> with ::std::iter::empty()
@@ -101,17 +101,17 @@
     }
 
     /// The variables of the root module, including any it inherits.
     pub fn variables(&self) -> impl Iterator<Item = &str> {
         self.facts[self.root].variables.iter().map(String::as_str)
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &str> {
-        self.facts[self.root].constants.iter().map(String::as_str)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn defines(&self, name: &str) -> bool {
         self.definition(self.root, name).is_some()
     }
 
     pub(crate) fn root(&self) -> usize {
         self.root

---- a_missing_constant_is_reported_before_evaluation stdout ----

thread 'a_missing_constant_is_reported_before_evaluation' (717610) panicked at crates/tla-eval/tests/evaluate_specs.rs:450:55:

failures:
    a_missing_constant_is_reported_before_evaluation

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
