*** crates/tla-eval/src/spec.rs:109:9: replace Spec::constants -> impl Iterator<Item =&str> with ::std::iter::once("xyzzy")

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::constants -> impl Iterator<Item =&str> with ::std::iter::once("xyzzy")
@@ -101,17 +101,17 @@
     }
 
     /// The variables of the root module, including any it inherits.
     pub fn variables(&self) -> impl Iterator<Item = &str> {
         self.facts[self.root].variables.iter().map(String::as_str)
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &str> {
-        self.facts[self.root].constants.iter().map(String::as_str)
+        ::std::iter::once("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn defines(&self, name: &str) -> bool {
         self.definition(self.root, name).is_some()
     }
 
     pub(crate) fn root(&self) -> usize {
         self.root

---- a_missing_constant_is_reported_before_evaluation stdout ----

thread 'a_missing_constant_is_reported_before_evaluation' (717850) panicked at crates/tla-eval/tests/evaluate_specs.rs:451:5:
`constants without a value: xyzzy` is not defined

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (717851) panicked at crates/tla-eval/tests/support/mod.rs:20:31:
constants cover the declarations: Undefined("constants without a value: xyzzy")

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (717855) panicked at crates/tla-eval/tests/support/mod.rs:20:31:
constants cover the declarations: Undefined("constants without a value: xyzzy")

failures:
    a_missing_constant_is_reported_before_evaluation
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum

test result: FAILED. 0 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
