*** crates/tla-eval/src/spec.rs:113:9: replace Spec::defines -> bool with false

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::defines -> bool with false
@@ -105,17 +105,17 @@
         self.facts[self.root].variables.iter().map(String::as_str)
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &str> {
         self.facts[self.root].constants.iter().map(String::as_str)
     }
 
     pub fn defines(&self, name: &str) -> bool {
-        self.definition(self.root, name).is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn root(&self) -> usize {
         self.root
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
         self.facts[module].variables.contains(name)

*** result: Success
