*** crates/tla-eval/src/spec.rs:117:9: replace Spec::root -> usize with 0

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::root -> usize with 0
@@ -109,17 +109,17 @@
         self.facts[self.root].constants.iter().map(String::as_str)
     }
 
     pub fn defines(&self, name: &str) -> bool {
         self.definition(self.root, name).is_some()
     }
 
     pub(crate) fn root(&self) -> usize {
-        self.root
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
         self.facts[module].variables.contains(name)
     }
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
         self.facts[module].constants.contains(name)

*** result: Success
