*** crates/tla-eval/src/spec.rs:117:9: replace Spec::root -> usize with 1

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::root -> usize with 1
@@ -109,17 +109,17 @@
         self.facts[self.root].constants.iter().map(String::as_str)
     }
 
     pub fn defines(&self, name: &str) -> bool {
         self.definition(self.root, name).is_some()
     }
 
     pub(crate) fn root(&self) -> usize {
-        self.root
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
         self.facts[module].variables.contains(name)
     }
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
         self.facts[module].constants.contains(name)

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (267259) panicked at crates/tla-eval/src/spec.rs:144:40:
index out of bounds: the len is 1 but the index is 1

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (267258) panicked at crates/tla-eval/src/spec.rs:144:40:
index out of bounds: the len is 1 but the index is 1

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (267261) panicked at crates/tla-eval/src/spec.rs:144:40:
index out of bounds: the len is 1 but the index is 1

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election

test result: FAILED. 1 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
