*** crates/tla-eval/src/spec.rs:121:9: replace Spec::declares_variable -> bool with true

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::declares_variable -> bool with true
@@ -113,17 +113,17 @@
         self.definition(self.root, name).is_some()
     }
 
     pub(crate) fn root(&self) -> usize {
         self.root
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
-        self.facts[module].variables.contains(name)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
         self.facts[module].constants.contains(name)
     }
 
     /// Find a definition, following `EXTENDS`. The module it was found in
     /// comes back with it, because that is the scope its body must be read in.

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (267653) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
the state gives no value for variable `Init`

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (267655) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
the state gives no value for variable `Put`

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (267656) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority

test result: FAILED. 2 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
