*** crates/tla-eval/src/spec.rs:125:9: replace Spec::declares_constant -> bool with true

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::declares_constant -> bool with true
@@ -117,17 +117,17 @@
         self.root
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
         self.facts[module].variables.contains(name)
     }
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
-        self.facts[module].constants.contains(name)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Find a definition, following `EXTENDS`. The module it was found in
     /// comes back with it, because that is the scope its body must be read in.
     pub(crate) fn definition(&self, module: usize, name: &str) -> Option<(usize, &Def)> {
         let mut seen = BTreeSet::new();
         self.search(module, name, &mut seen)
     }

---- an_infinite_set_cannot_be_enumerated stdout ----

thread 'an_infinite_set_cannot_be_enumerated' (269584) panicked at crates/tla-eval/tests/standard_operators.rs:150:5:
assertion failed: failure("\\E n \\in Nat : n = 1").contains("cannot be enumerated")

---- cardinality_of_an_infinite_set_is_refused stdout ----

thread 'cardinality_of_an_infinite_set_is_refused' (269588) panicked at crates/tla-eval/tests/standard_operators.rs:66:5:
assertion failed: failure("Cardinality(Nat)").contains("infinite")

---- is_finite_set_distinguishes_the_enumerable stdout ----

thread 'is_finite_set_distinguishes_the_enumerable' (269593) panicked at crates/tla-eval/tests/standard_operators.rs:22:29:
evaluating `IsFiniteSet(Nat)`: `constant `Nat` has no value` is not defined

failures:
    an_infinite_set_cannot_be_enumerated
    cardinality_of_an_infinite_set_is_refused
    is_finite_set_distinguishes_the_enumerable
    the_infinite_sets_decide_membership

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
