*** crates/tla-eval/src/spec.rs:125:9: replace Spec::declares_constant -> bool with false

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::declares_constant -> bool with false
@@ -117,17 +117,17 @@
         self.root
     }
 
     pub(crate) fn declares_variable(&self, module: usize, name: &str) -> bool {
         self.facts[module].variables.contains(name)
     }
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
-        self.facts[module].constants.contains(name)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Find a definition, following `EXTENDS`. The module it was found in
     /// comes back with it, because that is the scope its body must be read in.
     pub(crate) fn definition(&self, module: usize, name: &str) -> Option<(usize, &Def)> {
         let mut seen = BTreeSet::new();
         self.search(module, name, &mut seen)
     }

*** result: Success
