*** crates/tla-eval/src/spec.rs:131:9: replace Spec::definition -> Option<(usize, &Def)> with None

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::definition -> Option<(usize, &Def)> with None
@@ -123,18 +123,17 @@
 
     pub(crate) fn declares_constant(&self, module: usize, name: &str) -> bool {
         self.facts[module].constants.contains(name)
     }
 
     /// Find a definition, following `EXTENDS`. The module it was found in
     /// comes back with it, because that is the scope its body must be read in.
     pub(crate) fn definition(&self, module: usize, name: &str) -> Option<(usize, &Def)> {
-        let mut seen = BTreeSet::new();
-        self.search(module, name, &mut seen)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn search(
         &self,
         module: usize,
         name: &str,
         seen: &mut BTreeSet<usize>,
     ) -> Option<(usize, &Def)> {

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (269727) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
`Spec` is not defined

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (269729) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
`Next` is not defined

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (269730) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:45:
called `Result::unwrap()` on an `Err` value: Undefined("Next")

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election

test result: FAILED. 1 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
