*** crates/tla-eval/src/spec.rs:141:12: delete ! in Spec::search

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ delete ! in Spec::search
@@ -133,17 +133,17 @@
     }
 
     fn search(
         &self,
         module: usize,
         name: &str,
         seen: &mut BTreeSet<usize>,
     ) -> Option<(usize, &Def)> {
-        if !seen.insert(module) {
+        if  /* ~ changed by cargo-mutants ~ */seen.insert(module) {
             return None;
         }
         if let Some(def) = self.modules[module].definition(name) {
             return Some((module, def));
         }
         self.facts[module]
             .extends
             .iter()

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4119566) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
`Next` is not defined

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4119564) panicked at crates/tla-eval/tests/evaluate_specs.rs:443:5:
`Spec` is not defined

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4119565) panicked at crates/tla-eval/tests/evaluate_specs.rs:522:62:
called `Result::unwrap()` on an `Err` value: Undefined("Next")

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election

test result: FAILED. 1 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
