*** crates/tla-eval/src/spec.rs:155:9: replace Spec::instance -> Option<&Instance> with None

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::instance -> Option<&Instance> with None
@@ -147,18 +147,17 @@
         self.facts[module]
             .extends
             .iter()
             .find_map(|&parent| self.search(parent, name, seen))
     }
 
     /// Find an instance by the name it was given, following `EXTENDS`.
     pub(crate) fn instance(&self, module: usize, name: &str) -> Option<&Instance> {
-        let mut seen = BTreeSet::new();
-        self.find_instance(module, name, &mut seen)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn find_instance(
         &self,
         module: usize,
         name: &str,
         seen: &mut BTreeSet<usize>,
     ) -> Option<&Instance> {

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (724373) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `I`")

---- an_instance_substitutes_constants_and_variables stdout ----

thread 'an_instance_substitutes_constants_and_variables' (724375) panicked at crates/tla-eval/tests/modules.rs:196:63:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `A`")

---- priming_reaches_through_a_substitution stdout ----

thread 'priming_reaches_through_a_substitution' (724382) panicked at crates/tla-eval/tests/modules.rs:210:14:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `A`")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    an_instance_substitutes_constants_and_variables
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
