*** crates/tla-eval/src/spec.rs:165:9: replace Spec::find_instance -> Option<&Instance> with None

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::find_instance -> Option<&Instance> with None
@@ -157,30 +157,17 @@
     }
 
     fn find_instance(
         &self,
         module: usize,
         name: &str,
         seen: &mut BTreeSet<usize>,
     ) -> Option<&Instance> {
-        if !seen.insert(module) {
-            return None;
-        }
-        let here = self.facts[module]
-            .instances
-            .iter()
-            .find(|i| i.name.as_deref() == Some(name));
-        if here.is_some() {
-            return here;
-        }
-        self.facts[module]
-            .extends
-            .iter()
-            .find_map(|&parent| self.find_instance(parent, name, seen))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct Builder<'a, M: Modules> {
     modules: Vec<Module>,
     index: BTreeMap<String, usize>,
     source: &'a M,
 }

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (4121079) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `I`")

---- an_instance_substitutes_constants_and_variables stdout ----

thread 'an_instance_substitutes_constants_and_variables' (4121081) panicked at crates/tla-eval/tests/modules.rs:196:63:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `A`")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (4121085) panicked at crates/tla-eval/tests/modules.rs:284:51:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `Mid`")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    an_instance_substitutes_constants_and_variables
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
