*** crates/tla-eval/src/spec.rs:191:9: replace Builder<'_, M>::add -> Result<usize> with Ok(1)

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Builder<'_, M>::add -> Result<usize> with Ok(1)
@@ -183,56 +183,17 @@
     modules: Vec<Module>,
     index: BTreeMap<String, usize>,
     source: &'a M,
 }
 
 impl<M: Modules> Builder<'_, M> {
     /// Register a module and everything it names, depth first.
     fn add(&mut self, module: Module) -> Result<usize> {
-        let name = module.name.clone();
-        if let Some(&existing) = self.index.get(&name) {
-            return Ok(existing);
-        }
-        let position = self.modules.len();
-        self.index.insert(name, position);
-        self.modules.push(module);
-
-        // Inner modules are visible to their parent, and are registered before
-        // anything is loaded from outside so they take precedence.
-        let inner: Vec<Module> = self.modules[position]
-            .units
-            .iter()
-            .filter_map(|u| match u {
-                Unit::Inner(m) => Some((**m).clone()),
-                _ => None,
-            })
-            .collect();
-        for module in inner {
-            self.add(module)?;
-        }
-
-        let mut wanted: Vec<String> = self.modules[position].extends.clone();
-        wanted.extend(self.modules[position].units.iter().filter_map(|u| match u {
-            Unit::Instance { module, .. } => Some(module.clone()),
-            _ => None,
-        }));
-        for name in wanted {
-            if BUILT_IN.contains(&name.as_str()) || self.index.contains_key(&name) {
-                continue;
-            }
-            let Some(src) = self.source.source(&name) else {
-                return Err(Error::Undefined(format!(
-                    "module `{name}` is neither a standard module nor one that could be found"
-                )));
-            };
-            let parsed = parse_module(&src)?;
-            self.add(parsed)?;
-        }
-        Ok(position)
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn resolve(modules: &[Module], index: &BTreeMap<String, usize>) -> Result<Vec<Facts>> {
     let mut facts: Vec<Facts> = modules.iter().map(|_| Facts::default()).collect();
 
     for (position, module) in modules.iter().enumerate() {
         facts[position].extends = module

---- a_missing_constant_is_reported_before_evaluation stdout ----

thread 'a_missing_constant_is_reported_before_evaluation' (4123092) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 1

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4123094) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 1

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4123093) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 1

failures:
    a_missing_constant_is_reported_before_evaluation
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum

test result: FAILED. 0 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
