*** crates/tla-eval/src/spec.rs:205:17: delete match arm Unit::Inner(m) in Builder<'_, M>::add

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ delete match arm Unit::Inner(m) in Builder<'_, M>::add
@@ -197,17 +197,17 @@
         self.modules.push(module);
 
         // Inner modules are visible to their parent, and are registered before
         // anything is loaded from outside so they take precedence.
         let inner: Vec<Module> = self.modules[position]
             .units
             .iter()
             .filter_map(|u| match u {
-                Unit::Inner(m) => Some((**m).clone()),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => None,
             })
             .collect();
         for module in inner {
             self.add(module)?;
         }
 
         let mut wanted: Vec<String> = self.modules[position].extends.clone();

---- an_instance_substitutes_constants_and_variables stdout ----

thread 'an_instance_substitutes_constants_and_variables' (4122697) panicked at crates/tla-eval/tests/modules.rs:18:41:
`module `Counter` is neither a standard module nor one that could be found` is not defined
in:

---- instances_of_one_module_keep_their_own_constants stdout ----

thread 'instances_of_one_module_keep_their_own_constants' (4122702) panicked at crates/tla-eval/tests/modules.rs:18:41:
`module `Counter` is neither a standard module nor one that could be found` is not defined
in:

---- priming_reaches_through_a_substitution stdout ----

thread 'priming_reaches_through_a_substitution' (4122704) panicked at crates/tla-eval/tests/modules.rs:18:41:
`module `Counter` is neither a standard module nor one that could be found` is not defined
in:

failures:
    an_instance_substitutes_constants_and_variables
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
