*** crates/tla-eval/src/spec.rs:20:9: replace <impl Modules for NoModules>::source -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace <impl Modules for NoModules>::source -> Option<String> with Some("xyzzy".into())
@@ -12,17 +12,17 @@
     fn source(&self, name: &str) -> Option<String>;
 }
 
 /// No modules beyond the one given and whatever it declares inside itself.
 pub struct NoModules;
 
 impl Modules for NoModules {
     fn source(&self, _name: &str) -> Option<String> {
-        None
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Modules as `<directory>/<Name>.tla`, which is how TLA+ tools find them.
 pub struct Directory(pub std::path::PathBuf);
 
 impl Modules for Directory {
     fn source(&self, name: &str) -> Option<String> {

---- a_module_that_cannot_be_found_is_reported stdout ----

thread 'a_module_that_cannot_be_found_is_reported' (258864) panicked at crates/tla-eval/tests/modules.rs:161:5:
parse error at 1:6: no `---- MODULE ----` header found

failures:
    a_module_that_cannot_be_found_is_reported

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
