*** crates/tla-eval/src/spec.rs:215:13: delete match arm Unit::Instance{module, ..} in Builder<'_, M>::add

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ delete match arm Unit::Instance{module, ..} in Builder<'_, M>::add
@@ -207,17 +207,17 @@
             })
             .collect();
         for module in inner {
             self.add(module)?;
         }
 
         let mut wanted: Vec<String> = self.modules[position].extends.clone();
         wanted.extend(self.modules[position].units.iter().filter_map(|u| match u {
-            Unit::Instance { module, .. } => Some(module.clone()),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }));
         for name in wanted {
             if BUILT_IN.contains(&name.as_str()) || self.index.contains_key(&name) {
                 continue;
             }
             let Some(src) = self.source.source(&name) else {
                 return Err(Error::Undefined(format!(

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (727449) panicked at crates/tla-eval/tests/modules.rs:255:6:
Inner is found: Undefined("INSTANCE of unknown module `Inner`")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (727455) panicked at crates/tla-eval/tests/modules.rs:281:6:
both modules are found: Undefined("INSTANCE of unknown module `Middle`")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    instances_may_be_chained

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
