*** crates/tla-eval/src/spec.rs:219:50: replace || with && in Builder<'_, M>::add

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace || with && in Builder<'_, M>::add
@@ -211,17 +211,17 @@
         }
 
         let mut wanted: Vec<String> = self.modules[position].extends.clone();
         wanted.extend(self.modules[position].units.iter().filter_map(|u| match u {
             Unit::Instance { module, .. } => Some(module.clone()),
             _ => None,
         }));
         for name in wanted {
-            if BUILT_IN.contains(&name.as_str()) || self.index.contains_key(&name) {
+            if BUILT_IN.contains(&name.as_str()) && /* ~ changed by cargo-mutants ~ */ self.index.contains_key(&name) {
                 continue;
             }
             let Some(src) = self.source.source(&name) else {
                 return Err(Error::Undefined(format!(
                     "module `{name}` is neither a standard module nor one that could be found"
                 )));
             };
             let parsed = parse_module(&src)?;

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (729167) panicked at crates/tla-eval/tests/support/mod.rs:12:42:
BoundedBuffer: `module `Naturals` is neither a standard module nor one that could be found` is not defined

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (729169) panicked at crates/tla-eval/tests/support/mod.rs:12:42:
BoundedBuffer: `module `Naturals` is neither a standard module nor one that could be found` is not defined

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (729170) panicked at crates/tla-eval/tests/support/mod.rs:12:42:
BoundedBuffer: `module `Naturals` is neither a standard module nor one that could be found` is not defined

failures:
    a_missing_constant_is_reported_before_evaluation
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum

test result: FAILED. 0 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
