*** crates/tla-eval/src/spec.rs:235:5: replace resolve -> Result<Vec<Facts>> with Ok(vec![])

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace resolve -> Result<Vec<Facts>> with Ok(vec![])
@@ -227,58 +227,17 @@
             let parsed = parse_module(&src)?;
             self.add(parsed)?;
         }
         Ok(position)
     }
 }
 
 fn resolve(modules: &[Module], index: &BTreeMap<String, usize>) -> Result<Vec<Facts>> {
-    let mut facts: Vec<Facts> = modules.iter().map(|_| Facts::default()).collect();
-
-    for (position, module) in modules.iter().enumerate() {
-        facts[position].extends = module
-            .extends
-            .iter()
-            .filter_map(|name| index.get(name).copied())
-            .collect();
-        facts[position].variables = module.variables().cloned().collect();
-        facts[position].constants = module.constants().map(|d| d.name.clone()).collect();
-    }
-
-    // A module declares whatever it extends declares.
-    for position in 0..modules.len() {
-        let mut seen = BTreeSet::new();
-        let mut inherited = (BTreeSet::new(), BTreeSet::new());
-        collect(position, &facts, &mut seen, &mut inherited);
-        facts[position].variables.extend(inherited.0);
-        facts[position].constants.extend(inherited.1);
-    }
-
-    for (position, module) in modules.iter().enumerate() {
-        facts[position].instances = module
-            .units
-            .iter()
-            .filter_map(|u| match u {
-                Unit::Instance { name, module, subs } => Some((name, module, subs)),
-                _ => None,
-            })
-            .map(|(name, target, subs)| {
-                let target = *index.get(target).ok_or_else(|| {
-                    Error::Undefined(format!("INSTANCE of unknown module `{target}`"))
-                })?;
-                Ok(Instance {
-                    name: name.clone(),
-                    target,
-                    subs: complete(&facts[target], subs),
-                })
-            })
-            .collect::<Result<Vec<_>>>()?;
-    }
-    Ok(facts)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn collect(
     position: usize,
     facts: &[Facts],
     seen: &mut BTreeSet<usize>,
     out: &mut (BTreeSet<String>, BTreeSet<String>),
 ) {

---- a_missing_constant_is_reported_before_evaluation stdout ----

thread 'a_missing_constant_is_reported_before_evaluation' (4124631) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 0

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (4124637) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 0

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (4124633) panicked at crates/tla-eval/src/spec.rs:109:19:
index out of bounds: the len is 0 but the index is 0

failures:
    a_missing_constant_is_reported_before_evaluation
    a_temporal_formula_is_refused_rather_than_guessed
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    paxos_rejects_a_proposal_without_a_quorum

test result: FAILED. 0 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
