*** crates/tla-eval/src/spec.rs:286:12: delete ! in collect

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ delete ! in collect
@@ -278,17 +278,17 @@
 
 fn collect(
     position: usize,
     facts: &[Facts],
     seen: &mut BTreeSet<usize>,
     out: &mut (BTreeSet<String>, BTreeSet<String>),
 ) {
     for &parent in &facts[position].extends {
-        if !seen.insert(parent) {
+        if  /* ~ changed by cargo-mutants ~ */seen.insert(parent) {
             continue;
         }
         out.0.extend(facts[parent].variables.iter().cloned());
         out.1.extend(facts[parent].constants.iter().cloned());
         collect(parent, facts, seen, out);
     }
 }

---- a_module_may_extend_another stdout ----

thread 'a_module_may_extend_another' (730317) panicked at crates/tla-eval/tests/modules.rs:143:5:
assertion `left == right` failed
  left: []
 right: ["x"]

failures:
    a_module_may_extend_another

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
