*** crates/tla-eval/src/spec.rs:299:5: replace complete -> Vec<(String, Expr)> with vec![]

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace complete -> Vec<(String, Expr)> with vec![]
@@ -291,17 +291,10 @@
         collect(parent, facts, seen, out);
     }
 }
 
 /// A `WITH` clause need not mention every declared name; the ones it leaves
 /// out keep their names, and so refer to whatever bears that name where the
 /// instance was written.
 fn complete(target: &Facts, given: &[(String, Expr)]) -> Vec<(String, Expr)> {
-    let mut subs = given.to_vec();
-    let declared = target.constants.iter().chain(target.variables.iter());
-    for name in declared {
-        if !subs.iter().any(|(given, _)| given == name) {
-            subs.push((name.clone(), Expr::Ident(name.clone())));
-        }
-    }
-    subs
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (731810) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("constant `P` has no value")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (731816) panicked at crates/tla-eval/tests/modules.rs:284:51:
called `Result::unwrap()` on an `Err` value: Undefined("constant `K` has no value")

---- instances_of_one_module_keep_their_own_constants stdout ----

thread 'instances_of_one_module_keep_their_own_constants' (731817) panicked at crates/tla-eval/tests/modules.rs:236:14:
called `Result::unwrap()` on an `Err` value: Malformed("the state gives no value for variable `n`")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    an_instance_substitutes_constants_and_variables
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
