*** crates/tla-eval/src/spec.rs:302:12: delete ! in complete

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ delete ! in complete
@@ -294,14 +294,14 @@
 
 /// A `WITH` clause need not mention every declared name; the ones it leaves
 /// out keep their names, and so refer to whatever bears that name where the
 /// instance was written.
 fn complete(target: &Facts, given: &[(String, Expr)]) -> Vec<(String, Expr)> {
     let mut subs = given.to_vec();
     let declared = target.constants.iter().chain(target.variables.iter());
     for name in declared {
-        if !subs.iter().any(|(given, _)| given == name) {
+        if  /* ~ changed by cargo-mutants ~ */subs.iter().any(|(given, _)| given == name) {
             subs.push((name.clone(), Expr::Ident(name.clone())));
         }
     }
     subs
 }

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (731794) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("P")

---- an_instance_substitutes_constants_and_variables stdout ----

thread 'an_instance_substitutes_constants_and_variables' (731796) panicked at crates/tla-eval/tests/modules.rs:196:63:
called `Result::unwrap()` on an `Err` value: Undefined("n")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (731800) panicked at crates/tla-eval/tests/modules.rs:284:51:
called `Result::unwrap()` on an `Err` value: Undefined("K")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    an_instance_substitutes_constants_and_variables
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
