*** crates/tla-eval/src/spec.rs:302:48: replace == with != in complete

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace == with != in complete
@@ -294,14 +294,14 @@
 
 /// A `WITH` clause need not mention every declared name; the ones it leaves
 /// out keep their names, and so refer to whatever bears that name where the
 /// instance was written.
 fn complete(target: &Facts, given: &[(String, Expr)]) -> Vec<(String, Expr)> {
     let mut subs = given.to_vec();
     let declared = target.constants.iter().chain(target.variables.iter());
     for name in declared {
-        if !subs.iter().any(|(given, _)| given == name) {
+        if !subs.iter().any(|(given, _)| given != /* ~ changed by cargo-mutants ~ */ name) {
             subs.push((name.clone(), Expr::Ident(name.clone())));
         }
     }
     subs
 }

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (280669) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("P")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (280675) panicked at crates/tla-eval/tests/modules.rs:284:51:
called `Result::unwrap()` on an `Err` value: Undefined("K")

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    instances_may_be_chained

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
