*** crates/tla-eval/src/value.rs:104:9: replace Value::domain -> Option<BTreeSet<Value>> with Some(BTreeSet::new())

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::domain -> Option<BTreeSet<Value>> with Some(BTreeSet::new())
@@ -96,22 +96,17 @@
                     .collect(),
             ),
             Value::Func(map) => Some(map.clone()),
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
-        match self {
-            Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
-            Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
-            Value::Func(map) => Some(map.keys().cloned().collect()),
-            _ => None,
-        }
+        Some(BTreeSet::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
             (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
                 .ok()?
                 .checked_sub(1)
                 .and_then(|i| items.get(i).cloned()),

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (739911) panicked at crates/tla-eval/tests/standard_operators.rs:169:5:
assertion `left == right` failed: a sequence is a function on 1..n
  left: Some({})
 right: Some({Int(1), Int(2)})

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
