*** crates/tla-eval/src/value.rs:105:13: delete match arm Value::Seq(items) in Value::domain

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Seq(items) in Value::domain
@@ -97,17 +97,17 @@
             ),
             Value::Func(map) => Some(map.clone()),
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
-            Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
+             /* ~ changed by cargo-mutants ~ */
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,
         }
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (286590) panicked at crates/tla-eval/tests/standard_operators.rs:169:5:
assertion `left == right` failed: a sequence is a function on 1..n
  left: None
 right: Some({Int(1), Int(2)})

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
