*** crates/tla-eval/src/value.rs:106:13: delete match arm Value::Record(fields) in Value::domain

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Record(fields) in Value::domain
@@ -98,17 +98,17 @@
             Value::Func(map) => Some(map.clone()),
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
-            Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
+             /* ~ changed by cargo-mutants ~ */
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,
         }
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
             (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (740459) panicked at crates/tla-eval/tests/standard_operators.rs:179:5:
assertion `left == right` failed
  left: None
 right: Some({Str("a"), Str("b")})

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
