*** crates/tla-eval/src/value.rs:113:9: replace Value::apply -> Option<Value> with None

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::apply -> Option<Value> with None
@@ -105,25 +105,17 @@
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,
         }
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
-        match (self, key) {
-            (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
-                .ok()?
-                .checked_sub(1)
-                .and_then(|i| items.get(i).cloned()),
-            (Value::Record(fields), Value::Str(k)) => fields.get(k).cloned(),
-            (Value::Func(map), k) => map.get(k).cloned(),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn type_name(&self) -> &'static str {
         match self {
             Value::Bool(_) => "a boolean",
             Value::Int(_) => "an integer",
             Value::Str(_) => "a string",
             Value::Seq(_) => "a sequence",

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (741160) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Type("[a |-> 5, b |-> 5] is not defined at \"a\"")

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (741171) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:56:
called `Result::unwrap()` on an `Err` value: Type("[n1 |-> 1, n2 |-> 3, n3 |-> 2] is not defined at \"n1\"")

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (741170) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Type("[n1 |-> \"n2\", n2 |-> \"n3\", n3 |-> \"n1\"] is not defined at \"n1\"")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
