*** crates/tla-eval/src/value.rs:114:13: delete match arm (Value::Seq(items), Value::Int(i)) in Value::apply

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm (Value::Seq(items), Value::Int(i)) in Value::apply
@@ -106,20 +106,17 @@
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,
         }
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
-            (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
-                .ok()?
-                .checked_sub(1)
-                .and_then(|i| items.get(i).cloned()),
+             /* ~ changed by cargo-mutants ~ */
             (Value::Record(fields), Value::Str(k)) => fields.get(k).cloned(),
             (Value::Func(map), k) => map.get(k).cloned(),
             _ => None,
         }
     }
 
     pub fn type_name(&self) -> &'static str {
         match self {

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (289129) panicked at crates/tla-eval/tests/standard_operators.rs:174:5:
assertion `left == right` failed
  left: None
 right: Some(Int(10))

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
