*** crates/tla-eval/src/value.rs:118:13: delete match arm (Value::Record(fields), Value::Str(k)) in Value::apply

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm (Value::Record(fields), Value::Str(k)) in Value::apply
@@ -110,17 +110,17 @@
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
             (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
                 .ok()?
                 .checked_sub(1)
                 .and_then(|i| items.get(i).cloned()),
-            (Value::Record(fields), Value::Str(k)) => fields.get(k).cloned(),
+             /* ~ changed by cargo-mutants ~ */
             (Value::Func(map), k) => map.get(k).cloned(),
             _ => None,
         }
     }
 
     pub fn type_name(&self) -> &'static str {
         match self {
             Value::Bool(_) => "a boolean",

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (289882) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Type("[a |-> 5, b |-> 5] is not defined at \"a\"")

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (289892) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Type("[n1 |-> \"n2\", n2 |-> \"n3\", n3 |-> \"n1\"] is not defined at \"n1\"")

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (289893) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:56:
called `Result::unwrap()` on an `Err` value: Type("[n1 |-> 1, n2 |-> 3, n3 |-> 2] is not defined at \"n1\"")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
