*** crates/tla-eval/src/value.rs:119:13: delete match arm (Value::Func(map), k) in Value::apply

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm (Value::Func(map), k) in Value::apply
@@ -111,17 +111,17 @@
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
             (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
                 .ok()?
                 .checked_sub(1)
                 .and_then(|i| items.get(i).cloned()),
             (Value::Record(fields), Value::Str(k)) => fields.get(k).cloned(),
-            (Value::Func(map), k) => map.get(k).cloned(),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     pub fn type_name(&self) -> &'static str {
         match self {
             Value::Bool(_) => "a boolean",
             Value::Int(_) => "an integer",

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (290025) panicked at crates/tla-eval/tests/standard_operators.rs:188:5:
assertion `left == right` failed
  left: None
 right: Some(Int(4))

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
