*** crates/tla-eval/src/value.rs:125:9: replace Value::type_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::type_name -> &'static str with "xyzzy"
@@ -117,25 +117,17 @@
                 .and_then(|i| items.get(i).cloned()),
             (Value::Record(fields), Value::Str(k)) => fields.get(k).cloned(),
             (Value::Func(map), k) => map.get(k).cloned(),
             _ => None,
         }
     }
 
     pub fn type_name(&self) -> &'static str {
-        match self {
-            Value::Bool(_) => "a boolean",
-            Value::Int(_) => "an integer",
-            Value::Str(_) => "a string",
-            Value::Seq(_) => "a sequence",
-            Value::Set(_) | Value::Infinite(_) => "a set",
-            Value::Record(_) => "a record",
-            Value::Func(_) => "a function",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_set(&self) -> bool {
         matches!(self, Value::Set(_) | Value::Infinite(_))
     }
 }
 
 impl fmt::Display for Value {

---- values_describe_themselves stdout ----

thread 'values_describe_themselves' (290840) panicked at crates/tla-eval/tests/standard_operators.rs:234:9:
assertion `left == right` failed: TRUE
  left: "xyzzy"
 right: "a boolean"

failures:
    values_describe_themselves

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
