*** crates/tla-eval/src/value.rs:143:9: replace <impl fmt::Display for Value>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace <impl fmt::Display for Value>::fmt -> fmt::Result with Ok(Default::default())
@@ -135,36 +135,17 @@
 
     pub fn is_set(&self) -> bool {
         matches!(self, Value::Set(_) | Value::Infinite(_))
     }
 }
 
 impl fmt::Display for Value {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Value::Bool(b) => f.write_str(if *b { "TRUE" } else { "FALSE" }),
-            Value::Int(n) => write!(f, "{n}"),
-            Value::Str(s) => write!(f, "{s:?}"),
-            Value::Seq(items) => write!(f, "<<{}>>", join(items.iter())),
-            Value::Set(items) => write!(f, "{{{}}}", join(items.iter())),
-            Value::Record(fields) => {
-                let body: Vec<String> =
-                    fields.iter().map(|(k, v)| format!("{k} |-> {v}")).collect();
-                write!(f, "[{}]", body.join(", "))
-            }
-            Value::Func(map) => {
-                let body: Vec<String> = map.iter().map(|(k, v)| format!("{k} :> {v}")).collect();
-                write!(f, "({})", body.join(" @@ "))
-            }
-            Value::Infinite(Infinite::Nat) => f.write_str("Nat"),
-            Value::Infinite(Infinite::Int) => f.write_str("Int"),
-            Value::Infinite(Infinite::Strings) => f.write_str("STRING"),
-            Value::Infinite(Infinite::Sequences(s)) => write!(f, "Seq({s})"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn join<'a>(items: impl Iterator<Item = &'a Value>) -> String {
     items
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (293057) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "BecomeLeader(c = )"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
