*** crates/tla-eval/src/value.rs:167:5: replace join -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace join -> String with "xyzzy".into()
@@ -159,13 +159,10 @@
             Value::Infinite(Infinite::Int) => f.write_str("Int"),
             Value::Infinite(Infinite::Strings) => f.write_str("STRING"),
             Value::Infinite(Infinite::Sequences(s)) => write!(f, "Seq({s})"),
         }
     }
 }
 
 fn join<'a>(items: impl Iterator<Item = &'a Value>) -> String {
-    items
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
