*** crates/tla-eval/src/value.rs:36:5: replace count -> i64 with 0

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace count -> i64 with 0
@@ -28,17 +28,17 @@
     Strings,
     /// `Seq(S)` — every finite sequence over `S`.
     Sequences(Box<Value>),
 }
 
 /// A length or cardinality as a TLA+ integer. No collection can hold more than
 /// `isize::MAX` elements, so this never loses information.
 pub(crate) fn count(n: usize) -> i64 {
-    i64::try_from(n).expect("no collection exceeds isize::MAX elements")
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 impl Value {
     pub fn set(items: impl IntoIterator<Item = Value>) -> Value {
         Value::Set(items.into_iter().collect())
     }
 
     pub fn string(s: impl Into<String>) -> Value {

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (4127274) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (4127279) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (4127278) panicked at crates/tla-eval/tests/evaluate_specs.rs:35:5:
Get

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    raft_rejects_a_leader_without_a_majority

test result: FAILED. 13 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
