*** crates/tla-eval/src/value.rs:36:5: replace count -> i64 with 1

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace count -> i64 with 1
@@ -28,17 +28,17 @@
     Strings,
     /// `Seq(S)` — every finite sequence over `S`.
     Sequences(Box<Value>),
 }
 
 /// A length or cardinality as a TLA+ integer. No collection can hold more than
 /// `isize::MAX` elements, so this never loses information.
 pub(crate) fn count(n: usize) -> i64 {
-    i64::try_from(n).expect("no collection exceeds isize::MAX elements")
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 impl Value {
     pub fn set(items: impl IntoIterator<Item = Value>) -> Value {
         Value::Set(items.into_iter().collect())
     }
 
     pub fn string(s: impl Into<String>) -> Value {

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4126733) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:5:
assertion failed: e.holds_at("Conserved", &init).unwrap()

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (4126741) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:5:
assertion failed: !e.step_allowed("Next", &full, &over).unwrap()

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (4126744) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

failures:
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    raft_rejects_a_leader_without_a_majority
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
