*** crates/tla-eval/src/value.rs:73:25: delete match arm Value::Str(s) in Value::function

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Str(s) in Value::function
@@ -65,17 +65,17 @@
         {
             return Value::Seq(entries.into_values().collect());
         }
         if entries.keys().all(|k| matches!(k, Value::Str(_))) {
             return Value::Record(
                 entries
                     .into_iter()
                     .map(|(k, v)| match k {
-                        Value::Str(s) => (s, v),
+                         /* ~ changed by cargo-mutants ~ */
                         _ => unreachable!("keys checked to be strings"),
                     })
                     .collect(),
             );
         }
         Value::Func(entries)
     }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4127913) panicked at crates/tla-eval/src/value.rs:74:30:
internal error: entered unreachable code: keys checked to be strings

---- raft_accepts_an_election stdout ----

thread 'raft_accepts_an_election' (4127920) panicked at crates/tla-eval/src/value.rs:74:30:
internal error: entered unreachable code: keys checked to be strings

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (4127921) panicked at crates/tla-eval/src/value.rs:74:30:
internal error: entered unreachable code: keys checked to be strings

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 10 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
