*** crates/tla-eval/src/value.rs:84:9: replace Value::entries -> Option<BTreeMap<Value, Value>> with None

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::entries -> Option<BTreeMap<Value, Value>> with None
@@ -76,33 +76,17 @@
                     .collect(),
             );
         }
         Value::Func(entries)
     }
 
     /// The function's graph, for values that are functions.
     pub fn entries(&self) -> Option<BTreeMap<Value, Value>> {
-        match self {
-            Value::Seq(items) => Some(
-                items
-                    .iter()
-                    .enumerate()
-                    .map(|(i, v)| (Value::Int(count(i) + 1), v.clone()))
-                    .collect(),
-            ),
-            Value::Record(fields) => Some(
-                fields
-                    .iter()
-                    .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
-                    .collect(),
-            ),
-            Value::Func(map) => Some(map.clone()),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (4129122) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:51:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [a |-> 5, b |-> 5] is not a function")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (4129130) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [s1 |-> 1, s2 |-> 0, s3 |-> 0] is not a function")

---- raft_rejects_a_second_vote_in_the_same_term stdout ----

thread 'raft_rejects_a_second_vote_in_the_same_term' (4129131) panicked at crates/tla-eval/tests/evaluate_specs.rs:263:66:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [s1 |-> 1, s2 |-> 1, s3 |-> 1] is not a function")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
