*** crates/tla-eval/src/value.rs:89:56: replace + with - in Value::entries

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace + with - in Value::entries
@@ -81,17 +81,17 @@
 
     /// The function's graph, for values that are functions.
     pub fn entries(&self) -> Option<BTreeMap<Value, Value>> {
         match self {
             Value::Seq(items) => Some(
                 items
                     .iter()
                     .enumerate()
-                    .map(|(i, v)| (Value::Int(count(i) + 1), v.clone()))
+                    .map(|(i, v)| (Value::Int(count(i) - /* ~ changed by cargo-mutants ~ */ 1), v.clone()))
                     .collect(),
             ),
             Value::Record(fields) => Some(
                 fields
                     .iter()
                     .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
                     .collect(),
             ),

---- the_graph_of_a_function_can_be_read_back stdout ----

thread 'the_graph_of_a_function_can_be_read_back' (285290) panicked at crates/tla-eval/tests/standard_operators.rs:196:5:
assertion `left == right` failed: a sequence is indexed from one
  left: Some({Int(-1): Int(10), Int(0): Int(20)})
 right: Some({Int(1): Int(10), Int(2): Int(20)})

failures:
    the_graph_of_a_function_can_be_read_back

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
