*** crates/tla-eval/src/value.rs:89:56: replace + with * in Value::entries

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace + with * in Value::entries
@@ -81,17 +81,17 @@
 
     /// The function's graph, for values that are functions.
     pub fn entries(&self) -> Option<BTreeMap<Value, Value>> {
         match self {
             Value::Seq(items) => Some(
                 items
                     .iter()
                     .enumerate()
-                    .map(|(i, v)| (Value::Int(count(i) + 1), v.clone()))
+                    .map(|(i, v)| (Value::Int(count(i) * /* ~ changed by cargo-mutants ~ */ 1), v.clone()))
                     .collect(),
             ),
             Value::Record(fields) => Some(
                 fields
                     .iter()
                     .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
                     .collect(),
             ),

*** result: Success
