*** crates/tla-eval/src/value.rs:92:13: delete match arm Value::Record(fields) in Value::entries

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Record(fields) in Value::entries
@@ -84,22 +84,17 @@
         match self {
             Value::Seq(items) => Some(
                 items
                     .iter()
                     .enumerate()
                     .map(|(i, v)| (Value::Int(count(i) + 1), v.clone()))
                     .collect(),
             ),
-            Value::Record(fields) => Some(
-                fields
-                    .iter()
-                    .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
-                    .collect(),
-            ),
+             /* ~ changed by cargo-mutants ~ */
             Value::Func(map) => Some(map.clone()),
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (736103) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:51:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [a |-> 5, b |-> 5] is not a function")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (736113) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [s1 |-> 1, s2 |-> 0, s3 |-> 0] is not a function")

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (736116) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:56:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [n1 |-> {2}, n2 |-> {1}, n3 |-> {3}] is not a function")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
