*** crates/tla-eval/src/value.rs:98:13: delete match arm Value::Func(map) in Value::entries

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Func(map) in Value::entries
@@ -90,17 +90,17 @@
                     .collect(),
             ),
             Value::Record(fields) => Some(
                 fields
                     .iter()
                     .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
                     .collect(),
             ),
-            Value::Func(map) => Some(map.clone()),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),

*** result: Success
