*** crates/tla-oracle/src/check.rs:148:9: delete field edges from struct Stats expression in check

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ delete field edges from struct Stats expression in check
@@ -140,17 +140,17 @@
             stats,
         }
     }
 }
 
 pub fn check(job: &Job) -> Report {
     let mut stats = Stats {
         states: job.states.len(),
-        edges: job.edges.len(),
+         /* ~ changed by cargo-mutants ~ */
         ..Stats::default()
     };
 
     let spec = match Spec::parse(&job.spec) {
         Ok(s) => s,
         Err(e) => return Report::of(Status::Error, format!("specification: {e}"), stats),
     };

---- the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept stdout ----

thread 'the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept' (296750) panicked at crates/tla-oracle/tests/jobs.rs:200:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
