*** crates/tla-oracle/src/check.rs:233:5: replace check_edges -> Option<Report> with None

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace check_edges -> Option<Report> with None
@@ -225,56 +225,17 @@
 }
 
 fn check_edges(
     job: &Job,
     evaluator: &Evaluator<'_>,
     states: &[State],
     stats: &mut Stats,
 ) -> Option<Report> {
-    for (index, (source, target, label)) in job.edges.iter().enumerate() {
-        let (Some(from), Some(to)) = (states.get(*source), states.get(*target)) else {
-            return Some(Report::of(
-                Status::Error,
-                format!("edge {index} refers to a state index outside the graph"),
-                *stats,
-            ));
-        };
-        stats.edges_checked = index + 1;
-        match evaluator.step_allowed(&job.next_op, from, to) {
-            Ok(true) => {}
-            Ok(false) => {
-                let blocked: Vec<BlockedReport> = evaluator
-                    .why_not(&job.next_op, from, to)
-                    .unwrap_or_default()
-                    .into_iter()
-                    .take(MAX_BLOCKED)
-                    .map(BlockedReport::from)
-                    .collect();
-                let mut report =
-                    Report::of(Status::Refines, explain(from, to, blocked.first()), *stats);
-                report.edge = Some(EdgeReport {
-                    index,
-                    source: *source,
-                    target: *target,
-                    label: label.clone(),
-                });
-                report.blocked = blocked;
-                return Some(report);
-            }
-            Err(e) => {
-                return Some(Report::of(
-                    classify(&e),
-                    format!("{}: {e}", job.next_op),
-                    *stats,
-                ));
-            }
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn check_outcomes(
     job: &Job,
     coverage: &Evaluator<'_>,
     outcomes: &[(String, Expr)],
     stats: &mut Stats,
 ) -> Option<Report> {

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (750076) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (750072) panicked at crates/tla-oracle/tests/jobs.rs:46:5:
assertion `left == right` failed
  left: 0
 right: 2

---- an_illegal_edge_is_named stdout ----

thread 'an_illegal_edge_is_named' (750080) panicked at crates/tla-oracle/tests/jobs.rs:69:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Refines

failures:
    a_legal_walk_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
