*** crates/tla-oracle/src/check.rs:241:37: replace + with - in check_edges

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace + with - in check_edges
@@ -233,17 +233,17 @@
     for (index, (source, target, label)) in job.edges.iter().enumerate() {
         let (Some(from), Some(to)) = (states.get(*source), states.get(*target)) else {
             return Some(Report::of(
                 Status::Error,
                 format!("edge {index} refers to a state index outside the graph"),
                 *stats,
             ));
         };
-        stats.edges_checked = index + 1;
+        stats.edges_checked = index - /* ~ changed by cargo-mutants ~ */ 1;
         match evaluator.step_allowed(&job.next_op, from, to) {
             Ok(true) => {}
             Ok(false) => {
                 let blocked: Vec<BlockedReport> = evaluator
                     .why_not(&job.next_op, from, to)
                     .unwrap_or_default()
                     .into_iter()
                     .take(MAX_BLOCKED)

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (4142715) panicked at crates/tla-oracle/src/check.rs:241:31:
attempt to subtract with overflow

---- a_passing_check_carries_no_diagnosis stdout ----

thread 'a_passing_check_carries_no_diagnosis' (4142717) panicked at crates/tla-oracle/src/check.rs:241:31:
attempt to subtract with overflow

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (4142719) panicked at crates/tla-oracle/src/check.rs:241:31:
attempt to subtract with overflow

failures:
    a_legal_walk_passes
    a_passing_check_carries_no_diagnosis
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_illegal_edge_is_named
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
