*** crates/tla-oracle/src/check.rs:281:5: replace check_outcomes -> Option<Report> with None

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace check_outcomes -> Option<Report> with None
@@ -273,51 +273,17 @@
 }
 
 fn check_outcomes(
     job: &Job,
     coverage: &Evaluator<'_>,
     outcomes: &[(String, Expr)],
     stats: &mut Stats,
 ) -> Option<Report> {
-    let nowhere = State::new();
-    for (name, expr) in outcomes {
-        stats.outcomes_checked += 1;
-        match coverage.eval_at(expr, &nowhere, None) {
-            Ok(Value::Bool(true)) => {}
-            Ok(Value::Bool(false)) => {
-                let mut report = Report::of(
-                    Status::Coverage,
-                    format!(
-                        "every transition is legal, but no reachable state satisfies the \
-                         required outcome `{name}`: {}",
-                        job.outcomes[name]
-                    ),
-                    *stats,
-                );
-                report.outcome = Some(name.clone());
-                return Some(report);
-            }
-            Ok(other) => {
-                return Some(Report::of(
-                    Status::Error,
-                    format!("outcome `{name}` is {other}, not a boolean"),
-                    *stats,
-                ));
-            }
-            Err(e) => {
-                return Some(Report::of(
-                    Status::Error,
-                    format!("outcome `{name}`: {e}"),
-                    *stats,
-                ));
-            }
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// A type error means the state does not fit the shape the specification reads
 /// it with — the schema let it through, but the specification cannot use it.
 fn classify(e: &EvalError) -> Status {
     match e {
         EvalError::Type(_) => Status::Contract,
         _ => Status::Error,

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (298408) panicked at crates/tla-oracle/tests/jobs.rs:89:5:
assertion `left == right` failed
  left: 0
 right: 1

---- an_outcome_that_is_not_a_predicate_is_an_error stdout ----

thread 'an_outcome_that_is_not_a_predicate_is_an_error' (298417) panicked at crates/tla-oracle/tests/jobs.rs:273:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Error

---- an_unreachable_outcome_is_a_coverage_failure stdout ----

thread 'an_unreachable_outcome_is_a_coverage_failure' (298419) panicked at crates/tla-oracle/tests/jobs.rs:80:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Coverage

failures:
    a_reachable_outcome_passes
    an_outcome_that_is_not_a_predicate_is_an_error
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
