*** crates/tla-oracle/src/check.rs:283:32: replace += with -= in check_outcomes

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace += with -= in check_outcomes
@@ -275,17 +275,17 @@
 fn check_outcomes(
     job: &Job,
     coverage: &Evaluator<'_>,
     outcomes: &[(String, Expr)],
     stats: &mut Stats,
 ) -> Option<Report> {
     let nowhere = State::new();
     for (name, expr) in outcomes {
-        stats.outcomes_checked += 1;
+        stats.outcomes_checked -= /* ~ changed by cargo-mutants ~ */ 1;
         match coverage.eval_at(expr, &nowhere, None) {
             Ok(Value::Bool(true)) => {}
             Ok(Value::Bool(false)) => {
                 let mut report = Report::of(
                     Status::Coverage,
                     format!(
                         "every transition is legal, but no reachable state satisfies the \
                          required outcome `{name}`: {}",

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (4143607) panicked at crates/tla-oracle/src/check.rs:283:9:
attempt to subtract with overflow

---- an_unreachable_outcome_is_a_coverage_failure stdout ----

thread 'an_unreachable_outcome_is_a_coverage_failure' (4143612) panicked at crates/tla-oracle/src/check.rs:283:9:
attempt to subtract with overflow

failures:
    a_reachable_outcome_passes
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
