*** crates/tla-oracle/src/check.rs:31:5: replace init_default -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace init_default -> String with "xyzzy".into()
@@ -23,17 +23,17 @@
     #[serde(default)]
     pub edges: Vec<Edge>,
     /// Predicates over `Reached`, the set of states the implementation visited.
     #[serde(default)]
     pub outcomes: BTreeMap<String, String>,
 }
 
 fn init_default() -> String {
-    "Init".to_string()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn next_default() -> String {
     "Next".to_string()
 }
 
 #[derive(Debug, Clone, Deserialize)]
 pub struct ConstantSpec {

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (4142089) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: xyzzy: `xyzzy` is not defined
  left: Error
 right: Pass

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (4142092) panicked at crates/tla-oracle/tests/jobs.rs:88:5:
assertion `left == right` failed: xyzzy: `xyzzy` is not defined
  left: Error
 right: Pass

---- an_illegal_edge_is_named stdout ----

thread 'an_illegal_edge_is_named' (4142095) panicked at crates/tla-oracle/tests/jobs.rs:69:5:
assertion `left == right` failed: xyzzy: `xyzzy` is not defined
  left: Error
 right: Refines

failures:
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
