*** crates/tla-oracle/src/check.rs:322:9: delete match arm EvalError::Type(_) in classify

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ delete match arm EvalError::Type(_) in classify
@@ -314,17 +314,17 @@
     }
     None
 }
 
 /// A type error means the state does not fit the shape the specification reads
 /// it with — the schema let it through, but the specification cannot use it.
 fn classify(e: &EvalError) -> Status {
     match e {
-        EvalError::Type(_) => Status::Contract,
+         /* ~ changed by cargo-mutants ~ */
         _ => Status::Error,
     }
 }
 
 fn decode_constants(
     given: &BTreeMap<String, ConstantSpec>,
 ) -> Result<BTreeMap<String, Value>, String> {
     given

*** result: Success
