*** crates/tla-oracle/src/check.rs:330:5: replace decode_constants -> Result<BTreeMap<String, Value>, String> with Ok(BTreeMap::new())

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace decode_constants -> Result<BTreeMap<String, Value>, String> with Ok(BTreeMap::new())
@@ -322,24 +322,17 @@
         EvalError::Type(_) => Status::Contract,
         _ => Status::Error,
     }
 }
 
 fn decode_constants(
     given: &BTreeMap<String, ConstantSpec>,
 ) -> Result<BTreeMap<String, Value>, String> {
-    given
-        .iter()
-        .map(|(name, spec)| {
-            decode(&spec.value, &spec.schema, name)
-                .map(|v| (name.clone(), v))
-                .map_err(|e| format!("constant {e}"))
-        })
-        .collect()
+    Ok(BTreeMap::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_states(job: &Job) -> Result<Vec<State>, String> {
     job.states
         .iter()
         .enumerate()
         .map(|(i, json)| {
             decode_state(json, &job.schema, &format!("state[{i}]")).map_err(|e| e.to_string())

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (299787) panicked at crates/tla-oracle/tests/jobs.rs:88:5:
assertion `left == right` failed: `constants without a value: Capacity, MaxItems` is not defined
  left: Error
 right: Pass

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (299782) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: `constants without a value: Capacity, MaxItems` is not defined
  left: Error
 right: Pass

---- an_edge_pointing_outside_the_graph_is_an_error stdout ----

thread 'an_edge_pointing_outside_the_graph_is_an_error' (299793) panicked at crates/tla-oracle/tests/jobs.rs:247:5:
`constants without a value: Capacity, MaxItems` is not defined

failures:
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error
    an_unreachable_outcome_is_a_coverage_failure
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 10 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
