*** crates/tla-oracle/src/check.rs:351:5: replace parse_outcomes -> Result<Vec<(String, Expr)>, String> with Ok(vec![])

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace parse_outcomes -> Result<Vec<(String, Expr)>, String> with Ok(vec![])
@@ -343,24 +343,17 @@
         .enumerate()
         .map(|(i, json)| {
             decode_state(json, &job.schema, &format!("state[{i}]")).map_err(|e| e.to_string())
         })
         .collect()
 }
 
 fn parse_outcomes(job: &Job) -> Result<Vec<(String, Expr)>, String> {
-    job.outcomes
-        .iter()
-        .map(|(name, src)| {
-            parse_expression(src)
-                .map(|e| (name.clone(), e))
-                .map_err(|e| format!("outcome `{name}`: {e}"))
-        })
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The refinement failure in words, naming what the implementation looked as
 /// though it was trying to do.
 fn explain(from: &State, to: &State, closest: Option<&BlockedReport>) -> String {
     let head = format!(
         "no action of the specification takes {} to {}",
         render(from),

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (300334) panicked at crates/tla-oracle/tests/jobs.rs:89:5:
assertion `left == right` failed
  left: 0
 right: 1

---- an_unparsable_outcome_names_itself stdout ----

thread 'an_unparsable_outcome_names_itself' (300347) panicked at crates/tla-oracle/tests/jobs.rs:281:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Error

---- an_outcome_that_is_not_a_predicate_is_an_error stdout ----

thread 'an_outcome_that_is_not_a_predicate_is_an_error' (300346) panicked at crates/tla-oracle/tests/jobs.rs:273:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Error

failures:
    a_reachable_outcome_passes
    an_outcome_that_is_not_a_predicate_is_an_error
    an_unparsable_outcome_names_itself
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
