*** crates/tla-oracle/src/check.rs:35:5: replace next_default -> String with String::new()

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace next_default -> String with String::new()
@@ -27,17 +27,17 @@
     pub outcomes: BTreeMap<String, String>,
 }
 
 fn init_default() -> String {
     "Init".to_string()
 }
 
 fn next_default() -> String {
-    "Next".to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Deserialize)]
 pub struct ConstantSpec {
     pub value: Json,
     pub schema: Schema,
 }

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (4139711) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: : `` is not defined
  left: Error
 right: Pass

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (4139715) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (4139714) panicked at crates/tla-oracle/tests/jobs.rs:88:5:
assertion `left == right` failed: : `` is not defined
  left: Error
 right: Pass

failures:
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_illegal_edge_is_named
    an_unreachable_outcome_is_a_coverage_failure

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
