*** crates/tla-oracle/src/check.rs:364:5: replace explain -> String with String::new()

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace explain -> String with String::new()
@@ -356,33 +356,17 @@
                 .map_err(|e| format!("outcome `{name}`: {e}"))
         })
         .collect()
 }
 
 /// The refinement failure in words, naming what the implementation looked as
 /// though it was trying to do.
 fn explain(from: &State, to: &State, closest: Option<&BlockedReport>) -> String {
-    let head = format!(
-        "no action of the specification takes {} to {}",
-        render(from),
-        render(to)
-    );
-    let Some(near) = closest else {
-        return head;
-    };
-    let why = if near.about_next_state {
-        "which was available here but does not produce that state"
-    } else {
-        "which was not available here"
-    };
-    format!(
-        "{head}. The closest was `{}`, {why}: `{}` does not hold ({} of its {} conjuncts do)",
-        near.action, near.conjunct, near.satisfied, near.total
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn render(state: &State) -> String {
     let body: Vec<String> = state
         .iter()
         .map(|(name, value)| format!("{name} = {value}"))
         .collect();
     format!("[{}]", body.join(", "))

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (301022) panicked at crates/tla-oracle/tests/jobs.rs:177:5:

failures:
    a_refinement_failure_names_the_action_that_came_closest

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
