*** crates/tla-oracle/src/check.rs:384:5: replace render -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace render -> String with "xyzzy".into()
@@ -376,14 +376,10 @@
     };
     format!(
         "{head}. The closest was `{}`, {why}: `{}` does not hold ({} of its {} conjuncts do)",
         near.action, near.conjunct, near.satisfied, near.total
     )
 }
 
 fn render(state: &State) -> String {
-    let body: Vec<String> = state
-        .iter()
-        .map(|(name, value)| format!("{name} = {value}"))
-        .collect();
-    format!("[{}]", body.join(", "))
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

---- an_illegal_root_is_quoted_in_the_report stdout ----

thread 'an_illegal_root_is_quoted_in_the_report' (301287) panicked at crates/tla-oracle/tests/jobs.rs:223:5:
the first state the implementation reports is not a legal initial state of the specification: xyzzy

failures:
    an_illegal_root_is_quoted_in_the_report

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
