*** crates/tla-oracle/src/schema.rs:152:5: replace decode_state -> Result<tla_eval::State> with Ok(Default::default())

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace decode_state -> Result<tla_eval::State> with Ok(Default::default())
@@ -144,38 +144,17 @@
 }
 
 /// Read a whole state: exactly the specification's variables, nothing else.
 pub fn decode_state(
     json: &Json,
     schema: &BTreeMap<String, Schema>,
     path: &str,
 ) -> Result<tla_eval::State> {
-    let given = object(json, path)?;
-    let expected: BTreeSet<&String> = schema.keys().collect();
-    let actual: BTreeSet<&String> = given.keys().collect();
-    if expected != actual {
-        return fail(
-            path,
-            format!(
-                "state keys must be exactly the specification's variables \
-                 (missing={:?}, unexpected={:?})",
-                sorted_diff(&expected, &actual),
-                sorted_diff(&actual, &expected)
-            ),
-        );
-    }
-    let mut state = tla_eval::State::new();
-    for (name, field) in schema {
-        state.insert(
-            name.clone(),
-            decode(&given[name], field, &format!("{path}.{name}"))?,
-        );
-    }
-    Ok(state)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn array<'a>(json: &'a Json, path: &str) -> Result<&'a Vec<Json>> {
     json.as_array().map_or_else(
         || fail(path, format!("expected an array, got {}", kind_of(json))),
         Ok,
     )
 }

---- a_boolean_is_not_accepted_where_an_integer_is_wanted stdout ----

thread 'a_boolean_is_not_accepted_where_an_integer_is_wanted' (756028) panicked at crates/tla-oracle/tests/jobs.rs:265:5:
assertion `left == right` failed: Init: the state gives no value for variable `s`
  left: Error
 right: Contract

---- a_missing_variable_is_a_contract_violation stdout ----

thread 'a_missing_variable_is_a_contract_violation' (756032) panicked at crates/tla-oracle/tests/jobs.rs:106:5:
assertion `left == right` failed: Init: the state gives no value for variable `buf`
  left: Error
 right: Contract

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (756035) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

failures:
    a_boolean_is_not_accepted_where_an_integer_is_wanted
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    a_state_the_specification_cannot_read_is_a_contract_violation
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
