*** crates/tla-oracle/src/schema.rs:155:17: replace != with == in decode_state

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace != with == in decode_state
@@ -147,17 +147,17 @@
 pub fn decode_state(
     json: &Json,
     schema: &BTreeMap<String, Schema>,
     path: &str,
 ) -> Result<tla_eval::State> {
     let given = object(json, path)?;
     let expected: BTreeSet<&String> = schema.keys().collect();
     let actual: BTreeSet<&String> = given.keys().collect();
-    if expected != actual {
+    if expected == /* ~ changed by cargo-mutants ~ */ actual {
         return fail(
             path,
             format!(
                 "state keys must be exactly the specification's variables \
                  (missing={:?}, unexpected={:?})",
                 sorted_diff(&expected, &actual),
                 sorted_diff(&actual, &expected)
             ),

---- a_constant_without_a_value_is_an_error stdout ----

thread 'a_constant_without_a_value_is_an_error' (4147922) panicked at crates/tla-oracle/tests/jobs.rs:145:5:
assertion `left == right` failed
  left: Contract
 right: Error

---- a_missing_variable_is_a_contract_violation stdout ----

thread 'a_missing_variable_is_a_contract_violation' (4147927) panicked at crates/tla-oracle/src/schema.rs:170:26:
no entry found for key

---- duplicate_members_of_a_set_are_rejected stdout ----

thread 'duplicate_members_of_a_set_are_rejected' (4147941) panicked at crates/tla-oracle/tests/jobs.rs:120:5:
state[0]: state keys must be exactly the specification's variables (missing=[], unexpected=[])

failures:
    a_constant_without_a_value_is_an_error
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_unreachable_outcome_is_a_coverage_failure
    duplicate_members_of_a_set_are_rejected

test result: FAILED. 3 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
