*** crates/tla-oracle/src/schema.rs:177:5: replace array -> Result<&'a Vec<Json>> with Ok(Box::leak(Box::new(vec![])))

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace array -> Result<&'a Vec<Json>> with Ok(Box::leak(Box::new(vec![])))
@@ -169,20 +169,17 @@
             name.clone(),
             decode(&given[name], field, &format!("{path}.{name}"))?,
         );
     }
     Ok(state)
 }
 
 fn array<'a>(json: &'a Json, path: &str) -> Result<&'a Vec<Json>> {
-    json.as_array().map_or_else(
-        || fail(path, format!("expected an array, got {}", kind_of(json))),
-        Ok,
-    )
+    Ok(Box::leak(Box::new(vec![]))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn object<'a>(json: &'a Json, path: &str) -> Result<&'a serde_json::Map<String, Json>> {
     json.as_object().map_or_else(
         || fail(path, format!("expected an object, got {}", kind_of(json))),
         Ok,
     )
 }

---- a_state_of_the_wrong_shape_is_a_contract_violation stdout ----

thread 'a_state_of_the_wrong_shape_is_a_contract_violation' (756822) panicked at crates/tla-oracle/tests/jobs.rs:98:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Contract

---- an_illegal_root_is_quoted_in_the_report stdout ----

thread 'an_illegal_root_is_quoted_in_the_report' (756827) panicked at crates/tla-oracle/tests/jobs.rs:222:5:
assertion `left == right` failed
  left: Pass
 right: Init

---- an_illegal_root_is_an_init_failure stdout ----

thread 'an_illegal_root_is_an_init_failure' (756826) panicked at crates/tla-oracle/tests/jobs.rs:53:5:
assertion `left == right` failed: all obligations discharged
  left: Pass
 right: Init

failures:
    a_legal_walk_passes
    a_passing_check_carries_no_diagnosis
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_unreachable_outcome_is_a_coverage_failure
    duplicate_members_of_a_set_are_rejected
    the_status_names_match_the_harness_vocabulary
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 8 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
