*** crates/tla-oracle/src/schema.rs:177:5: replace array -> Result<&'a Vec<Json>> with Ok(Box::leak(Box::new(vec![Default::default()])))

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace array -> Result<&'a Vec<Json>> with Ok(Box::leak(Box::new(vec![Default::default()])))
@@ -169,20 +169,17 @@
             name.clone(),
             decode(&given[name], field, &format!("{path}.{name}"))?,
         );
     }
     Ok(state)
 }
 
 fn array<'a>(json: &'a Json, path: &str) -> Result<&'a Vec<Json>> {
-    json.as_array().map_or_else(
-        || fail(path, format!("expected an array, got {}", kind_of(json))),
-        Ok,
-    )
+    Ok(Box::leak(Box::new(vec![Default::default()]))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn object<'a>(json: &'a Json, path: &str) -> Result<&'a serde_json::Map<String, Json>> {
     json.as_object().map_or_else(
         || fail(path, format!("expected an object, got {}", kind_of(json))),
         Ok,
     )
 }

---- a_reachable_outcome_passes stdout ----

thread 'a_reachable_outcome_passes' (304221) panicked at crates/tla-oracle/tests/jobs.rs:88:5:
assertion `left == right` failed: state[0].buf[0]: expected an integer, got null
  left: Contract
 right: Pass

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (304222) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (304218) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: state[0].buf[0]: expected an integer, got null
  left: Contract
 right: Pass

failures:
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error
    an_unparsable_outcome_names_itself
    an_unreachable_outcome_is_a_coverage_failure
    duplicate_members_of_a_set_are_rejected
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 8 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
