*** crates/tla-oracle/src/schema.rs:184:5: replace object -> Result<&'a serde_json::Map<String, Json>> with Ok(Box::leak(Box::new(Default::default())))

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace object -> Result<&'a serde_json::Map<String, Json>> with Ok(Box::leak(Box::new(Default::default())))
@@ -176,20 +176,17 @@
 fn array<'a>(json: &'a Json, path: &str) -> Result<&'a Vec<Json>> {
     json.as_array().map_or_else(
         || fail(path, format!("expected an array, got {}", kind_of(json))),
         Ok,
     )
 }
 
 fn object<'a>(json: &'a Json, path: &str) -> Result<&'a serde_json::Map<String, Json>> {
-    json.as_object().map_or_else(
-        || fail(path, format!("expected an object, got {}", kind_of(json))),
-        Ok,
-    )
+    Ok(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn sorted_diff(a: &BTreeSet<&String>, b: &BTreeSet<&String>) -> Vec<String> {
     a.difference(b).map(|s| (*s).clone()).collect()
 }
 
 fn kind_of(json: &Json) -> &'static str {
     match json {

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (756951) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: state[0]: state keys must be exactly the specification's variables (missing=["buf", "nextVal", "received"], unexpected=[])
  left: Contract
 right: Pass

---- a_boolean_is_not_accepted_where_an_integer_is_wanted stdout ----

thread 'a_boolean_is_not_accepted_where_an_integer_is_wanted' (756948) panicked at crates/tla-oracle/tests/jobs.rs:266:5:
state[0]: state keys must be exactly the specification's variables (missing=["s"], unexpected=[])

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (756955) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

failures:
    a_boolean_is_not_accepted_where_an_integer_is_wanted
    a_constant_without_a_value_is_an_error
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    a_state_the_specification_cannot_read_is_a_contract_violation
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
