*** crates/tla-oracle/src/schema.rs:191:5: replace sorted_diff -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace sorted_diff -> Vec<String> with vec![String::new()]
@@ -183,17 +183,17 @@
 fn object<'a>(json: &'a Json, path: &str) -> Result<&'a serde_json::Map<String, Json>> {
     json.as_object().map_or_else(
         || fail(path, format!("expected an object, got {}", kind_of(json))),
         Ok,
     )
 }
 
 fn sorted_diff(a: &BTreeSet<&String>, b: &BTreeSet<&String>) -> Vec<String> {
-    a.difference(b).map(|s| (*s).clone()).collect()
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn kind_of(json: &Json) -> &'static str {
     match json {
         Json::Null => "null",
         Json::Bool(_) => "a boolean",
         Json::Number(_) => "a number",
         Json::String(_) => "a string",

---- a_missing_variable_is_a_contract_violation stdout ----

thread 'a_missing_variable_is_a_contract_violation' (4149283) panicked at crates/tla-oracle/tests/jobs.rs:107:5:
state[0]: state keys must be exactly the specification's variables (missing=[""], unexpected=[""])

failures:
    a_missing_variable_is_a_contract_violation

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
