*** crates/tla-oracle/src/schema.rs:195:5: replace kind_of -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace kind_of -> &'static str with "xyzzy"
@@ -187,17 +187,10 @@
     )
 }
 
 fn sorted_diff(a: &BTreeSet<&String>, b: &BTreeSet<&String>) -> Vec<String> {
     a.difference(b).map(|s| (*s).clone()).collect()
 }
 
 fn kind_of(json: &Json) -> &'static str {
-    match json {
-        Json::Null => "null",
-        Json::Bool(_) => "a boolean",
-        Json::Number(_) => "a number",
-        Json::String(_) => "a string",
-        Json::Array(_) => "an array",
-        Json::Object(_) => "an object",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
