*** crates/tla-oracle/src/schema.rs:47:9: replace <impl std::fmt::Display for DecodeError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace <impl std::fmt::Display for DecodeError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -39,17 +39,17 @@
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct DecodeError {
     pub path: String,
     pub message: String,
 }
 
 impl std::fmt::Display for DecodeError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "{}: {}", self.path, self.message)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for DecodeError {}
 
 type Result<T> = std::result::Result<T, DecodeError>;
 
 fn fail<T>(path: &str, message: impl Into<String>) -> Result<T> {

---- a_boolean_is_not_accepted_where_an_integer_is_wanted stdout ----

thread 'a_boolean_is_not_accepted_where_an_integer_is_wanted' (301817) panicked at crates/tla-oracle/tests/jobs.rs:266:5:

---- a_missing_variable_is_a_contract_violation stdout ----

thread 'a_missing_variable_is_a_contract_violation' (301821) panicked at crates/tla-oracle/tests/jobs.rs:107:5:

---- a_state_of_the_wrong_shape_is_a_contract_violation stdout ----

thread 'a_state_of_the_wrong_shape_is_a_contract_violation' (301825) panicked at crates/tla-oracle/tests/jobs.rs:99:5:

failures:
    a_boolean_is_not_accepted_where_an_integer_is_wanted
    a_missing_variable_is_a_contract_violation
    a_state_of_the_wrong_shape_is_a_contract_violation
    duplicate_members_of_a_set_are_rejected

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
