*** crates/tla-oracle/src/schema.rs:65:24: replace match guard !json.is_boolean() with false in decode

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ replace match guard !json.is_boolean() with false in decode
@@ -57,17 +57,17 @@
         path: path.to_string(),
         message: message.into(),
     })
 }
 
 pub fn decode(json: &Json, schema: &Schema, path: &str) -> Result<Value> {
     match schema {
         Schema::Int => match json.as_i64() {
-            Some(n) if !json.is_boolean() => Ok(Value::Int(n)),
+            Some(n) if false /* ~ changed by cargo-mutants ~ */ => Ok(Value::Int(n)),
             _ => fail(path, format!("expected an integer, got {}", kind_of(json))),
         },
         Schema::Bool => match json.as_bool() {
             Some(b) => Ok(Value::Bool(b)),
             None => fail(path, format!("expected a boolean, got {}", kind_of(json))),
         },
         Schema::Str => match json.as_str() {
             Some(s) => Ok(Value::string(s)),

---- a_constant_without_a_value_is_an_error stdout ----

thread 'a_constant_without_a_value_is_an_error' (4147067) panicked at crates/tla-oracle/tests/jobs.rs:145:5:
assertion `left == right` failed
  left: Contract
 right: Error

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (4147068) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: constant Capacity: expected an integer, got a number
  left: Error
 right: Pass

---- duplicate_members_of_a_set_are_rejected stdout ----

thread 'duplicate_members_of_a_set_are_rejected' (4147077) panicked at crates/tla-oracle/tests/jobs.rs:120:5:
state[0].s[0]: expected an integer, got a number

failures:
    a_constant_without_a_value_is_an_error
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_unreachable_outcome_is_a_coverage_failure
    duplicate_members_of_a_set_are_rejected
    the_status_names_match_the_harness_vocabulary

test result: FAILED. 2 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
