*** crates/tla-syntax/src/ast.rs:121:9: replace QuantKind::is_temporal -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace QuantKind::is_temporal -> bool with true
@@ -113,17 +113,17 @@
     /// `\AA` and `\EE`, which quantify over a hidden *variable* rather than a
     /// value, and so describe behaviours rather than states.
     TemporalForall,
     TemporalExists,
 }
 
 impl QuantKind {
     pub fn is_temporal(self) -> bool {
-        matches!(self, Self::TemporalForall | Self::TemporalExists)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ExceptPath {
     Index(Expr),
     Field(String),
 }

*** result: Success
