*** crates/tla-syntax/src/ast.rs:12:9: replace Module::definition -> Option<&Def> with None

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace Module::definition -> Option<&Def> with None
@@ -4,20 +4,17 @@
 pub struct Module {
     pub name: String,
     pub extends: Vec<String>,
     pub units: Vec<Unit>,
 }
 
 impl Module {
     pub fn definition(&self, name: &str) -> Option<&Def> {
-        self.units.iter().find_map(|u| match u {
-            Unit::Def(d) if d.name == name => Some(d),
-            _ => None,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &Decl> {
         self.units
             .iter()
             .filter_map(|u| match u {
                 Unit::Constants(ds) => Some(ds),
                 _ => None,

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (306520) panicked at crates/tla-syntax/tests/grammar.rs:18:28:
`F` is not defined

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (306519) panicked at crates/tla-syntax/tests/grammar.rs:18:28:
`Pick` is not defined

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (306521) panicked at crates/tla-syntax/tests/grammar.rs:18:28:
`f` is not defined

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list

test result: FAILED. 3 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
