*** crates/tla-syntax/src/ast.rs:13:29: replace match guard d.name == name with true in Module::definition

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace match guard d.name == name with true in Module::definition
@@ -5,17 +5,17 @@
     pub name: String,
     pub extends: Vec<String>,
     pub units: Vec<Unit>,
 }
 
 impl Module {
     pub fn definition(&self, name: &str) -> Option<&Def> {
         self.units.iter().find_map(|u| match u {
-            Unit::Def(d) if d.name == name => Some(d),
+            Unit::Def(d) if true /* ~ changed by cargo-mutants ~ */ => Some(d),
             _ => None,
         })
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &Decl> {
         self.units
             .iter()
             .filter_map(|u| match u {

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (306699) panicked at crates/tla-syntax/tests/parse_specs.rs:93:5:
assertion `left == right` failed
  left: 1
 right: 3

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (306706) panicked at crates/tla-syntax/tests/parse_specs.rs:80:5:
assertion `left == right` failed: TMCommit, TMAbort and the quantified group
  left: 1
 right: 3

---- qualified_names_resolve_through_the_instance stdout ----

thread 'qualified_names_resolve_through_the_instance' (306709) panicked at crates/tla-syntax/tests/parse_specs.rs:120:5:
S!TPNext appears as a conjunct

failures:
    always_binds_tighter_than_conjunction
    junction_lists_are_scoped_by_column
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    qualified_names_resolve_through_the_instance

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
