*** crates/tla-syntax/src/ast.rs:19:9: replace Module::constants -> impl Iterator<Item =&Decl> with ::std::iter::empty()

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace Module::constants -> impl Iterator<Item =&Decl> with ::std::iter::empty()
@@ -11,23 +11,17 @@
     pub fn definition(&self, name: &str) -> Option<&Def> {
         self.units.iter().find_map(|u| match u {
             Unit::Def(d) if d.name == name => Some(d),
             _ => None,
         })
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &Decl> {
-        self.units
-            .iter()
-            .filter_map(|u| match u {
-                Unit::Constants(ds) => Some(ds),
-                _ => None,
-            })
-            .flatten()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn variables(&self) -> impl Iterator<Item = &String> {
         self.units
             .iter()
             .filter_map(|u| match u {
                 Unit::Variables(vs) => Some(vs),
                 _ => None,

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (4151969) panicked at crates/tla-syntax/tests/parse_specs.rs:48:5:
assertion `left == right` failed
  left: []
 right: ["Acceptor", "Value", "Ballot", "Quorum"]

failures:
    declarations_are_collected

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
