*** crates/tla-syntax/src/ast.rs:257:44: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -249,17 +249,17 @@
             Expr::Qualified { args, .. } => args.iter().any(Expr::mentions_next_state),
             Expr::Tuple(items) | Expr::SetEnum(items) => {
                 items.iter().any(Expr::mentions_next_state)
             }
             Expr::SetFilter { bound, pred } => {
                 bound.mentions_next_state() || pred.mentions_next_state()
             }
             Expr::SetMap { expr, bounds } => {
-                expr.mentions_next_state() || bounds.iter().any(Bound::mentions_next_state)
+                expr.mentions_next_state() && /* ~ changed by cargo-mutants ~ */ bounds.iter().any(Bound::mentions_next_state)
             }
             Expr::Record(fields) | Expr::RecordSet(fields) => {
                 fields.iter().any(|(_, v)| v.mentions_next_state())
             }
             Expr::FnSet { domain, range } => {
                 domain.mentions_next_state() || range.mentions_next_state()
             }
             Expr::Except { base, updates } => {

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (319235) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`{y : y \in S'}` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
