*** crates/tla-syntax/src/ast.rs:267:21: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -259,17 +259,17 @@
             Expr::Record(fields) | Expr::RecordSet(fields) => {
                 fields.iter().any(|(_, v)| v.mentions_next_state())
             }
             Expr::FnSet { domain, range } => {
                 domain.mentions_next_state() || range.mentions_next_state()
             }
             Expr::Except { base, updates } => {
                 base.mentions_next_state()
-                    || updates.iter().any(|(path, value)| {
+                    && /* ~ changed by cargo-mutants ~ */ updates.iter().any(|(path, value)| {
                         value.mentions_next_state()
                             || path.iter().any(|step| match step {
                                 ExceptPath::Index(e) => e.mentions_next_state(),
                                 ExceptPath::Field(_) => false,
                             })
                     })
             }
             Expr::FnDef { bounds, body } | Expr::Quant { bounds, body, .. } => {

*** result: Success
