*** crates/tla-syntax/src/ast.rs:269:29: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -261,17 +261,17 @@
             }
             Expr::FnSet { domain, range } => {
                 domain.mentions_next_state() || range.mentions_next_state()
             }
             Expr::Except { base, updates } => {
                 base.mentions_next_state()
                     || updates.iter().any(|(path, value)| {
                         value.mentions_next_state()
-                            || path.iter().any(|step| match step {
+                            && /* ~ changed by cargo-mutants ~ */ path.iter().any(|step| match step {
                                 ExceptPath::Index(e) => e.mentions_next_state(),
                                 ExceptPath::Field(_) => false,
                             })
                     })
             }
             Expr::FnDef { bounds, body } | Expr::Quant { bounds, body, .. } => {
                 body.mentions_next_state() || bounds.iter().any(Bound::mentions_next_state)
             }

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (322140) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`[f EXCEPT ![k] = v']` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
