*** crates/tla-syntax/src/ast.rs:279:45: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -271,17 +271,17 @@
                                 ExceptPath::Field(_) => false,
                             })
                     })
             }
             Expr::FnDef { bounds, body } | Expr::Quant { bounds, body, .. } => {
                 body.mentions_next_state() || bounds.iter().any(Bound::mentions_next_state)
             }
             Expr::Choose { bound, body } => {
-                bound.mentions_next_state() || body.mentions_next_state()
+                bound.mentions_next_state() && /* ~ changed by cargo-mutants ~ */ body.mentions_next_state()
             }
             Expr::Lambda { body, .. } => body.mentions_next_state(),
             Expr::Let { defs, body } => {
                 body.mentions_next_state() || defs.iter().any(|d| d.body.mentions_next_state())
             }
             Expr::If {
                 cond,
                 then,

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (322852) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`CHOOSE y \in S' : TRUE` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
