*** crates/tla-syntax/src/ast.rs:291:21: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -283,17 +283,17 @@
                 body.mentions_next_state() || defs.iter().any(|d| d.body.mentions_next_state())
             }
             Expr::If {
                 cond,
                 then,
                 otherwise,
             } => {
                 cond.mentions_next_state()
-                    || then.mentions_next_state()
+                    && /* ~ changed by cargo-mutants ~ */ then.mentions_next_state()
                     || otherwise.mentions_next_state()
             }
             Expr::Case { arms, other } => {
                 arms.iter()
                     .any(|(g, r)| g.mentions_next_state() || r.mentions_next_state())
                     || other.as_ref().is_some_and(|o| o.mentions_next_state())
             }
             Expr::Num(_) | Expr::Str(_) | Expr::Bool(_) | Expr::Ident(_) | Expr::At => false,

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (324957) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`IF x' > 0 THEN 1 ELSE 2` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
