*** crates/tla-syntax/src/ast.rs:296:59: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -288,17 +288,17 @@
                 otherwise,
             } => {
                 cond.mentions_next_state()
                     || then.mentions_next_state()
                     || otherwise.mentions_next_state()
             }
             Expr::Case { arms, other } => {
                 arms.iter()
-                    .any(|(g, r)| g.mentions_next_state() || r.mentions_next_state())
+                    .any(|(g, r)| g.mentions_next_state() && /* ~ changed by cargo-mutants ~ */ r.mentions_next_state())
                     || other.as_ref().is_some_and(|o| o.mentions_next_state())
             }
             Expr::Num(_) | Expr::Str(_) | Expr::Bool(_) | Expr::Ident(_) | Expr::At => false,
         }
     }
 
     pub fn conjunction(items: Vec<Expr>) -> Expr {
         Self::fold(items, Op::And)

*** result: Success
