*** crates/tla-syntax/src/ast.rs:29:9: replace Module::variables -> impl Iterator<Item =&String> with ::std::iter::empty()

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace Module::variables -> impl Iterator<Item =&String> with ::std::iter::empty()
@@ -21,23 +21,17 @@
             .filter_map(|u| match u {
                 Unit::Constants(ds) => Some(ds),
                 _ => None,
             })
             .flatten()
     }
 
     pub fn variables(&self) -> impl Iterator<Item = &String> {
-        self.units
-            .iter()
-            .filter_map(|u| match u {
-                Unit::Variables(vs) => Some(vs),
-                _ => None,
-            })
-            .flatten()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Unit {
     Constants(Vec<Decl>),
     Variables(Vec<String>),
     Recursive(Vec<Decl>),

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (4152793) panicked at crates/tla-syntax/tests/parse_specs.rs:50:5:
assertion `left == right` failed
  left: []
 right: ["maxBal", "maxVBal", "maxVal", "msgs"]

failures:
    declarations_are_collected

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
