*** crates/tla-syntax/src/lexer.rs:103:46: replace += with *= in Lexer::run

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with *= in Lexer::run
@@ -95,17 +95,17 @@
         // outermost one, not at the first one seen.
         let mut depth = 0usize;
         loop {
             self.skip_trivia()?;
             let (line, col) = (self.line, self.col);
             let Some(c) = self.peek() else { break };
             let tok = self.scan(c)?;
             match tok {
-                Tok::Kw(Kw::Module) => depth += 1,
+                Tok::Kw(Kw::Module) => depth *= /* ~ changed by cargo-mutants ~ */ 1,
                 Tok::ModuleEnd => depth = depth.saturating_sub(1),
                 _ => {}
             }
             let closed = matches!(tok, Tok::ModuleEnd) && depth == 0;
             self.out.push(Token { tok, line, col });
             if closed {
                 break;
             }

---- a_module_may_contain_another stdout ----

thread 'a_module_may_contain_another' (352862) panicked at crates/tla-syntax/tests/grammar.rs:214:5:
assertion failed: m.definition("Outer").is_some()

failures:
    a_module_may_contain_another

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
