*** crates/tla-syntax/src/lexer.rs:122:9: replace Lexer::skip_trivia -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::skip_trivia -> Result<()> with Ok(())
@@ -114,30 +114,17 @@
             tok: Tok::Eof,
             line: self.line,
             col: self.col,
         });
         Ok(self.out)
     }
 
     fn skip_trivia(&mut self) -> Result<()> {
-        loop {
-            match self.peek() {
-                Some(c) if c.is_whitespace() => {
-                    self.bump();
-                }
-                Some('\\') if self.at(1) == Some('*') => {
-                    while !matches!(self.peek(), None | Some('\n')) {
-                        self.bump();
-                    }
-                }
-                Some('(') if self.at(1) == Some('*') => self.skip_block_comment()?,
-                _ => return Ok(()),
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn skip_block_comment(&mut self) -> Result<()> {
         let (line, col) = (self.line, self.col);
         let mut depth = 0usize;
         loop {
             if self.peek().is_none() {
                 return Err(Error::lex("unterminated (* comment", line, col));

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4182093) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:5: unexpected character ' '
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (4182095) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:5: unexpected character ' '
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4182094) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:5: unexpected character ' '
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
