*** crates/tla-syntax/src/lexer.rs:127:31: replace match guard self.at(1) == Some('*') with true in Lexer::skip_trivia

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace match guard self.at(1) == Some('*') with true in Lexer::skip_trivia
@@ -119,17 +119,17 @@
     }
 
     fn skip_trivia(&mut self) -> Result<()> {
         loop {
             match self.peek() {
                 Some(c) if c.is_whitespace() => {
                     self.bump();
                 }
-                Some('\\') if self.at(1) == Some('*') => {
+                Some('\\') if true /* ~ changed by cargo-mutants ~ */ => {
                     while !matches!(self.peek(), None | Some('\n')) {
                         self.bump();
                     }
                 }
                 Some('(') if self.at(1) == Some('*') => self.skip_block_comment()?,
                 _ => return Ok(()),
             }
         }

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4183236) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected Colon, found ModuleEnd
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (4183238) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected RBrack, found ModuleEnd
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (4183243) panicked at crates/tla-syntax/tests/grammar.rs:61:5:
S^+

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_function_may_be_defined_by_its_graph
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
