*** crates/tla-syntax/src/lexer.rs:132:30: replace match guard self.at(1) == Some('*') with true in Lexer::skip_trivia

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace match guard self.at(1) == Some('*') with true in Lexer::skip_trivia
@@ -124,17 +124,17 @@
                 Some(c) if c.is_whitespace() => {
                     self.bump();
                 }
                 Some('\\') if self.at(1) == Some('*') => {
                     while !matches!(self.peek(), None | Some('\n')) {
                         self.bump();
                     }
                 }
-                Some('(') if self.at(1) == Some('*') => self.skip_block_comment()?,
+                Some('(') if true /* ~ changed by cargo-mutants ~ */ => self.skip_block_comment()?,
                 _ => return Ok(()),
             }
         }
     }
 
     fn skip_block_comment(&mut self) -> Result<()> {
         let (line, col) = (self.line, self.col);
         let mut depth = 0usize;

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4184083) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:17: unterminated (* comment
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (4184085) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:13: unterminated (* comment
in:

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (4184093) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:4: unterminated (* comment
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    higher_order_parameters_record_their_arity
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 16 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
