*** crates/tla-syntax/src/lexer.rs:132:30: replace match guard self.at(1) == Some('*') with false in Lexer::skip_trivia

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace match guard self.at(1) == Some('*') with false in Lexer::skip_trivia
@@ -124,17 +124,17 @@
                 Some(c) if c.is_whitespace() => {
                     self.bump();
                 }
                 Some('\\') if self.at(1) == Some('*') => {
                     while !matches!(self.peek(), None | Some('\n')) {
                         self.bump();
                     }
                 }
-                Some('(') if self.at(1) == Some('*') => self.skip_block_comment()?,
+                Some('(') if false /* ~ changed by cargo-mutants ~ */ => self.skip_block_comment()?,
                 _ => return Ok(()),
             }
         }
     }
 
     fn skip_block_comment(&mut self) -> Result<()> {
         let (line, col) = (self.line, self.col);
         let mut depth = 0usize;

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (358974) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 2:1: expected a declaration, found LParen

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (358980) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected a declaration, found LParen", line: 2, col: 1 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (358978) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected a declaration, found LParen", line: 2, col: 1 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
