*** crates/tla-syntax/src/lexer.rs:146:23: replace += with -= in Lexer::skip_block_comment

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with -= in Lexer::skip_block_comment
@@ -138,17 +138,17 @@
     fn skip_block_comment(&mut self) -> Result<()> {
         let (line, col) = (self.line, self.col);
         let mut depth = 0usize;
         loop {
             if self.peek().is_none() {
                 return Err(Error::lex("unterminated (* comment", line, col));
             }
             if self.starts_with("(*") {
-                depth += 1;
+                depth -= /* ~ changed by cargo-mutants ~ */ 1;
                 self.advance(2);
             } else if self.starts_with("*)") {
                 depth -= 1;
                 self.advance(2);
                 if depth == 0 {
                     return Ok(());
                 }
             } else {

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (362538) panicked at crates/tla-syntax/src/lexer.rs:146:17:
attempt to subtract with overflow

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (362540) panicked at crates/tla-syntax/src/lexer.rs:146:17:
attempt to subtract with overflow

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (362542) panicked at crates/tla-syntax/src/lexer.rs:146:17:
attempt to subtract with overflow

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
