*** crates/tla-syntax/src/lexer.rs:151:26: replace == with != in Lexer::skip_block_comment

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::skip_block_comment
@@ -143,17 +143,17 @@
                 return Err(Error::lex("unterminated (* comment", line, col));
             }
             if self.starts_with("(*") {
                 depth += 1;
                 self.advance(2);
             } else if self.starts_with("*)") {
                 depth -= 1;
                 self.advance(2);
-                if depth == 0 {
+                if depth != /* ~ changed by cargo-mutants ~ */ 0 {
                     return Ok(());
                 }
             } else {
                 self.bump();
             }
         }
     }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (365251) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: lex error at 2:1: unterminated (* comment

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (365257) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Lex, message: "unterminated (* comment", line: 2, col: 1 }

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (365249) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Lex, message: "unterminated (* comment", line: 2, col: 1 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
