*** crates/tla-syntax/src/lexer.rs:167:13: replace || with && in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace || with && in Lexer::scan
@@ -159,17 +159,17 @@
 
     fn scan(&mut self, c: char) -> Result<Tok> {
         if c.is_ascii_digit() {
             return self.scan_number();
         }
         // A lone `_` is the placeholder in `Op(_, _)`; followed by more, it is
         // an ordinary identifier, and `]_vars` is disambiguated by the parser.
         if c.is_ascii_alphabetic()
-            || (c == '_'
+            && /* ~ changed by cargo-mutants ~ */ (c == '_'
                 && self
                     .at(1)
                     .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (365911) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:6: unexpected character 'M'
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (365910) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:6: unexpected character 'M'
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (365912) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 1:6: unexpected character 'M'
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
