*** crates/tla-syntax/src/lexer.rs:170:64: replace || with && in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace || with && in Lexer::scan
@@ -162,17 +162,17 @@
             return self.scan_number();
         }
         // A lone `_` is the placeholder in `Op(_, _)`; followed by more, it is
         // an ordinary identifier, and `]_vars` is disambiguated by the parser.
         if c.is_ascii_alphabetic()
             || (c == '_'
                 && self
                     .at(1)
-                    .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
+                    .is_some_and(|n| n.is_ascii_alphanumeric() && /* ~ changed by cargo-mutants ~ */ n == '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),

---- a_name_may_begin_with_a_digit_or_an_underscore stdout ----

thread 'a_name_may_begin_with_a_digit_or_an_underscore' (4190776) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected a declaration, found Underscore
in:

failures:
    a_name_may_begin_with_a_digit_or_an_underscore

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
