*** crates/tla-syntax/src/lexer.rs:175:13: delete match arm '"' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '"' in Lexer::scan
@@ -167,17 +167,17 @@
             || (c == '_'
                 && self
                     .at(1)
                     .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
-            '"' => self.scan_string(),
+             /* ~ changed by cargo-mutants ~ */
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
             '>' => Ok(self.scan_gt()),
             '\\' => self.scan_backslash(),
             '/' => self.scan_slash(),
             '|' => {
                 if self.starts_with("|->") {

---- case_arms_are_separated_by_boxes stdout ----

thread 'case_arms_are_separated_by_boxes' (369339) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:25: unexpected character '"'
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (369348) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `CASE n = 1 -> "a" [] OTHER -> "b"`: lex error at 1:15: unexpected character '"'

failures:
    case_arms_are_separated_by_boxes
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
