*** crates/tla-syntax/src/lexer.rs:176:13: delete match arm '=' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '=' in Lexer::scan
@@ -168,17 +168,17 @@
                 && self
                     .at(1)
                     .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
-            '=' => self.scan_equals(),
+             /* ~ changed by cargo-mutants ~ */
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
             '>' => Ok(self.scan_gt()),
             '\\' => self.scan_backslash(),
             '/' => self.scan_slash(),
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4192040) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:3: unexpected character '='
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4192039) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: unexpected character '='
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (4192042) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:5: unexpected character '='
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
