*** crates/tla-syntax/src/lexer.rs:179:13: delete match arm '>' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '>' in Lexer::scan
@@ -171,17 +171,17 @@
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
-            '>' => Ok(self.scan_gt()),
+             /* ~ changed by cargo-mutants ~ */
             '\\' => self.scan_backslash(),
             '/' => self.scan_slash(),
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);
                     return Ok(Tok::MapsTo);
                 }
                 self.user_symbol()

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (372066) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:15: unexpected character '>'
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (372073) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 3:3: unexpected character '>'
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (372087) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `WF_<<a, b>>(Next)`: lex error at 1:10: unexpected character '>'

failures:
    a_fairness_subscript_may_be_a_tuple
    a_proof_is_skipped_and_the_module_continues
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
