*** crates/tla-syntax/src/lexer.rs:180:13: delete match arm '\\' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '\\' in Lexer::scan
@@ -172,17 +172,17 @@
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
             '>' => Ok(self.scan_gt()),
-            '\\' => self.scan_backslash(),
+             /* ~ changed by cargo-mutants ~ */
             '/' => self.scan_slash(),
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);
                     return Ok(Tok::MapsTo);
                 }
                 self.user_symbol()
                     .map_or_else(|| Err(self.err("stray `|`")), Ok)

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (372725) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:19: unexpected character '\\'
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (372727) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:5: unexpected character '\\'
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (372732) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:12: unexpected character '\\'
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_function_may_be_defined_by_its_graph
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
