*** crates/tla-syntax/src/lexer.rs:181:13: delete match arm '/' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '/' in Lexer::scan
@@ -173,17 +173,17 @@
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
             '>' => Ok(self.scan_gt()),
             '\\' => self.scan_backslash(),
-            '/' => self.scan_slash(),
+             /* ~ changed by cargo-mutants ~ */
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);
                     return Ok(Tok::MapsTo);
                 }
                 self.user_symbol()
                     .map_or_else(|| Err(self.err("stray `|`")), Ok)
             }

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (4194242) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 3:3: unexpected character '/'
in:

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (4194247) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:9: unexpected character '/'
in:

failures:
    an_operator_may_follow_a_bulleted_list
    labels_are_read_and_dropped

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
