*** crates/tla-syntax/src/lexer.rs:182:13: delete match arm '|' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '|' in Lexer::scan
@@ -174,24 +174,17 @@
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),
             '>' => Ok(self.scan_gt()),
             '\\' => self.scan_backslash(),
             '/' => self.scan_slash(),
-            '|' => {
-                if self.starts_with("|->") {
-                    self.advance(3);
-                    return Ok(Tok::MapsTo);
-                }
-                self.user_symbol()
-                    .map_or_else(|| Err(self.err("stray `|`")), Ok)
-            }
+             /* ~ changed by cargo-mutants ~ */
             ':' => {
                 if self.starts_with(":>") {
                     self.advance(2);
                     return Ok(Tok::Op(Op::OneTo));
                 }
                 if let Some(tok) = self.user_symbol() {
                     return Ok(tok);
                 }

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (860) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Lex, message: "unexpected character '|'", line: 10, col: 14 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (864) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Lex, message: "unexpected character '|'", line: 10, col: 14 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (863) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: lex error at 14:27: unexpected character '|'

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
