*** crates/tla-syntax/src/lexer.rs:190:13: delete match arm ':' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm ':' in Lexer::scan
@@ -182,31 +182,17 @@
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);
                     return Ok(Tok::MapsTo);
                 }
                 self.user_symbol()
                     .map_or_else(|| Err(self.err("stray `|`")), Ok)
             }
-            ':' => {
-                if self.starts_with(":>") {
-                    self.advance(2);
-                    return Ok(Tok::Op(Op::OneTo));
-                }
-                if let Some(tok) = self.user_symbol() {
-                    return Ok(tok);
-                }
-                if self.starts_with("::") {
-                    self.advance(2);
-                    return Ok(Tok::ColonColon);
-                }
-                self.bump();
-                Ok(Tok::Colon)
-            }
+             /* ~ changed by cargo-mutants ~ */
             '@' => {
                 if self.starts_with("@@") {
                     self.advance(2);
                     Ok(Tok::Op(Op::AtAt))
                 } else {
                     self.bump();
                     Ok(Tok::At)
                 }

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (374731) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:25: unexpected character ':'
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (374734) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:26: unexpected character ':'
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (374740) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:27: unexpected character ':'
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_action_subscript_is_recognised_past_an_inner_colon
    labels_are_read_and_dropped
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 16 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
