*** crates/tla-syntax/src/lexer.rs:205:13: delete match arm '@' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '@' in Lexer::scan
@@ -197,25 +197,17 @@
                 }
                 if self.starts_with("::") {
                     self.advance(2);
                     return Ok(Tok::ColonColon);
                 }
                 self.bump();
                 Ok(Tok::Colon)
             }
-            '@' => {
-                if self.starts_with("@@") {
-                    self.advance(2);
-                    Ok(Tok::Op(Op::AtAt))
-                } else {
-                    self.bump();
-                    Ok(Tok::At)
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             '~' => {
                 if self.starts_with("~>") {
                     self.advance(2);
                     Ok(Tok::Op(Op::LeadsTo))
                 } else {
                     self.bump();
                     Ok(Tok::Op(Op::Not))
                 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (1801) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: lex error at 19:35: unexpected character '@'

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1807) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Lex, message: "unexpected character '@'", line: 19, col: 35 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
