*** crates/tla-syntax/src/lexer.rs:214:13: delete match arm '~' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '~' in Lexer::scan
@@ -206,25 +206,17 @@
                 if self.starts_with("@@") {
                     self.advance(2);
                     Ok(Tok::Op(Op::AtAt))
                 } else {
                     self.bump();
                     Ok(Tok::At)
                 }
             }
-            '~' => {
-                if self.starts_with("~>") {
-                    self.advance(2);
-                    Ok(Tok::Op(Op::LeadsTo))
-                } else {
-                    self.bump();
-                    Ok(Tok::Op(Op::Not))
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' => self
                 .user_symbol()
                 .map_or_else(|| self.scan_punctuation(c), Ok),
             '.' => {
                 if self.starts_with("..") {
                     self.advance(2);
                     Ok(Tok::Op(Op::DotDot))
                 } else {

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (836209) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Lex, message: "unexpected character '~'", line: 49, col: 6 }

---- module_name_and_extends stdout ----

thread 'module_name_and_extends' (836214) panicked at crates/tla-syntax/tests/parse_specs.rs:39:49:
parses: Error { stage: Lex, message: "unexpected character '~'", line: 49, col: 6 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (836213) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Lex, message: "unexpected character '~'", line: 49, col: 6 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
