*** crates/tla-syntax/src/lexer.rs:223:13: delete match arm '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' in Lexer::scan
@@ -215,19 +215,17 @@
                 if self.starts_with("~>") {
                     self.advance(2);
                     Ok(Tok::Op(Op::LeadsTo))
                 } else {
                     self.bump();
                     Ok(Tok::Op(Op::Not))
                 }
             }
-            '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' => self
-                .user_symbol()
-                .map_or_else(|| self.scan_punctuation(c), Ok),
+             /* ~ changed by cargo-mutants ~ */
             '.' => {
                 if self.starts_with("..") {
                     self.advance(2);
                     Ok(Tok::Op(Op::DotDot))
                 } else {
                     self.bump();
                     Ok(Tok::Dot)
                 }

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (837501) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:10: expected an expression, found Op(Plus)
in:

---- prefix_and_postfix_operators_can_be_defined stdout ----

thread 'prefix_and_postfix_operators_can_be_defined' (837520) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:4: expected an identifier, found Op(Plus)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (837537) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `S^+ \cup T`: parse error at 1:3: expected an expression, found Op(Plus)

failures:
    a_postfix_operator_binds_to_what_precedes_it
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
