*** crates/tla-syntax/src/lexer.rs:226:13: delete match arm '.' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '.' in Lexer::scan
@@ -218,25 +218,17 @@
                 } else {
                     self.bump();
                     Ok(Tok::Op(Op::Not))
                 }
             }
             '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' => self
                 .user_symbol()
                 .map_or_else(|| self.scan_punctuation(c), Ok),
-            '.' => {
-                if self.starts_with("..") {
-                    self.advance(2);
-                    Ok(Tok::Op(Op::DotDot))
-                } else {
-                    self.bump();
-                    Ok(Tok::Dot)
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             '[' => {
                 if self.starts_with("[]") {
                     self.advance(2);
                     Ok(Tok::Op(Op::Always))
                 } else {
                     self.bump();
                     Ok(Tok::LBrack)
                 }

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (3506) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 3:5: unexpected character '.'
in:

---- prefix_and_postfix_operators_can_be_defined stdout ----

thread 'prefix_and_postfix_operators_can_be_defined' (3516) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:2: unexpected character '.'
in:

failures:
    a_proof_is_skipped_and_the_module_continues
    prefix_and_postfix_operators_can_be_defined

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
