*** crates/tla-syntax/src/lexer.rs:235:13: delete match arm '[' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '[' in Lexer::scan
@@ -227,25 +227,17 @@
                 if self.starts_with("..") {
                     self.advance(2);
                     Ok(Tok::Op(Op::DotDot))
                 } else {
                     self.bump();
                     Ok(Tok::Dot)
                 }
             }
-            '[' => {
-                if self.starts_with("[]") {
-                    self.advance(2);
-                    Ok(Tok::Op(Op::Always))
-                } else {
-                    self.bump();
-                    Ok(Tok::LBrack)
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => self.scan_punctuation(c),
         }
     }
 
     fn scan_punctuation(&mut self, c: char) -> Result<Tok> {
         let at = (self.line, self.col);
         self.bump();
         Ok(match c {

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (378144) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:2: unexpected character '['
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (378148) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:28: unexpected character '['
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (378150) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:28: unexpected character '['
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    case_arms_are_separated_by_boxes
    except_accepts_several_indices_at_once
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
