*** crates/tla-syntax/src/lexer.rs:23:5: replace module_start -> (usize, u32) with (0, 0)

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace module_start -> (usize, u32) with (0, 0)
@@ -15,30 +15,17 @@
 
 /// Where the module actually begins.
 ///
 /// A `.tla` file is a module surrounded by prose: an explanation above the
 /// header, notes and shell transcripts below the terminator. That text is not
 /// TLA+ and must not be lexed as it — plenty of it contains `$`, `&` and `/`,
 /// which are not characters the language allows loose.
 fn module_start(src: &str) -> (usize, u32) {
-    let mut offset = 0;
-    for (index, text) in src.split_inclusive('\n').enumerate() {
-        let trimmed = text.trim_start();
-        if trimmed.starts_with("----")
-            && trimmed
-                .trim_start_matches('-')
-                .trim_start()
-                .starts_with("MODULE")
-        {
-            return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
-        }
-        offset += text.len();
-    }
-    (0, 1)
+    (0, 0) /* ~ changed by cargo-mutants ~ */
 }
 
 impl Lexer {
     fn new(src: &str) -> Self {
         let (offset, line) = module_start(src);
         Self {
             chars: src[offset..].chars().collect(),
             pos: 0,

---- prose_outside_the_module_is_not_lexed stdout ----

thread 'prose_outside_the_module_is_not_lexed' (783568) panicked at crates/tla-syntax/tests/grammar.rs:39:31:
the prose is ignored: Error { stage: Lex, message: "unexpected character ';'", line: 0, col: 26 }

failures:
    prose_outside_the_module_is_not_lexed

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
