*** crates/tla-syntax/src/lexer.rs:23:5: replace module_start -> (usize, u32) with (1, 1)

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace module_start -> (usize, u32) with (1, 1)
@@ -15,30 +15,17 @@
 
 /// Where the module actually begins.
 ///
 /// A `.tla` file is a module surrounded by prose: an explanation above the
 /// header, notes and shell transcripts below the terminator. That text is not
 /// TLA+ and must not be lexed as it — plenty of it contains `$`, `&` and `/`,
 /// which are not characters the language allows loose.
 fn module_start(src: &str) -> (usize, u32) {
-    let mut offset = 0;
-    for (index, text) in src.split_inclusive('\n').enumerate() {
-        let trimmed = text.trim_start();
-        if trimmed.starts_with("----")
-            && trimmed
-                .trim_start_matches('-')
-                .trim_start()
-                .starts_with("MODULE")
-        {
-            return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
-        }
-        offset += text.len();
-    }
-    (0, 1)
+    (1, 1) /* ~ changed by cargo-mutants ~ */
 }
 
 impl Lexer {
     fn new(src: &str) -> Self {
         let (offset, line) = module_start(src);
         Self {
             chars: src[offset..].chars().collect(),
             pos: 0,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4166465) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (4166469) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4166467) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 1 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
