*** crates/tla-syntax/src/lexer.rs:252:13: delete match arm '(' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '(' in Lexer::scan_punctuation
@@ -244,17 +244,17 @@
             _ => self.scan_punctuation(c),
         }
     }
 
     fn scan_punctuation(&mut self, c: char) -> Result<Tok> {
         let at = (self.line, self.col);
         self.bump();
         Ok(match c {
-            '(' => Tok::LParen,
+             /* ~ changed by cargo-mutants ~ */
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4474) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:17: unexpected character '('
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (4476) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:13: unexpected character '('
in:

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (4484) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:4: unexpected character '('
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    higher_order_parameters_record_their_arity
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 16 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
