*** crates/tla-syntax/src/lexer.rs:254:13: delete match arm ']' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm ']' in Lexer::scan_punctuation
@@ -246,17 +246,17 @@
     }
 
     fn scan_punctuation(&mut self, c: char) -> Result<Tok> {
         let at = (self.line, self.col);
         self.bump();
         Ok(match c {
             '(' => Tok::LParen,
             ')' => Tok::RParen,
-            ']' => Tok::RBrack,
+             /* ~ changed by cargo-mutants ~ */
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (380236) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:10: unexpected character ']'
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (380243) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:32: unexpected character ']'
in:

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (380248) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:24: unexpected character ']'
in:

failures:
    a_function_may_be_defined_by_its_graph
    an_action_subscript_is_recognised_past_an_inner_colon
    except_accepts_several_indices_at_once
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
