*** crates/tla-syntax/src/lexer.rs:255:13: delete match arm '{' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '{' in Lexer::scan_punctuation
@@ -247,17 +247,17 @@
 
     fn scan_punctuation(&mut self, c: char) -> Result<Tok> {
         let at = (self.line, self.col);
         self.bump();
         Ok(match c {
             '(' => Tok::LParen,
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
-            '{' => Tok::LBrace,
+             /* ~ changed by cargo-mutants ~ */
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (841180) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:9: unexpected character '{'
in:

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (841212) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: unexpected character '{'
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (841215) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `{CHOOSE x \in S : TRUE}`: lex error at 1:1: unexpected character '{'

failures:
    a_choose_inside_braces_is_not_a_set_filter
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
