*** crates/tla-syntax/src/lexer.rs:257:13: delete match arm ',' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm ',' in Lexer::scan_punctuation
@@ -249,17 +249,17 @@
         let at = (self.line, self.col);
         self.bump();
         Ok(match c {
             '(' => Tok::LParen,
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
-            ',' => Tok::Comma,
+             /* ~ changed by cargo-mutants ~ */
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (6565) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:12: unexpected character ','
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (6567) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:22: unexpected character ','
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (6572) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 4:12: unexpected character ','
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_proof_is_skipped_and_the_module_continues
    an_operator_may_be_passed_as_an_argument
    except_accepts_several_indices_at_once
    higher_order_parameters_record_their_arity
    the_new_forms_round_trip

test result: FAILED. 16 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
