*** crates/tla-syntax/src/lexer.rs:258:13: delete match arm '!' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '!' in Lexer::scan_punctuation
@@ -250,17 +250,17 @@
         self.bump();
         Ok(match c {
             '(' => Tok::LParen,
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
-            '!' => Tok::Bang,
+             /* ~ changed by cargo-mutants ~ */
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),
             _ => {

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (383533) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:18: unexpected character '!'
in:

---- instance_names_may_be_chained_and_take_arguments stdout ----

thread 'instance_names_may_be_chained_and_take_arguments' (383535) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:7: unexpected character '!'
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (383541) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: lex error at 1:11: unexpected character '!'

failures:
    except_accepts_several_indices_at_once
    instance_names_may_be_chained_and_take_arguments
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
