*** crates/tla-syntax/src/lexer.rs:260:13: delete match arm '_' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '_' in Lexer::scan_punctuation
@@ -252,17 +252,17 @@
             '(' => Tok::LParen,
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
-            '_' => Tok::Underscore,
+             /* ~ changed by cargo-mutants ~ */
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),
             _ => {
                 return Err(Error::lex(
                     format!("unexpected character {c:?}"),

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (8642) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:9: unexpected character '_'
in:

failures:
    higher_order_parameters_record_their_arity

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
