*** crates/tla-syntax/src/lexer.rs:262:13: delete match arm '+' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '+' in Lexer::scan_punctuation
@@ -254,17 +254,17 @@
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
-            '+' => Tok::Op(Op::Plus),
+             /* ~ changed by cargo-mutants ~ */
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),
             _ => {
                 return Err(Error::lex(
                     format!("unexpected character {c:?}"),
                     at.0,
                     at.1,

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (8811) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:30: unexpected character '+'
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (8810) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:17: unexpected character '+'
in:

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (8819) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:19: unexpected character '+'
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
