*** crates/tla-syntax/src/lexer.rs:263:13: delete match arm '*' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '*' in Lexer::scan_punctuation
@@ -255,17 +255,17 @@
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
-            '*' => Tok::Op(Op::Times),
+             /* ~ changed by cargo-mutants ~ */
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),
             _ => {
                 return Err(Error::lex(
                     format!("unexpected character {c:?}"),
                     at.0,
                     at.1,
                 ));

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (386246) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: lex error at 10:18: unexpected character '*'

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (386252) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Lex, message: "unexpected character '*'", line: 10, col: 18 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
