*** crates/tla-syntax/src/lexer.rs:264:13: delete match arm '%' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '%' in Lexer::scan_punctuation
@@ -256,17 +256,17 @@
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
-            '%' => Tok::Op(Op::Mod),
+             /* ~ changed by cargo-mutants ~ */
             '^' => Tok::Op(Op::Pow),
             _ => {
                 return Err(Error::lex(
                     format!("unexpected character {c:?}"),
                     at.0,
                     at.1,
                 ));
             }

*** result: Success
