*** crates/tla-syntax/src/lexer.rs:265:13: delete match arm '^' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '^' in Lexer::scan_punctuation
@@ -257,17 +257,17 @@
             ',' => Tok::Comma,
             '!' => Tok::Bang,
             '\'' => Tok::Prime,
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
-            '^' => Tok::Op(Op::Pow),
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 return Err(Error::lex(
                     format!("unexpected character {c:?}"),
                     at.0,
                     at.1,
                 ));
             }
         })

*** result: Success
