*** crates/tla-syntax/src/lexer.rs:279:9: replace Lexer::user_symbol -> Option<Tok> with None

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::user_symbol -> Option<Tok> with None
@@ -271,28 +271,17 @@
                 ));
             }
         })
     }
 
     /// The longest symbol from the language's user-definable operator table
     /// that starts here. The named `\`-operators are matched elsewhere.
     fn user_symbol(&mut self) -> Option<Tok> {
-        let mut best: Option<&'static str> = None;
-        for (symbol, _) in token::USER_OPERATORS {
-            if symbol.starts_with('\\') || !self.starts_with(symbol) {
-                continue;
-            }
-            if best.is_none_or(|found| symbol.len() > found.len()) {
-                best = Some(symbol);
-            }
-        }
-        let symbol = best?;
-        self.advance(symbol.chars().count());
-        Some(Tok::Op(Op::User(symbol)))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn scan_number(&mut self) -> Result<Tok> {
         let start = self.pos;
         while self.peek().is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
         }
         // `1aMessage` is a name, not a number followed by one: TLA+ only asks

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (849358) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:10: expected an expression, found Op(Plus)
in:

---- prefix_and_postfix_operators_can_be_defined stdout ----

thread 'prefix_and_postfix_operators_can_be_defined' (849372) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:4: expected an identifier, found Op(Plus)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (849377) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `S^+ \cup T`: parse error at 1:3: expected an expression, found Op(Plus)

failures:
    a_postfix_operator_binds_to_what_precedes_it
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
