*** crates/tla-syntax/src/lexer.rs:281:44: delete ! in Lexer::user_symbol

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete ! in Lexer::user_symbol
@@ -273,17 +273,17 @@
         })
     }
 
     /// The longest symbol from the language's user-definable operator table
     /// that starts here. The named `\`-operators are matched elsewhere.
     fn user_symbol(&mut self) -> Option<Tok> {
         let mut best: Option<&'static str> = None;
         for (symbol, _) in token::USER_OPERATORS {
-            if symbol.starts_with('\\') || !self.starts_with(symbol) {
+            if symbol.starts_with('\\') ||  /* ~ changed by cargo-mutants ~ */self.starts_with(symbol) {
                 continue;
             }
             if best.is_none_or(|found| symbol.len() > found.len()) {
                 best = Some(symbol);
             }
         }
         let symbol = best?;
         self.advance(symbol.chars().count());

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (389797) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected an expression, found ModuleEnd
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (389795) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:31: expected Colon, found RBrace
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (389796) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: expected LParen, found Op(User("(\\X)"))
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_be_passed_as_an_argument
    except_accepts_several_indices_at_once
    higher_order_parameters_record_their_arity
    instance_names_may_be_chained_and_take_arguments
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined

test result: FAILED. 8 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
