*** crates/tla-syntax/src/lexer.rs:284:53: replace > with < in Lexer::user_symbol

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace > with < in Lexer::user_symbol
@@ -276,17 +276,17 @@
     /// The longest symbol from the language's user-definable operator table
     /// that starts here. The named `\`-operators are matched elsewhere.
     fn user_symbol(&mut self) -> Option<Tok> {
         let mut best: Option<&'static str> = None;
         for (symbol, _) in token::USER_OPERATORS {
             if symbol.starts_with('\\') || !self.starts_with(symbol) {
                 continue;
             }
-            if best.is_none_or(|found| symbol.len() > found.len()) {
+            if best.is_none_or(|found| symbol.len() < /* ~ changed by cargo-mutants ~ */ found.len()) {
                 best = Some(symbol);
             }
         }
         let symbol = best?;
         self.advance(symbol.chars().count());
         Some(Tok::Op(Op::User(symbol)))
     }

*** result: Success
