*** crates/tla-syntax/src/lexer.rs:302:54: replace || with && in Lexer::scan_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace || with && in Lexer::scan_number
@@ -294,17 +294,17 @@
         let start = self.pos;
         while self.peek().is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
         }
         // `1aMessage` is a name, not a number followed by one: TLA+ only asks
         // that an identifier contain a letter, not that it begin with one.
         if self
             .peek()
-            .is_some_and(|c| c.is_ascii_alphabetic() || c == '_')
+            .is_some_and(|c| c.is_ascii_alphabetic() && /* ~ changed by cargo-mutants ~ */ c == '_')
         {
             self.pos = start;
             return Ok(self.scan_word());
         }
         let text: String = self.chars[start..self.pos].iter().collect();
         text.parse()
             .map(Tok::Num)
             .map_err(|_| self.err(format!("integer literal out of range: {text}")))

---- a_name_may_begin_with_a_digit_or_an_underscore stdout ----

thread 'a_name_may_begin_with_a_digit_or_an_underscore' (853810) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:1: expected a declaration, found Num(1)
in:

failures:
    a_name_may_begin_with_a_digit_or_an_underscore

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
