*** crates/tla-syntax/src/lexer.rs:307:9: replace Lexer::scan_based_number -> Result<Option<Tok>> with Ok(None)

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::scan_based_number -> Result<Option<Tok>> with Ok(None)
@@ -299,34 +299,17 @@
         self.advance(symbol.chars().count());
         Some(Tok::Op(Op::User(symbol)))
     }
 
     /// `\b1011`, `\o777`, `\h1F` — a number written in another base. The
     /// digits must follow the letter directly, which is what keeps `\o` as
     /// concatenation everywhere else.
     fn scan_based_number(&mut self) -> Result<Option<Tok>> {
-        let (radix, digits) = match self.at(1) {
-            Some('b' | 'B') => (2u32, "01"),
-            Some('o' | 'O') => (8, "01234567"),
-            Some('h' | 'H') => (16, "0123456789abcdefABCDEF"),
-            _ => return Ok(None),
-        };
-        let mut end = self.pos + 2;
-        while self.chars.get(end).is_some_and(|c| digits.contains(*c)) {
-            end += 1;
-        }
-        if end == self.pos + 2 {
-            return Ok(None);
-        }
-        let text: String = self.chars[self.pos + 2..end].iter().collect();
-        let value = i64::from_str_radix(&text, radix)
-            .map_err(|_| self.err(format!("number out of range: {text}")))?;
-        self.advance(2 + text.chars().count());
-        Ok(Some(Tok::Num(value)))
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn scan_number(&mut self) -> Result<Tok> {
         let start = self.pos;
         while self.peek().is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
         }
         // `1aMessage` is a name, not a number followed by one: TLA+ only asks

---- numbers_may_be_written_in_another_base stdout ----

thread 'numbers_may_be_written_in_another_base' (1215395) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: unknown operator `\b`
in:

failures:
    numbers_may_be_written_in_another_base

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
