*** crates/tla-syntax/src/lexer.rs:32:70: replace + with - in module_start

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace + with - in module_start
@@ -24,17 +24,17 @@
     for (index, text) in src.split_inclusive('\n').enumerate() {
         let trimmed = text.trim_start();
         if trimmed.starts_with("----")
             && trimmed
                 .trim_start_matches('-')
                 .trim_start()
                 .starts_with("MODULE")
         {
-            return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
+            return (offset, u32::try_from(index).unwrap_or(u32::MAX) - /* ~ changed by cargo-mutants ~ */ 1);
         }
         offset += text.len();
     }
     (0, 1)
 }
 
 impl Lexer {
     fn new(src: &str) -> Self {

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (787688) panicked at crates/tla-syntax/src/lexer.rs:32:29:
attempt to subtract with overflow

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (787685) panicked at crates/tla-syntax/src/lexer.rs:32:29:
attempt to subtract with overflow

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (787686) panicked at crates/tla-syntax/src/lexer.rs:32:29:
attempt to subtract with overflow

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 2 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
