*** crates/tla-syntax/src/lexer.rs:34:16: replace += with -= in module_start

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with -= in module_start
@@ -26,17 +26,17 @@
         if trimmed.starts_with("----")
             && trimmed
                 .trim_start_matches('-')
                 .trim_start()
                 .starts_with("MODULE")
         {
             return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
         }
-        offset += text.len();
+        offset -= /* ~ changed by cargo-mutants ~ */ text.len();
     }
     (0, 1)
 }
 
 impl Lexer {
     fn new(src: &str) -> Self {
         let (offset, line) = module_start(src);
         Self {

---- prose_outside_the_module_is_not_lexed stdout ----

thread 'prose_outside_the_module_is_not_lexed' (788287) panicked at crates/tla-syntax/src/lexer.rs:34:9:
attempt to subtract with overflow

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (788290) panicked at crates/tla-syntax/src/lexer.rs:34:9:
attempt to subtract with overflow

failures:
    prose_outside_the_module_is_not_lexed
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
