*** crates/tla-syntax/src/lexer.rs:365:16: replace >= with < in Lexer::scan_equals

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace >= with < in Lexer::scan_equals
@@ -357,17 +357,17 @@
                 }
                 Some(c) => s.push(c),
             }
         }
     }
 
     fn scan_equals(&mut self) -> Result<Tok> {
         let run = self.run_of('=');
-        if run >= 4 {
+        if run < /* ~ changed by cargo-mutants ~ */ 4 {
             self.advance(run);
             return Ok(Tok::ModuleEnd);
         }
         if run == 2 {
             self.advance(2);
             return Ok(Tok::DefEq);
         }
         if run == 1 {

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (15435) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:6: expected DefEq, found ModuleEnd
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (15436) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:3: expected DefEq, found ModuleEnd
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (15438) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:5: expected DefEq, found ModuleEnd
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list

test result: FAILED. 1 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
