*** crates/tla-syntax/src/lexer.rs:373:16: replace == with != in Lexer::scan_equals

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::scan_equals
@@ -365,17 +365,17 @@
         if run >= 4 {
             self.advance(run);
             return Ok(Tok::ModuleEnd);
         }
         if run == 2 {
             self.advance(2);
             return Ok(Tok::DefEq);
         }
-        if run == 1 {
+        if run != /* ~ changed by cargo-mutants ~ */ 1 {
             return Ok(match self.at(1) {
                 Some('>') => {
                     self.advance(2);
                     Tok::Op(Op::Implies)
                 }
                 Some('<') => {
                     self.advance(2);
                     Tok::Op(Op::Le)

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (396471) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:25: `===` is neither a definition nor a module terminator
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (396473) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:25: `===` is neither a definition nor a module terminator
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (396474) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:34: `===` is neither a definition nor a module terminator
in:

failures:
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    except_accepts_several_indices_at_once
    labels_are_read_and_dropped
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
