*** crates/tla-syntax/src/lexer.rs:375:17: delete match arm Some('>') in Lexer::scan_equals

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm Some('>') in Lexer::scan_equals
@@ -367,20 +367,17 @@
             return Ok(Tok::ModuleEnd);
         }
         if run == 2 {
             self.advance(2);
             return Ok(Tok::DefEq);
         }
         if run == 1 {
             return Ok(match self.at(1) {
-                Some('>') => {
-                    self.advance(2);
-                    Tok::Op(Op::Implies)
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Some('<') => {
                     self.advance(2);
                     Tok::Op(Op::Le)
                 }
                 _ => {
                     self.bump();
                     Tok::Op(Op::Eq)
                 }

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (16696) panicked at crates/tla-syntax/tests/grammar.rs:189:5:
assertion failed: m.units.iter().any(|u| matches!(u, Unit::Theorem(_)))

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (16702) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 5:4: expected an expression, found Op(Gt)
in:

failures:
    a_named_theorem_keeps_its_statement
    an_operator_may_follow_a_bulleted_list

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
