*** crates/tla-syntax/src/lexer.rs:400:16: replace >= with < in Lexer::scan_dashes

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace >= with < in Lexer::scan_dashes
@@ -392,17 +392,17 @@
     /// A run of four or more dashes is a separator, so the operators spelled
     /// with dashes have to be recognised around it rather than before it.
     fn scan_dashes(&mut self) -> Tok {
         if self.starts_with("-+->") {
             self.advance(4);
             return Tok::Op(Op::User("-+->"));
         }
         let run = self.run_of('-');
-        if run >= 4 {
+        if run < /* ~ changed by cargo-mutants ~ */ 4 {
             self.advance(run);
             return Tok::Separator;
         }
         for (text, tok) in [("->", Tok::Arrow), ("-|", Tok::Op(Op::User("-|")))] {
             if self.starts_with(text) {
                 self.advance(2);
                 return tok;
             }

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (17557) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:15: expected Separator, found Op(Minus)
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (17559) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:15: expected Separator, found Op(Minus)
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (17558) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:15: expected Separator, found Op(Minus)
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
