*** crates/tla-syntax/src/lexer.rs:463:17: replace += with -= in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with -= in Lexer::scan_backslash
@@ -455,17 +455,17 @@
     fn scan_backslash(&mut self) -> Result<Tok> {
         if self.starts_with("\\/") {
             self.advance(2);
             return Ok(Tok::Op(Op::Or));
         }
         let start = self.pos + 1;
         let mut end = start;
         while self.chars.get(end).is_some_and(char::is_ascii_alphabetic) {
-            end += 1;
+            end -= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if end == start {
             self.bump();
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (400694) panicked at crates/tla-syntax/src/lexer.rs:469:38:
slice index starts at 38 but ends at 37

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (400696) panicked at crates/tla-syntax/src/lexer.rs:469:38:
slice index starts at 24 but ends at 23

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (400701) panicked at crates/tla-syntax/src/lexer.rs:469:38:
slice index starts at 31 but ends at 30

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_function_may_be_defined_by_its_graph
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
