*** crates/tla-syntax/src/lexer.rs:463:17: replace += with *= in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with *= in Lexer::scan_backslash
@@ -455,17 +455,17 @@
     fn scan_backslash(&mut self) -> Result<Tok> {
         if self.starts_with("\\/") {
             self.advance(2);
             return Ok(Tok::Op(Op::Or));
         }
         let start = self.pos + 1;
         let mut end = start;
         while self.chars.get(end).is_some_and(char::is_ascii_alphabetic) {
-            end += 1;
+            end *= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if end == start {
             self.bump();
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,

*** result: Timeout
