*** crates/tla-syntax/src/lexer.rs:471:13: delete match arm "in" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "in" in Lexer::scan_backslash
@@ -463,17 +463,17 @@
             end += 1;
         }
         if end == start {
             self.bump();
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
-            "in" => Op::In,
+             /* ~ changed by cargo-mutants ~ */
             "notin" => Op::NotIn,
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (402681) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:19: unknown operator `\in`
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (402683) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:5: unknown operator `\in`
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (402690) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:18: unknown operator `\in`
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_function_may_be_defined_by_its_graph
    an_action_subscript_is_recognised_past_an_inner_colon
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
