*** crates/tla-syntax/src/lexer.rs:472:13: delete match arm "notin" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "notin" in Lexer::scan_backslash
@@ -464,17 +464,17 @@
         }
         if end == start {
             self.bump();
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,
-            "notin" => Op::NotIn,
+             /* ~ changed by cargo-mutants ~ */
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,

*** result: Success
