*** crates/tla-syntax/src/lexer.rs:476:13: delete match arm "cap" | "intersect" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "cap" | "intersect" in Lexer::scan_backslash
@@ -468,17 +468,17 @@
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,
             "notin" => Op::NotIn,
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
-            "cap" | "intersect" => Op::Cap,
+             /* ~ changed by cargo-mutants ~ */
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,

*** result: Success
