*** crates/tla-syntax/src/lexer.rs:477:13: delete match arm "times" | "X" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "times" | "X" in Lexer::scan_backslash
@@ -469,17 +469,17 @@
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,
             "notin" => Op::NotIn,
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
-            "times" | "X" => Op::Cartesian,
+             /* ~ changed by cargo-mutants ~ */
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,

*** result: Success
