*** crates/tla-syntax/src/lexer.rs:478:13: delete match arm "div" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "div" in Lexer::scan_backslash
@@ -470,17 +470,17 @@
         let op = match name.as_str() {
             "in" => Op::In,
             "notin" => Op::NotIn,
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
-            "div" => Op::Div,
+             /* ~ changed by cargo-mutants ~ */
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,

*** result: Success
