*** crates/tla-syntax/src/lexer.rs:482:13: delete match arm "land" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "land" in Lexer::scan_backslash
@@ -474,17 +474,17 @@
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
-            "land" => Op::And,
+             /* ~ changed by cargo-mutants ~ */
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,
             "A" | "forall" => Op::Forall,
             "E" | "exists" => Op::Exists,
             "AA" => Op::TemporalForall,
             "EE" => Op::TemporalExists,

*** result: Success
