*** crates/tla-syntax/src/lexer.rs:486:13: delete match arm "neq" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "neq" in Lexer::scan_backslash
@@ -478,17 +478,17 @@
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
-            "neq" => Op::Neq,
+             /* ~ changed by cargo-mutants ~ */
             "A" | "forall" => Op::Forall,
             "E" | "exists" => Op::Exists,
             "AA" => Op::TemporalForall,
             "EE" => Op::TemporalExists,
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),
             },

*** result: Success
