*** crates/tla-syntax/src/lexer.rs:488:13: delete match arm "E" | "exists" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "E" | "exists" in Lexer::scan_backslash
@@ -480,17 +480,17 @@
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,
             "A" | "forall" => Op::Forall,
-            "E" | "exists" => Op::Exists,
+             /* ~ changed by cargo-mutants ~ */
             "AA" => Op::TemporalForall,
             "EE" => Op::TemporalExists,
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),
             },
         };
         self.advance(1 + name.len());

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (415627) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: lex error at 21:9: unknown operator `\E`

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (415625) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Lex, message: "unknown operator `\\E`", line: 40, col: 3 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (415629) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Lex, message: "unknown operator `\\E`", line: 40, col: 3 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
