*** crates/tla-syntax/src/lexer.rs:489:13: delete match arm "AA" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "AA" in Lexer::scan_backslash
@@ -481,17 +481,17 @@
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,
             "A" | "forall" => Op::Forall,
             "E" | "exists" => Op::Exists,
-            "AA" => Op::TemporalForall,
+             /* ~ changed by cargo-mutants ~ */
             "EE" => Op::TemporalExists,
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),
             },
         };
         self.advance(1 + name.len());
         Ok(Tok::Op(op))

*** result: Success
