*** crates/tla-syntax/src/lexer.rs:490:13: delete match arm "geq" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "geq" in Lexer::scan_backslash
@@ -482,17 +482,17 @@
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
-            "geq" => Op::Ge,
+             /* ~ changed by cargo-mutants ~ */
             "neq" => Op::Neq,
             "A" | "forall" => Op::Forall,
             "E" | "exists" => Op::Exists,
             "AA" => Op::TemporalForall,
             "EE" => Op::TemporalExists,
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),

*** result: Success
