*** crates/tla-syntax/src/lexer.rs:495:13: delete match arm "EE" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "EE" in Lexer::scan_backslash
@@ -487,17 +487,17 @@
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,
             "A" | "forall" => Op::Forall,
             "E" | "exists" => Op::Exists,
             "AA" => Op::TemporalForall,
-            "EE" => Op::TemporalExists,
+             /* ~ changed by cargo-mutants ~ */
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),
             },
         };
         self.advance(1 + name.len());
         Ok(Tok::Op(op))
     }

---- temporal_quantifiers_parse_and_are_marked_as_such stdout ----

thread 'temporal_quantifiers_parse_and_are_marked_as_such' (880586) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:11: unknown operator `\EE`
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (880588) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `\EE t : Timer(t)`: lex error at 1:1: unknown operator `\EE`

failures:
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
