*** crates/tla-syntax/src/lexer.rs:52:9: replace Lexer::peek -> Option<char> with None

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::peek -> Option<char> with None
@@ -44,17 +44,17 @@
             pos: 0,
             line,
             col: 1,
             out: Vec::new(),
         }
     }
 
     fn peek(&self) -> Option<char> {
-        self.chars.get(self.pos).copied()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn at(&self, offset: usize) -> Option<char> {
         self.chars.get(self.pos + offset).copied()
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (789739) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:1: no `---- MODULE ----` header found
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (789740) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:1: no `---- MODULE ----` header found
in:

---- a_module_may_contain_another stdout ----

thread 'a_module_may_contain_another' (789742) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:1: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
