*** crates/tla-syntax/src/lexer.rs:56:33: replace + with * in Lexer::at

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace + with * in Lexer::at
@@ -48,17 +48,17 @@
         }
     }
 
     fn peek(&self) -> Option<char> {
         self.chars.get(self.pos).copied()
     }
 
     fn at(&self, offset: usize) -> Option<char> {
-        self.chars.get(self.pos + offset).copied()
+        self.chars.get(self.pos * /* ~ changed by cargo-mutants ~ */ offset).copied()
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;
         self.pos += 1;
         if c == '\n' {
             self.line += 1;
             self.col = 1;

*** result: Timeout
