*** crates/tla-syntax/src/lexer.rs:56:9: replace Lexer::at -> Option<char> with None

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::at -> Option<char> with None
@@ -48,17 +48,17 @@
         }
     }
 
     fn peek(&self) -> Option<char> {
         self.chars.get(self.pos).copied()
     }
 
     fn at(&self, offset: usize) -> Option<char> {
-        self.chars.get(self.pos + offset).copied()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;
         self.pos += 1;
         if c == '\n' {
             self.line += 1;
             self.col = 1;

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (335060) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: `===` is neither a definition nor a module terminator
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (335063) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:5: `===` is neither a definition nor a module terminator
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (335061) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:3: `===` is neither a definition nor a module terminator
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
