*** crates/tla-syntax/src/lexer.rs:5:5: replace lex -> Result<Vec<Token>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace lex -> Result<Vec<Token>> with Ok(vec![])
@@ -1,13 +1,13 @@
 use crate::error::{Error, Result};
 use crate::token::{self, Kw, Op, Tok, Token};
 
 pub fn lex(src: &str) -> Result<Vec<Token>> {
-    Lexer::new(src).run()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 struct Lexer {
     chars: Vec<char>,
     pos: usize,
     line: u32,
     col: u32,
     out: Vec<Token>,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (783086) panicked at crates/tla-syntax/src/parser.rs:68:19:
index out of bounds: the len is 0 but the index is 0

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (783088) panicked at crates/tla-syntax/src/parser.rs:68:19:
index out of bounds: the len is 0 but the index is 0

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (783089) panicked at crates/tla-syntax/src/parser.rs:68:19:
index out of bounds: the len is 0 but the index is 0

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
