*** crates/tla-syntax/src/lexer.rs:61:18: replace += with *= in Lexer::bump

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with *= in Lexer::bump
@@ -53,17 +53,17 @@
     }
 
     fn at(&self, offset: usize) -> Option<char> {
         self.chars.get(self.pos + offset).copied()
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;
-        self.pos += 1;
+        self.pos *= /* ~ changed by cargo-mutants ~ */ 1;
         if c == '\n' {
             self.line += 1;
             self.col = 1;
         } else {
             self.col += 1;
         }
         Some(c)
     }

*** result: Timeout
