*** crates/tla-syntax/src/lexer.rs:62:14: replace == with != in Lexer::bump

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::bump
@@ -54,17 +54,17 @@
 
     fn at(&self, offset: usize) -> Option<char> {
         self.chars.get(self.pos + offset).copied()
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;
         self.pos += 1;
-        if c == '\n' {
+        if c != /* ~ changed by cargo-mutants ~ */ '\n' {
             self.line += 1;
             self.col = 1;
         } else {
             self.col += 1;
         }
         Some(c)
     }

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (341096) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 37:1: expected an identifier, found Num(1)
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (341097) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 31:1: expected a declaration, found LParen
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (341101) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 46:1: expected an identifier, found Op(Always)
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    instance_names_may_be_chained_and_take_arguments
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined

test result: FAILED. 10 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
