*** crates/tla-syntax/src/lexer.rs:78:55: replace == with != in Lexer::starts_with

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::starts_with
@@ -70,17 +70,17 @@
 
     fn advance(&mut self, n: usize) {
         for _ in 0..n {
             self.bump();
         }
     }
 
     fn starts_with(&self, s: &str) -> bool {
-        s.chars().enumerate().all(|(i, c)| self.at(i) == Some(c))
+        s.chars().enumerate().all(|(i, c)| self.at(i) != /* ~ changed by cargo-mutants ~ */ Some(c))
     }
 
     fn run_of(&self, c: char) -> usize {
         let mut n = 0;
         while self.at(n) == Some(c) {
             n += 1;
         }
         n

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (803183) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expected an expression, found Op(Lt)
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (803182) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:31: expected Colon, found RBrace
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (803184) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected an expression, found ModuleEnd
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    except_accepts_several_indices_at_once
    higher_order_parameters_record_their_arity

test result: FAILED. 5 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
