*** crates/tla-syntax/src/lexer.rs:78:9: replace Lexer::starts_with -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::starts_with -> bool with true
@@ -70,17 +70,17 @@
 
     fn advance(&mut self, n: usize) {
         for _ in 0..n {
             self.bump();
         }
     }
 
     fn starts_with(&self, s: &str) -> bool {
-        s.chars().enumerate().all(|(i, c)| self.at(i) == Some(c))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn run_of(&self, c: char) -> usize {
         let mut n = 0;
         while self.at(n) == Some(c) {
             n += 1;
         }
         n

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (4176135) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4176133) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (4176134) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
