*** crates/tla-syntax/src/lexer.rs:96:9: replace Lexer::run -> Result<Vec<Token>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::run -> Result<Vec<Token>> with Ok(vec![])
@@ -88,39 +88,17 @@
 
     fn err(&self, msg: impl Into<String>) -> Error {
         Error::lex(msg, self.line, self.col)
     }
 
     fn run(mut self) -> Result<Vec<Token>> {
         // Modules nest, so the file ends at the terminator that closes the
         // outermost one, not at the first one seen.
-        let mut depth = 0usize;
-        loop {
-            self.skip_trivia()?;
-            let (line, col) = (self.line, self.col);
-            let Some(c) = self.peek() else { break };
-            let tok = self.scan(c)?;
-            match tok {
-                Tok::Kw(Kw::Module) => depth += 1,
-                Tok::ModuleEnd => depth = depth.saturating_sub(1),
-                _ => {}
-            }
-            let closed = matches!(tok, Tok::ModuleEnd) && depth == 0;
-            self.out.push(Token { tok, line, col });
-            if closed {
-                break;
-            }
-        }
-        self.out.push(Token {
-            tok: Tok::Eof,
-            line: self.line,
-            col: self.col,
-        });
-        Ok(self.out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn skip_trivia(&mut self) -> Result<()> {
         loop {
             match self.peek() {
                 Some(c) if c.is_whitespace() => {
                     self.bump();
                 }

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (4179406) panicked at crates/tla-syntax/src/parser.rs:51:19:
index out of bounds: the len is 0 but the index is 0

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (4179408) panicked at crates/tla-syntax/src/parser.rs:51:19:
index out of bounds: the len is 0 but the index is 0

---- a_module_may_contain_another stdout ----

thread 'a_module_may_contain_another' (4179410) panicked at crates/tla-syntax/src/parser.rs:51:19:
index out of bounds: the len is 0 but the index is 0

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
