*** crates/tla-syntax/src/parser.rs:1003:17: delete match arm Unit::Instance{name, module, subs} in Parser::let_form

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Unit::Instance{name, module, subs} in Parser::let_form
@@ -995,19 +995,17 @@
                 });
                 continue;
             }
             let Tok::Ident(name) = self.peek().clone() else {
                 return Err(self.err("expected a definition inside LET"));
             };
             match self.named_definition(name, false)? {
                 Unit::Def(def) => defs.push(def),
-                Unit::Instance { name, module, subs } => {
-                    instances.push(LetInstance { name, module, subs });
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => return Err(self.err("only definitions may appear inside LET")),
             }
         }
         self.advance();
         let body = self.expr(0)?;
         Ok(Expr::Let {
             defs,
             instances,

---- a_let_may_introduce_an_instance stdout ----

thread 'a_let_may_introduce_an_instance' (1305118) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:26: only definitions may appear inside LET
in:

failures:
    a_let_may_introduce_an_instance

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
