*** crates/tla-syntax/src/parser.rs:1012:9: replace Parser::bounds -> Result<Vec<Bound>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::bounds -> Result<Vec<Bound>> with Ok(vec![])
@@ -1004,50 +1004,17 @@
             out.push((path, self.expr(0)?));
             if !self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     fn bounds(&mut self, terminator: &Tok) -> Result<Vec<Bound>> {
-        let mut out = Vec::new();
-        loop {
-            let mut destructure = false;
-            let mut names = Vec::new();
-            if self.eat(&Tok::LTup) {
-                destructure = true;
-                loop {
-                    names.push(self.expect_ident()?);
-                    if !self.eat(&Tok::Comma) {
-                        break;
-                    }
-                }
-                self.expect(&Tok::RTup)?;
-            } else {
-                names.push(self.expect_ident()?);
-                while *self.peek() == Tok::Comma && matches!(self.peek_at(1), Tok::Ident(_)) {
-                    self.advance();
-                    names.push(self.expect_ident()?);
-                }
-            }
-            let domain = if self.eat(&Tok::Op(Op::In)) {
-                Some(self.expr(0)?)
-            } else {
-                None
-            };
-            out.push(Bound {
-                names,
-                domain,
-                destructure,
-            });
-            if self.peek() == terminator || !self.eat(&Tok::Comma) {
-                return Ok(out);
-            }
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Is this `[A]_v`? A quantifier inside the brackets puts a `:` where a
     /// record set would have one, so the only reliable sign is the subscript
     /// after the closing bracket.
     fn subscript_follows_bracket(&self) -> bool {
         let mut depth = 0usize;
         for (offset, t) in self.toks[self.pos..].iter().enumerate() {

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (984812) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:3: expected RBrack, found Ident("x")
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (984810) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: expected Colon, found Ident("x")
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (984819) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:16: expected Colon, found Ident("i")
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_function_may_be_defined_by_its_graph
    an_action_subscript_is_recognised_past_an_inner_colon
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
