*** crates/tla-syntax/src/parser.rs:1023:9: replace Parser::subscript_follows_bracket -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::subscript_follows_bracket -> bool with true
@@ -1015,38 +1015,17 @@
             }
         }
     }
 
     /// Is this `[A]_v`? A quantifier inside the brackets puts a `:` where a
     /// record set would have one, so the only reliable sign is the subscript
     /// after the closing bracket.
     fn subscript_follows_bracket(&self) -> bool {
-        let mut depth = 0usize;
-        for (offset, t) in self.toks[self.pos..].iter().enumerate() {
-            match &t.tok {
-                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
-                Tok::RBrack if depth == 0 => {
-                    return match &self.peek_at(offset + 1) {
-                        Tok::Underscore => true,
-                        Tok::Ident(name) => name.starts_with('_'),
-                        _ => false,
-                    };
-                }
-                Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
-                    if depth == 0 {
-                        return false;
-                    }
-                    depth -= 1;
-                }
-                Tok::Eof => return false,
-                _ => {}
-            }
-        }
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Look ahead past a just-consumed `[` or `{` to the first delimiter that
     /// identifies the construct, ignoring anything nested inside brackets.
     fn shape(&self) -> Shape {
         let mut depth = 0usize;
         let mut saw_in = false;
         for t in &self.toks[self.pos..] {

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (93748) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected RBrack, found Kw(Except)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (93756) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:4: expected RBrack, found Kw(Except)

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
