*** crates/tla-syntax/src/parser.rs:1027:36: replace == with != in Parser::bounds

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::bounds
@@ -1019,17 +1019,17 @@
                     names.push(self.expect_ident()?);
                     if !self.eat(&Tok::Comma) {
                         break;
                     }
                 }
                 self.expect(&Tok::RTup)?;
             } else {
                 names.push(self.expect_ident()?);
-                while *self.peek() == Tok::Comma && matches!(self.peek_at(1), Tok::Ident(_)) {
+                while *self.peek() != /* ~ changed by cargo-mutants ~ */ Tok::Comma && matches!(self.peek_at(1), Tok::Ident(_)) {
                     self.advance();
                     names.push(self.expect_ident()?);
                 }
             }
             let domain = if self.eat(&Tok::Op(Op::In)) {
                 Some(self.expr(0)?)
             } else {
                 None

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (513692) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:32: expected Colon, found RBrack
in:

---- temporal_quantifiers_parse_and_are_marked_as_such stdout ----

thread 'temporal_quantifiers_parse_and_are_marked_as_such' (513704) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:26: expected Colon, found RParen
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (513705) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `\EE t : Timer(t)`: parse error at 1:16: expected Colon, found RParen

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
