*** crates/tla-syntax/src/parser.rs:1028:55: replace + with * in Parser::subscript_follows_bracket

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with * in Parser::subscript_follows_bracket
@@ -1020,17 +1020,17 @@
     /// record set would have one, so the only reliable sign is the subscript
     /// after the closing bracket.
     fn subscript_follows_bracket(&self) -> bool {
         let mut depth = 0usize;
         for (offset, t) in self.toks[self.pos..].iter().enumerate() {
             match &t.tok {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RBrack if depth == 0 => {
-                    return match &self.peek_at(offset + 1) {
+                    return match &self.peek_at(offset * /* ~ changed by cargo-mutants ~ */ 1) {
                         Tok::Underscore => true,
                         Tok::Ident(name) => name.starts_with('_'),
                         _ => false,
                     };
                 }
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return false;

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (98908) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected an identifier, found Op(Forall)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (98927) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:4: expected an identifier, found Op(Forall)

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
