*** crates/tla-syntax/src/parser.rs:1029:25: delete match arm Tok::Underscore in Parser::subscript_follows_bracket

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Underscore in Parser::subscript_follows_bracket
@@ -1021,17 +1021,17 @@
     /// after the closing bracket.
     fn subscript_follows_bracket(&self) -> bool {
         let mut depth = 0usize;
         for (offset, t) in self.toks[self.pos..].iter().enumerate() {
             match &t.tok {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RBrack if depth == 0 => {
                     return match &self.peek_at(offset + 1) {
-                        Tok::Underscore => true,
+                         /* ~ changed by cargo-mutants ~ */
                         Tok::Ident(name) => name.starts_with('_'),
                         _ => false,
                     };
                 }
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return false;
                     }

*** result: Success
