*** crates/tla-syntax/src/parser.rs:1035:30: replace == with != in Parser::subscript_follows_bracket

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::subscript_follows_bracket
@@ -1027,17 +1027,17 @@
                 Tok::RBrack if depth == 0 => {
                     return match &self.peek_at(offset + 1) {
                         Tok::Underscore => true,
                         Tok::Ident(name) => name.starts_with('_'),
                         _ => false,
                     };
                 }
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
-                    if depth == 0 {
+                    if depth != /* ~ changed by cargo-mutants ~ */ 0 {
                         return false;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => return false,
                 _ => {}
             }
         }

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (98894) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected an identifier, found Op(Forall)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (98919) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:4: expected an identifier, found Op(Forall)

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
