*** crates/tla-syntax/src/parser.rs:1042:45: delete ! in Parser::bounds

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::bounds
@@ -1034,17 +1034,17 @@
             } else {
                 None
             };
             out.push(Bound {
                 names,
                 domain,
                 destructure,
             });
-            if self.peek() == terminator || !self.eat(&Tok::Comma) {
+            if self.peek() == terminator ||  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     /// Is this `[A]_v`? A quantifier inside the brackets puts a `:` where a
     /// record set would have one, so the only reliable sign is the subscript
     /// after the closing bracket.

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (515717) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 21:27: expected Colon, found Ident("m")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (515723) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected Colon, found Ident(\"m\")", line: 21, col: 27 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
