*** crates/tla-syntax/src/parser.rs:1054:78: replace += with -= in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::shape
@@ -1046,17 +1046,17 @@
 
     /// Look ahead past a just-consumed `[` or `{` to the first delimiter that
     /// identifies the construct, ignoring anything nested inside brackets.
     fn shape(&self) -> Shape {
         let mut depth = 0usize;
         let mut saw_in = false;
         for t in &self.toks[self.pos..] {
             match &t.tok {
-                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
+                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth -= /* ~ changed by cargo-mutants ~ */ 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}

*** result: Success
