*** crates/tla-syntax/src/parser.rs:1062:28: replace > with == in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace > with == in Parser::shape
@@ -1054,17 +1054,17 @@
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
-                _ if depth > 0 => {}
+                _ if depth == /* ~ changed by cargo-mutants ~ */ 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (106850) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected RBrack, found Kw(Except)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (106858) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:4: expected RBrack, found Kw(Except)

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
