*** crates/tla-syntax/src/parser.rs:1063:17: delete match arm Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup in Parser::subscript_follows_bracket

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup in Parser::subscript_follows_bracket
@@ -1055,22 +1055,17 @@
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RBrack if depth == 0 => {
                     return match &self.peek_at(offset + 1) {
                         Tok::Underscore => true,
                         Tok::Ident(name) => name.starts_with('_'),
                         _ => false,
                     };
                 }
-                Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
-                    if depth == 0 {
-                        return false;
-                    }
-                    depth -= 1;
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Eof => return false,
                 _ => {}
             }
         }
         false
     }
 
     /// Look ahead past a just-consumed `[` or `{` to the first delimiter that

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (518359) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected an identifier, found Op(Forall)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (518372) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:4: expected an identifier, found Op(Forall)

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
