*** crates/tla-syntax/src/parser.rs:1064:17: delete match arm Tok::MapsTo in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::MapsTo in Parser::shape
@@ -1056,17 +1056,17 @@
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
-                Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }
         Shape::Closed
     }

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (102440) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected RBrack, found MapsTo", line: 10, col: 14 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (102443) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 14:27: expected RBrack, found MapsTo

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (102444) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected RBrack, found MapsTo", line: 10, col: 14 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
