*** crates/tla-syntax/src/parser.rs:1069:17: delete match arm Tok::Eof in Parser::subscript_follows_bracket

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Eof in Parser::subscript_follows_bracket
@@ -1061,17 +1061,17 @@
                     };
                 }
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return false;
                     }
                     depth -= 1;
                 }
-                Tok::Eof => return false,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
         false
     }
 
     /// Look ahead past a just-consumed `[` or `{` to the first delimiter that
     /// identifies the construct, ignoring anything nested inside brackets.

*** result: Success
