*** crates/tla-syntax/src/parser.rs:1084:17: delete match arm Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup in Parser::shape
@@ -1076,22 +1076,17 @@
     /// Look ahead past a just-consumed `[` or `{` to the first delimiter that
     /// identifies the construct, ignoring anything nested inside brackets.
     fn shape(&self) -> Shape {
         let mut depth = 0usize;
         let mut saw_in = false;
         for t in &self.toks[self.pos..] {
             match &t.tok {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
-                Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
-                    if depth == 0 {
-                        return Shape::Closed;
-                    }
-                    depth -= 1;
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}

*** result: Success
