*** crates/tla-syntax/src/parser.rs:1088:27: replace -= with /= in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace -= with /= in Parser::shape
@@ -1080,17 +1080,17 @@
         let mut saw_in = false;
         for t in &self.toks[self.pos..] {
             match &t.tok {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
-                    depth -= 1;
+                    depth /= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,

*** result: Success
