*** crates/tla-syntax/src/parser.rs:1091:22: replace match guard depth > 0 with false in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard depth > 0 with false in Parser::shape
@@ -1083,17 +1083,17 @@
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
-                _ if depth > 0 => {}
+                _ if false /* ~ changed by cargo-mutants ~ */ => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }

*** result: Success
