*** crates/tla-syntax/src/parser.rs:1094:17: delete match arm Tok::Colon in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Colon in Parser::shape
@@ -1086,17 +1086,17 @@
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
-                Tok::Colon => return Shape::Colon { bounded: saw_in },
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }
         Shape::Closed
     }
 }

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (531221) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected RBrack, found Colon", line: 13, col: 14 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (531227) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected RBrack, found Colon", line: 9, col: 9 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (531225) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Parse, message: "expected RBrack, found Colon", line: 13, col: 14 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
