*** crates/tla-syntax/src/parser.rs:1095:17: delete match arm Tok::Arrow in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Arrow in Parser::shape
@@ -1087,17 +1087,17 @@
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
-                Tok::Arrow => return Shape::Arrow,
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }
         Shape::Closed
     }
 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (531869) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 12:25: expected RBrack, found Arrow

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (531873) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected RBrack, found Arrow", line: 14, col: 22 }

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (531867) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected RBrack, found Arrow", line: 22, col: 28 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
