*** crates/tla-syntax/src/parser.rs:1096:17: delete match arm Tok::Kw(Kw::Except) in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Except) in Parser::shape
@@ -1088,17 +1088,17 @@
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
-                Tok::Kw(Kw::Except) => return Shape::Except,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
         Shape::Closed
     }
 }
 
 /// Read `x \in S` back as the bound it is, so `{x \in S : P}` can be told from

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (1007564) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected RBrack, found Kw(Except)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1007572) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:4: expected RBrack, found Kw(Except)

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
