*** crates/tla-syntax/src/parser.rs:1107:5: replace as_bound -> Option<Bound> with None

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace as_bound -> Option<Bound> with None
@@ -1099,31 +1099,10 @@
         }
         Shape::Closed
     }
 }
 
 /// Read `x \in S` back as the bound it is, so `{x \in S : P}` can be told from
 /// `{e : x \in S}` once the first expression has already been parsed.
 fn as_bound(e: &Expr) -> Option<Bound> {
-    let Expr::Binary(Op::In, lhs, domain) = e else {
-        return None;
-    };
-    let (names, destructure) = match &**lhs {
-        Expr::Ident(name) => (vec![name.clone()], false),
-        Expr::Tuple(items) => {
-            let mut names = Vec::with_capacity(items.len());
-            for item in items {
-                let Expr::Ident(name) = item else {
-                    return None;
-                };
-                names.push(name.clone());
-            }
-            (names, true)
-        }
-        _ => return None,
-    };
-    Some(Bound {
-        names,
-        domain: Some((**domain).clone()),
-        destructure,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (1015900) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:18: expected RBrace, found LParen
in:

failures:
    set_filters_and_set_maps_are_told_apart

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
