*** crates/tla-syntax/src/parser.rs:110:56: replace <= with > in Parser::fenced

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace <= with > in Parser::fenced
@@ -102,17 +102,17 @@
     fn err_at(&self, at: usize, message: impl Into<String>) -> Error {
         let t = &self.toks[at];
         Error::parse(message, t.line, t.col)
     }
 
     /// True when the upcoming token belongs to an enclosing junction list
     /// rather than to the expression being parsed.
     fn fenced(&self) -> bool {
-        self.fences.last().is_some_and(|&f| self.col() <= f)
+        self.fences.last().is_some_and(|&f| self.col() > /* ~ changed by cargo-mutants ~ */ f)
     }
 
     fn bracketed<T>(&mut self, f: impl FnOnce(&mut Self) -> Result<T>) -> Result<T> {
         self.fences.push(0);
         let out = f(self);
         self.fences.pop();
         out
     }

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (39603) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an identifier, found Num(1)
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (39608) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an identifier, found Op(Cup)
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (39609) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    case_arms_are_separated_by_boxes
    instance_names_may_be_chained_and_take_arguments
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined

test result: FAILED. 8 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
