*** crates/tla-syntax/src/parser.rs:110:9: replace Parser::fenced -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::fenced -> bool with false
@@ -102,17 +102,17 @@
     fn err_at(&self, at: usize, message: impl Into<String>) -> Error {
         let t = &self.toks[at];
         Error::parse(message, t.line, t.col)
     }
 
     /// True when the upcoming token belongs to an enclosing junction list
     /// rather than to the expression being parsed.
     fn fenced(&self) -> bool {
-        self.fences.last().is_some_and(|&f| self.col() <= f)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn bracketed<T>(&mut self, f: impl FnOnce(&mut Self) -> Result<T>) -> Result<T> {
         self.fences.push(0);
         let out = f(self);
         self.fences.pop();
         out
     }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (39162) panicked at crates/tla-syntax/tests/parse_specs.rs:68:5:
assertion `left == right` failed: Phase2a has four top-level conjuncts
  left: 1
 right: 4

failures:
    junction_lists_are_scoped_by_column

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
