*** crates/tla-syntax/src/parser.rs:1112:9: delete match arm Expr::Tuple(items) in as_bound

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Expr::Tuple(items) in as_bound
@@ -1104,26 +1104,17 @@
 /// Read `x \in S` back as the bound it is, so `{x \in S : P}` can be told from
 /// `{e : x \in S}` once the first expression has already been parsed.
 fn as_bound(e: &Expr) -> Option<Bound> {
     let Expr::Binary(Op::In, lhs, domain) = e else {
         return None;
     };
     let (names, destructure) = match &**lhs {
         Expr::Ident(name) => (vec![name.clone()], false),
-        Expr::Tuple(items) => {
-            let mut names = Vec::with_capacity(items.len());
-            for item in items {
-                let Expr::Ident(name) = item else {
-                    return None;
-                };
-                names.push(name.clone());
-            }
-            (names, true)
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => return None,
     };
     Some(Bound {
         names,
         domain: Some((**domain).clone()),
         destructure,
     })
 }

*** result: Success
