*** crates/tla-syntax/src/parser.rs:140:15: delete ! in Parser::module

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::module
@@ -132,17 +132,17 @@
         let out = f(self);
         self.fences.pop();
         out
     }
 
     // ---------------------------------------------------------------- module
 
     fn module(&mut self) -> Result<Module> {
-        while !(matches!(self.peek(), Tok::Separator)
+        while  /* ~ changed by cargo-mutants ~ */(matches!(self.peek(), Tok::Separator)
             && matches!(self.peek_at(1), Tok::Kw(Kw::Module)))
         {
             if matches!(self.peek(), Tok::Eof) {
                 return Err(self.err("no `---- MODULE ----` header found"));
             }
             self.advance();
         }
         self.advance();

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (899262) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:13: expected Kw(Module), found Ident("T")
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (899261) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:13: expected Kw(Module), found Ident("T")
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (899263) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:13: expected Kw(Module), found Ident("T")
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 1 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
