*** crates/tla-syntax/src/parser.rs:147:17: delete match arm Tok::ModuleEnd | Tok::Eof in Parser::module_body

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::ModuleEnd | Tok::Eof in Parser::module_body
@@ -139,17 +139,17 @@
         let name = self.expect_ident()?;
         self.expect(&Tok::Separator)?;
 
         let mut extends = Vec::new();
         let mut units = Vec::new();
         loop {
             while self.eat(&Tok::Separator) {}
             match self.peek() {
-                Tok::ModuleEnd | Tok::Eof => break,
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Kw(Kw::Module) => {
                     let inner = self.module_body()?;
                     self.expect(&Tok::ModuleEnd)?;
                     units.push(Unit::Inner(Box::new(inner)));
                 }
                 Tok::Kw(Kw::Extends) => {
                     self.advance();
                     extends.push(self.expect_ident()?);

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (41017) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected a declaration, found ModuleEnd
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (41016) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected a declaration, found ModuleEnd
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (41015) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected a declaration, found ModuleEnd
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 1 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
