*** crates/tla-syntax/src/parser.rs:153:17: delete match arm Tok::Kw(Kw::Extends) in Parser::module_body

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Extends) in Parser::module_body
@@ -145,23 +145,17 @@
             while self.eat(&Tok::Separator) {}
             match self.peek() {
                 Tok::ModuleEnd | Tok::Eof => break,
                 Tok::Kw(Kw::Module) => {
                     let inner = self.module_body()?;
                     self.expect(&Tok::ModuleEnd)?;
                     units.push(Unit::Inner(Box::new(inner)));
                 }
-                Tok::Kw(Kw::Extends) => {
-                    self.advance();
-                    extends.push(self.expect_ident()?);
-                    while self.eat(&Tok::Comma) {
-                        extends.push(self.expect_ident()?);
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => units.push(self.unit()?),
             }
         }
         Ok(Module {
             name,
             extends,
             units,
         })

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (41794) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected a declaration, found Kw(Extends)", line: 2, col: 1 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (41798) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected a declaration, found Kw(Extends)", line: 2, col: 1 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (41801) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected a declaration, found Kw(Extends)", line: 4, col: 1 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
