*** crates/tla-syntax/src/parser.rs:198:33: replace == with != in Parser::module_body

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::module_body
@@ -190,17 +190,17 @@
                     }
                 }
                 _ => {
                     // A unit that reads nothing would leave this loop spinning
                     // on the same token for ever. Nothing should do that, and
                     // if something does, saying so beats hanging.
                     let before = self.pos;
                     let unit = self.unit_body()?;
-                    if self.pos == before {
+                    if self.pos != /* ~ changed by cargo-mutants ~ */ before {
                         return Err(self.err(format!(
                             "cannot make sense of {:?}, and cannot get past it",
                             self.peek()
                         )));
                     }
                     units.push(unit);
                 }
             }

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1230982) panicked at crates/tla-syntax/tests/golden.rs:38:72:
BankTransfer.tla: parse error at 8:1: cannot make sense of Kw(Variable), and cannot get past it

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1230983) panicked at crates/tla-syntax/tests/golden.rs:78:70:
RaftElection.tla: parse error at 4:1: cannot make sense of Ident("NoOne"), and cannot get past it

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
