*** crates/tla-syntax/src/parser.rs:316:9: replace Parser::recover -> Option<T> with None

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::recover -> Option<T> with None
@@ -308,25 +308,17 @@
         if matches!(self.peek(), Tok::Ident(_)) && matches!(self.peek_at(1), Tok::DefEq) {
             self.advance();
             self.advance();
         }
     }
 
     /// Try something, and rewind rather than fail if it does not work.
     fn recover<T>(&mut self, f: impl FnOnce(&mut Self) -> Result<T>) -> Option<T> {
-        let mark = self.pos;
-        let fences = self.fences.len();
-        let Ok(value) = f(self) else {
-            self.pos = mark;
-            self.fences.truncate(fences);
-            self.skip_to_unit();
-            return None;
-        };
-        Some(value)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Skip a TLAPS proof.
     ///
     /// Proofs are checked by a prover, not by an evaluator, so this crate
     /// recognises them in order to get past them. A proof runs until the next
     /// token that can only begin a new module unit.
     fn skip_proof(&mut self) {

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (43107) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (43109) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

failures:
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
