*** crates/tla-syntax/src/parser.rs:325:49: replace && with || in Parser::skip_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::skip_label
@@ -317,17 +317,17 @@
             body: self.expr(0)?,
             local,
         }))
     }
 
     /// `THEOREM Name == ...` names the theorem; the name carries no meaning
     /// for evaluation, so it is read and dropped.
     fn skip_label(&mut self) {
-        if matches!(self.peek(), Tok::Ident(_)) && matches!(self.peek_at(1), Tok::DefEq) {
+        if matches!(self.peek(), Tok::Ident(_)) || /* ~ changed by cargo-mutants ~ */ matches!(self.peek_at(1), Tok::DefEq) {
             self.advance();
             self.advance();
         }
     }
 
     /// Try something, and rewind rather than fail if it does not work.
     fn recover<T>(&mut self, f: impl FnOnce(&mut Self) -> Result<T>) -> Option<T> {
         let mark = self.pos;

*** result: Success
