*** crates/tla-syntax/src/parser.rs:365:9: replace Parser::skip_to_unit with ()

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::skip_to_unit with ()
@@ -357,23 +357,17 @@
                 return;
             }
             self.advance();
         }
     }
 
     /// Advance to whatever comes after something that could not be read.
     fn skip_to_unit(&mut self) {
-        self.advance();
-        while !matches!(self.peek(), Tok::Eof | Tok::ModuleEnd | Tok::Separator) {
-            if self.at_unit_start() {
-                return;
-            }
-            self.advance();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn at_proof(&self) -> bool {
         matches!(self.peek(), Tok::Kw(Kw::Proof))
             // A proof step is written `<1>2.`, which reaches us as `<`, a
             // number or name, then `>`.
             || (matches!(self.peek(), Tok::Op(Op::Lt))
                 && matches!(self.peek_at(2), Tok::Op(Op::Gt)))

*** result: Success
