*** crates/tla-syntax/src/parser.rs:375:9: replace Parser::at_proof -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_proof -> bool with false
@@ -367,21 +367,17 @@
             if self.at_unit_start() {
                 return;
             }
             self.advance();
         }
     }
 
     fn at_proof(&self) -> bool {
-        matches!(self.peek(), Tok::Kw(Kw::Proof))
-            // A proof step is written `<1>2.`, which reaches us as `<`, a
-            // number or name, then `>`.
-            || (matches!(self.peek(), Tok::Op(Op::Lt))
-                && matches!(self.peek_at(2), Tok::Op(Op::Gt)))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
         if self.col() != 1 {
             return false;
         }

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (443380) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an identifier, found Num(1)
in:

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
