*** crates/tla-syntax/src/parser.rs:379:13: delete match arm Tok::Ident(_) in Parser::at_unit_start

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Ident(_) in Parser::at_unit_start
@@ -371,20 +371,17 @@
                 Kw::Variable
                 | Kw::Constant
                 | Kw::Assume
                 | Kw::Theorem
                 | Kw::Local
                 | Kw::Instance
                 | Kw::Recursive,
             ) => true,
-            Tok::Ident(_) => matches!(
-                self.peek_at(1),
-                Tok::DefEq | Tok::LParen | Tok::LBrack | Tok::Op(_)
-            ),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         }
     }
 
     fn decl_list(&mut self) -> Result<Vec<Decl>> {
         let mut out = vec![self.decl()?];
         while self.eat(&Tok::Comma) {
             out.push(self.decl()?);

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (49557) panicked at crates/tla-syntax/tests/grammar.rs:204:5:
the definition after the proof is still read

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
