*** crates/tla-syntax/src/parser.rs:379:17: replace && with || in Parser::at_proof

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::at_proof
@@ -371,17 +371,17 @@
         }
     }
 
     fn at_proof(&self) -> bool {
         matches!(self.peek(), Tok::Kw(Kw::Proof))
             // A proof step is written `<1>2.`, which reaches us as `<`, a
             // number or name, then `>`.
             || (matches!(self.peek(), Tok::Op(Op::Lt))
-                && matches!(self.peek_at(2), Tok::Op(Op::Gt)))
+                || /* ~ changed by cargo-mutants ~ */ matches!(self.peek_at(2), Tok::Op(Op::Gt)))
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
         if self.col() != 1 {
             return false;
         }

*** result: Success
