*** crates/tla-syntax/src/parser.rs:385:23: replace != with == in Parser::at_unit_start

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace != with == in Parser::at_unit_start
@@ -377,17 +377,17 @@
             // number or name, then `>`.
             || (matches!(self.peek(), Tok::Op(Op::Lt))
                 && matches!(self.peek_at(2), Tok::Op(Op::Gt)))
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
-        if self.col() != 1 {
+        if self.col() == /* ~ changed by cargo-mutants ~ */ 1 {
             return false;
         }
         match self.peek() {
             Tok::Kw(
                 Kw::Variable
                 | Kw::Constant
                 | Kw::Assume
                 | Kw::Theorem

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (446077) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Kw(Proof)
in:

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
