*** crates/tla-syntax/src/parser.rs:385:9: replace Parser::at_unit_start -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_unit_start -> bool with true
@@ -377,35 +377,17 @@
             // number or name, then `>`.
             || (matches!(self.peek(), Tok::Op(Op::Lt))
                 && matches!(self.peek_at(2), Tok::Op(Op::Gt)))
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
-        if self.col() != 1 {
-            return false;
-        }
-        match self.peek() {
-            Tok::Kw(
-                Kw::Variable
-                | Kw::Constant
-                | Kw::Assume
-                | Kw::Theorem
-                | Kw::Local
-                | Kw::Instance
-                | Kw::Recursive,
-            ) => true,
-            Tok::Ident(_) => matches!(
-                self.peek_at(1),
-                Tok::DefEq | Tok::LParen | Tok::LBrack | Tok::Op(_)
-            ),
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn decl_list(&mut self) -> Result<Vec<Decl>> {
         let mut out = vec![self.decl()?];
         while self.eat(&Tok::Comma) {
             out.push(self.decl()?);
         }
         Ok(out)

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (912062) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an identifier, found Num(1)
in:

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
