*** crates/tla-syntax/src/parser.rs:403:23: replace += with *= in Parser::decl

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with *= in Parser::decl
@@ -395,17 +395,17 @@
     fn decl(&mut self) -> Result<Decl> {
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {
             loop {
                 if !self.eat(&Tok::Underscore) {
                     self.expect_ident()?;
                 }
-                arity += 1;
+                arity *= /* ~ changed by cargo-mutants ~ */ 1;
                 if !self.eat(&Tok::Comma) {
                     break;
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Decl { name, arity })
     }

*** result: Success
