*** crates/tla-syntax/src/parser.rs:407:9: replace Parser::decl_list -> Result<Vec<Decl>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::decl_list -> Result<Vec<Decl>> with Ok(vec![])
@@ -399,21 +399,17 @@
                 self.peek_at(1),
                 Tok::DefEq | Tok::LParen | Tok::LBrack | Tok::Op(_)
             ),
             _ => false,
         }
     }
 
     fn decl_list(&mut self) -> Result<Vec<Decl>> {
-        let mut out = vec![self.decl()?];
-        while self.eat(&Tok::Comma) {
-            out.push(self.decl()?);
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn decl(&mut self) -> Result<Decl> {
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {
             loop {
                 if !self.eat(&Tok::Underscore) {

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (448104) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 6:15: expected DefEq, found Comma

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (448110) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected DefEq, found Comma", line: 6, col: 15 }

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (448102) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected DefEq, found Comma", line: 7, col: 19 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
