*** crates/tla-syntax/src/parser.rs:434:9: replace Parser::at_unit_start -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_unit_start -> bool with true
@@ -426,33 +426,17 @@
 
     fn begins_line(&self) -> bool {
         self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
-        if self.col() != 1 {
-            return false;
-        }
-        match self.peek() {
-            Tok::Kw(
-                Kw::Variable
-                | Kw::Constant
-                | Kw::Assume
-                | Kw::Theorem
-                | Kw::Local
-                | Kw::Instance
-                | Kw::Recursive
-                | Kw::Extends,
-            ) => true,
-            Tok::Ident(_) | Tok::Op(_) | Tok::Underscore => self.at_definition(),
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,
     /// and the next definition's `==` is only a few tokens away.
     fn at_definition(&self) -> bool {

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1251562) panicked at crates/tla-syntax/tests/golden.rs:38:72:
BankTransfer.tla: parse error at 12:1: expected DefEq, found Ident("TypeOK")

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1251564) panicked at crates/tla-syntax/tests/golden.rs:78:70:
RaftElection.tla: parse error at 6:27: expected an identifier, found LBrack

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
