*** crates/tla-syntax/src/parser.rs:453:20: delete ! in Parser::param

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::param
@@ -445,17 +445,17 @@
 
     /// A formal parameter: a name, or `f(_, _)` for one that is itself an
     /// operator and so has to be applied rather than used as a value.
     fn param(&mut self) -> Result<Param> {
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {
             loop {
-                if !self.eat(&Tok::Underscore) {
+                if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Underscore) {
                     self.expect_ident()?;
                 }
                 arity += 1;
                 if !self.eat(&Tok::Comma) {
                     break;
                 }
             }
             self.expect(&Tok::RParen)?;

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (921124) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:10: expected an identifier, found Comma
in:

failures:
    higher_order_parameters_record_their_arity

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
