*** crates/tla-syntax/src/parser.rs:456:23: replace += with -= in Parser::param

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::param
@@ -448,17 +448,17 @@
     fn param(&mut self) -> Result<Param> {
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {
             loop {
                 if !self.eat(&Tok::Underscore) {
                     self.expect_ident()?;
                 }
-                arity += 1;
+                arity -= /* ~ changed by cargo-mutants ~ */ 1;
                 if !self.eat(&Tok::Comma) {
                     break;
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Param { name, arity })
     }

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (453723) panicked at crates/tla-syntax/src/parser.rs:456:17:
attempt to subtract with overflow

failures:
    higher_order_parameters_record_their_arity

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
