*** crates/tla-syntax/src/parser.rs:457:20: delete ! in Parser::param

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::param
@@ -449,17 +449,17 @@
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {
             loop {
                 if !self.eat(&Tok::Underscore) {
                     self.expect_ident()?;
                 }
                 arity += 1;
-                if !self.eat(&Tok::Comma) {
+                if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                     break;
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Param { name, arity })
     }

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (454940) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected RParen, found Underscore
in:

failures:
    higher_order_parameters_record_their_arity

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
