*** crates/tla-syntax/src/parser.rs:459:9: replace Parser::at_definition -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_definition -> bool with true
@@ -451,39 +451,17 @@
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,
     /// and the next definition's `==` is only a few tokens away.
     fn at_definition(&self) -> bool {
-        let defeq = |offset: usize| matches!(self.peek_at(offset), Tok::DefEq);
-        match self.peek() {
-            // `Name ==`, `Name(..) ==`, `Name[..] ==`, `a + b ==`, `b ^+ ==`
-            Tok::Ident(_) => {
-                defeq(1)
-                    || match self.peek_at(1) {
-                        Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
-                        Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
-                        _ => false,
-                    }
-            }
-            // `-. a ==`, `- a ==`, `-. _ ==`
-            Tok::Op(_) => {
-                let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
-                self.is_name(after) && defeq(after + 1)
-            }
-            // `_ + _ ==`, `_ ^# ==`
-            Tok::Underscore => {
-                matches!(self.peek_at(1), Tok::Op(_))
-                    && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
-            }
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_name(&self, offset: usize) -> bool {
         matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {

---- an_expression_may_continue_into_the_first_column stdout ----

thread 'an_expression_may_continue_into_the_first_column' (1254330) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Op(Or)
in:

failures:
    an_expression_may_continue_into_the_first_column

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
