*** crates/tla-syntax/src/parser.rs:472:78: replace + with - in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with - in Parser::at_definition
@@ -464,17 +464,17 @@
                     || match self.peek_at(1) {
                         Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
                         Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
                         _ => false,
                     }
             }
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
-                let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
+                let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) - /* ~ changed by cargo-mutants ~ */ 1;
                 self.is_name(after) && defeq(after + 1)
             }
             // `_ + _ ==`, `_ ^# ==`
             Tok::Underscore => {
                 matches!(self.peek_at(1), Tok::Op(_))
                     && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
             }
             _ => false,

---- a_prefix_operator_definition_still_starts_a_unit stdout ----

thread 'a_prefix_operator_definition_still_starts_a_unit' (1263087) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an expression, found Dot
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1263088) panicked at crates/tla-syntax/src/parser.rs:472:29:
attempt to subtract with overflow

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1263089) panicked at crates/tla-syntax/src/parser.rs:472:29:
attempt to subtract with overflow

failures:
    a_prefix_operator_definition_still_starts_a_unit
    a_proof_is_skipped_and_the_module_continues
    a_proof_step_does_not_look_like_a_comparison
    an_expression_may_continue_into_the_first_column

test result: FAILED. 29 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
