*** crates/tla-syntax/src/parser.rs:473:37: replace && with || in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::at_definition
@@ -465,17 +465,17 @@
                         Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
                         Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
                         _ => false,
                     }
             }
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
                 let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
-                self.is_name(after) && defeq(after + 1)
+                self.is_name(after) || /* ~ changed by cargo-mutants ~ */ defeq(after + 1)
             }
             // `_ + _ ==`, `_ ^# ==`
             Tok::Underscore => {
                 matches!(self.peek_at(1), Tok::Op(_))
                     && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
             }
             _ => false,
         }

---- an_expression_may_continue_into_the_first_column stdout ----

thread 'an_expression_may_continue_into_the_first_column' (1264810) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Op(Or)
in:

failures:
    an_expression_may_continue_into_the_first_column

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
