*** crates/tla-syntax/src/parser.rs:484:21: replace < with == in Parser::expr

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace < with == in Parser::expr
@@ -476,17 +476,17 @@
             _ => self.prefix()?,
         };
         loop {
             if self.fenced() {
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };
-            if prec < min_prec {
+            if prec == /* ~ changed by cargo-mutants ~ */ min_prec {
                 break;
             }
             self.advance();
             let next_min = if op.is_right_assoc() { prec } else { prec + 1 };
             let rhs = self.expr(next_min)?;
             lhs = Expr::Binary(op, Box::new(lhs), Box::new(rhs));
         }
         Ok(lhs)

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (56224) panicked at crates/tla-syntax/tests/parse_specs.rs:93:5:
assertion `left == right` failed
  left: 2
 right: 3

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (56233) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BankTransfer.tla: Transfer did not survive printing as `from # to /\ bal[from] >= amt /\ bal' = [bal EXCEPT ![from] = @ - amt, ![to] = @ + amt]`

failures:
    always_binds_tighter_than_conjunction
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
