*** crates/tla-syntax/src/parser.rs:485:9: replace Parser::is_name -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::is_name -> bool with true
@@ -477,17 +477,17 @@
                 matches!(self.peek_at(1), Tok::Op(_))
                     && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
             }
             _ => false,
         }
     }
 
     fn is_name(&self, offset: usize) -> bool {
-        matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {
         let mut depth = 0usize;
         let mut at = offset;
         loop {
             match self.peek_at(at) {

*** result: Success
