*** crates/tla-syntax/src/parser.rs:485:9: replace Parser::is_name -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::is_name -> bool with false
@@ -477,17 +477,17 @@
                 matches!(self.peek_at(1), Tok::Op(_))
                     && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
             }
             _ => false,
         }
     }
 
     fn is_name(&self, offset: usize) -> bool {
-        matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {
         let mut depth = 0usize;
         let mut at = offset;
         loop {
             match self.peek_at(at) {

---- a_prefix_operator_definition_still_starts_a_unit stdout ----

thread 'a_prefix_operator_definition_still_starts_a_unit' (1271154) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an expression, found Dot
in:

failures:
    a_prefix_operator_definition_still_starts_a_unit

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
