*** crates/tla-syntax/src/parser.rs:486:23: replace >= with < in Parser::expr

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace >= with < in Parser::expr
@@ -478,17 +478,17 @@
             }
         }
         Ok((module, subs))
     }
 
     // ------------------------------------------------------------ expression
 
     fn expr(&mut self, min_prec: u8) -> Result<Expr> {
-        if self.depth >= MAX_NESTING {
+        if self.depth < /* ~ changed by cargo-mutants ~ */ MAX_NESTING {
             return Err(self.err(format!("expressions nest more than {MAX_NESTING} deep")));
         }
         self.depth += 1;
         let parsed = self.expr_inner(min_prec);
         self.depth -= 1;
         parsed
     }

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (457657) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expressions nest more than 64 deep
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (457658) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:6: expressions nest more than 64 deep
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (457659) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expressions nest more than 64 deep
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
