*** crates/tla-syntax/src/parser.rs:489:20: replace += with *= in Parser::expr

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with *= in Parser::expr
@@ -481,17 +481,17 @@
     }
 
     // ------------------------------------------------------------ expression
 
     fn expr(&mut self, min_prec: u8) -> Result<Expr> {
         if self.depth >= MAX_NESTING {
             return Err(self.err(format!("expressions nest more than {MAX_NESTING} deep")));
         }
-        self.depth += 1;
+        self.depth *= /* ~ changed by cargo-mutants ~ */ 1;
         let parsed = self.expr_inner(min_prec);
         self.depth -= 1;
         parsed
     }
 
     fn expr_inner(&mut self, min_prec: u8) -> Result<Expr> {
         // A bulleted list is an operand, not a whole expression: after
         //

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (926970) panicked at crates/tla-syntax/src/parser.rs:491:9:
attempt to subtract with overflow

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (926972) panicked at crates/tla-syntax/src/parser.rs:491:9:
attempt to subtract with overflow

---- a_name_may_begin_with_a_digit_or_an_underscore stdout ----

thread 'a_name_may_begin_with_a_digit_or_an_underscore' (926975) panicked at crates/tla-syntax/src/parser.rs:491:9:
attempt to subtract with overflow

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
