*** crates/tla-syntax/src/parser.rs:491:20: replace -= with += in Parser::expr

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace -= with += in Parser::expr
@@ -483,17 +483,17 @@
     // ------------------------------------------------------------ expression
 
     fn expr(&mut self, min_prec: u8) -> Result<Expr> {
         if self.depth >= MAX_NESTING {
             return Err(self.err(format!("expressions nest more than {MAX_NESTING} deep")));
         }
         self.depth += 1;
         let parsed = self.expr_inner(min_prec);
-        self.depth -= 1;
+        self.depth += /* ~ changed by cargo-mutants ~ */ 1;
         parsed
     }
 
     fn expr_inner(&mut self, min_prec: u8) -> Result<Expr> {
         // A bulleted list is an operand, not a whole expression: after
         //
         //     /\ TypeOK
         //     /\ OneVote

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (927972) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expressions nest more than 64 deep", line: 13, col: 52 }

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (927968) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expressions nest more than 64 deep", line: 13, col: 52 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (927975) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expressions nest more than 64 deep", line: 22, col: 19 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
