*** crates/tla-syntax/src/parser.rs:504:13: delete match arm Tok::Op(op @(Op::And | Op::Or)) in Parser::expr_inner

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(op @(Op::And | Op::Or)) in Parser::expr_inner
@@ -496,17 +496,17 @@
         // A bulleted list is an operand, not a whole expression: after
         //
         //     /\ TypeOK
         //     /\ OneVote
         //     => chosen = {}
         //
         // the `=>` ends the list and then applies to it.
         let mut lhs = match *self.peek() {
-            Tok::Op(op @ (Op::And | Op::Or)) => self.junction(op)?,
+             /* ~ changed by cargo-mutants ~ */
             _ => self.prefix()?,
         };
         loop {
             if self.fenced() {
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (461674) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:3: expected an expression, found Op(And)
in:

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (461680) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expected an expression, found Op(And)
in:

failures:
    an_operator_may_follow_a_bulleted_list
    labels_are_read_and_dropped

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
