*** crates/tla-syntax/src/parser.rs:513:21: replace < with <= in Parser::expr_inner

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace < with <= in Parser::expr_inner
@@ -505,17 +505,17 @@
             _ => self.prefix()?,
         };
         loop {
             if self.fenced() {
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };
-            if prec < min_prec {
+            if prec <= /* ~ changed by cargo-mutants ~ */ min_prec {
                 break;
             }
             self.advance();
             let next_min = if op.is_right_assoc() { prec } else { prec + 1 };
             let rhs = self.expr(next_min)?;
             lhs = Expr::Binary(op, Box::new(lhs), Box::new(rhs));
         }
         Ok(lhs)

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (931597) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BankTransfer.tla: Transfer did not survive printing as `from # to /\ bal[from] >= amt /\ bal' = [bal EXCEPT ![from] = @ - amt, ![to] = @ + amt]`

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
