*** crates/tla-syntax/src/parser.rs:517:72: replace + with * in Parser::expr_inner

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with * in Parser::expr_inner
@@ -509,17 +509,17 @@
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };
             if prec < min_prec {
                 break;
             }
             self.advance();
-            let next_min = if op.is_right_assoc() { prec } else { prec + 1 };
+            let next_min = if op.is_right_assoc() { prec } else { prec * /* ~ changed by cargo-mutants ~ */ 1 };
             let rhs = self.expr(next_min)?;
             lhs = Expr::Binary(op, Box::new(lhs), Box::new(rhs));
         }
         Ok(lhs)
     }
 
     /// A bulleted `/\` or `\/` list, scoped by the column of its bullets.
     fn junction(&mut self, op: Op) -> Result<Expr> {

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (933030) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BankTransfer.tla: Transfer did not survive printing as `from # to /\ bal[from] >= amt /\ bal' = [bal EXCEPT ![from] = @ - amt, ![to] = @ + amt]`

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
