*** crates/tla-syntax/src/parser.rs:529:43: replace && with || in Parser::junction

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::junction
@@ -521,17 +521,17 @@
         Ok(lhs)
     }
 
     /// A bulleted `/\` or `\/` list, scoped by the column of its bullets.
     fn junction(&mut self, op: Op) -> Result<Expr> {
         let col = self.col();
         self.fences.push(col);
         let mut items = Vec::new();
-        while *self.peek() == Tok::Op(op) && self.col() == col {
+        while *self.peek() == Tok::Op(op) || /* ~ changed by cargo-mutants ~ */ self.col() == col {
             self.advance();
             items.push(self.expr(0)?);
         }
         self.fences.pop();
         Ok(if op == Op::And {
             Expr::conjunction(items)
         } else {
             Expr::disjunction(items)

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (465242) panicked at crates/tla-syntax/tests/grammar.rs:95:5:
TypeOK /\ OneVote /\ Consistent

failures:
    an_operator_may_follow_a_bulleted_list

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
