*** crates/tla-syntax/src/parser.rs:529:57: replace == with != in Parser::junction

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::junction
@@ -521,17 +521,17 @@
         Ok(lhs)
     }
 
     /// A bulleted `/\` or `\/` list, scoped by the column of its bullets.
     fn junction(&mut self, op: Op) -> Result<Expr> {
         let col = self.col();
         self.fences.push(col);
         let mut items = Vec::new();
-        while *self.peek() == Tok::Op(op) && self.col() == col {
+        while *self.peek() == Tok::Op(op) && self.col() != /* ~ changed by cargo-mutants ~ */ col {
             self.advance();
             items.push(self.expr(0)?);
         }
         self.fences.pop();
         Ok(if op == Op::And {
             Expr::conjunction(items)
         } else {
             Expr::disjunction(items)

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (466562) panicked at crates/tla-syntax/src/ast.rs:313:33:
junction list has at least one item

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (466567) panicked at crates/tla-syntax/src/ast.rs:313:33:
junction list has at least one item

failures:
    an_operator_may_follow_a_bulleted_list
    labels_are_read_and_dropped

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
