*** crates/tla-syntax/src/parser.rs:534:18: replace == with != in Parser::junction

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::junction
@@ -526,17 +526,17 @@
         let col = self.col();
         self.fences.push(col);
         let mut items = Vec::new();
         while *self.peek() == Tok::Op(op) && self.col() == col {
             self.advance();
             items.push(self.expr(0)?);
         }
         self.fences.pop();
-        Ok(if op == Op::And {
+        Ok(if op != /* ~ changed by cargo-mutants ~ */ Op::And {
             Expr::conjunction(items)
         } else {
             Expr::disjunction(items)
         })
     }
 
     fn prefix(&mut self) -> Result<Expr> {
         if let Some(labelled) = self.skip_expression_label() {

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (936224) panicked at crates/tla-syntax/tests/grammar.rs:223:5:
assertion `left == right` failed
  left: "x = 1 \\/ y = 2"
 right: "x = 1 /\\ y = 2"

failures:
    labels_are_read_and_dropped

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
