*** crates/tla-syntax/src/parser.rs:535:13: delete match arm Tok::Kw(Kw::Domain) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Domain) in Parser::prefix
@@ -527,17 +527,17 @@
                 let body = self.expr(0)?;
                 return Ok(Expr::Quant {
                     kind,
                     bounds,
                     body: Box::new(body),
                 });
             }
             Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
-            Tok::Kw(Kw::Domain) => Op::Domain,
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Subset) => Op::Subset,
             Tok::Kw(Kw::Union) => Op::BigUnion,
             Tok::Kw(Kw::Enabled) => Op::Enabled,
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };
         self.advance();
         // Every prefix operator here binds tighter than `/\`, so `[][A]_v /\ B`

*** result: Success
