*** crates/tla-syntax/src/parser.rs:538:13: delete match arm Tok::Kw(Kw::Enabled) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Enabled) in Parser::prefix
@@ -530,17 +530,17 @@
                     bounds,
                     body: Box::new(body),
                 });
             }
             Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
             Tok::Kw(Kw::Domain) => Op::Domain,
             Tok::Kw(Kw::Subset) => Op::Subset,
             Tok::Kw(Kw::Union) => Op::BigUnion,
-            Tok::Kw(Kw::Enabled) => Op::Enabled,
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };
         self.advance();
         // Every prefix operator here binds tighter than `/\`, so `[][A]_v /\ B`
         // is a conjunction of two formulas rather than `[]` over both.
         let operand_prec = match op {
             Op::Minus => 11,

*** result: Success
