*** crates/tla-syntax/src/parser.rs:546:13: delete match arm Tok::Op(o @(Op::Forall | Op::Exists | Op::TemporalForall | Op::TemporalExists)) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(o @(Op::Forall | Op::Exists | Op::TemporalForall | Op::TemporalExists)) in Parser::prefix
@@ -538,33 +538,17 @@
         })
     }
 
     fn prefix(&mut self) -> Result<Expr> {
         if let Some(labelled) = self.skip_expression_label() {
             return labelled;
         }
         let op = match *self.peek() {
-            Tok::Op(o @ (Op::Forall | Op::Exists | Op::TemporalForall | Op::TemporalExists)) => {
-                self.advance();
-                let kind = match o {
-                    Op::Forall => QuantKind::Forall,
-                    Op::Exists => QuantKind::Exists,
-                    Op::TemporalForall => QuantKind::TemporalForall,
-                    _ => QuantKind::TemporalExists,
-                };
-                let bounds = self.bounds(&Tok::Colon)?;
-                self.expect(&Tok::Colon)?;
-                let body = self.expr(0)?;
-                return Ok(Expr::Quant {
-                    kind,
-                    bounds,
-                    body: Box::new(body),
-                });
-            }
+             /* ~ changed by cargo-mutants ~ */
             Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
             Tok::Kw(Kw::Domain) => Op::Domain,
             Tok::Kw(Kw::Subset) => Op::Subset,
             Tok::Kw(Kw::Union) => Op::BigUnion,
             Tok::Kw(Kw::Enabled) => Op::Enabled,
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (468428) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected an expression, found Op(Forall)
in:

---- temporal_quantifiers_parse_and_are_marked_as_such stdout ----

thread 'temporal_quantifiers_parse_and_are_marked_as_such' (468443) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected an expression, found Op(TemporalExists)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (468444) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `\EE t : Timer(t)`: parse error at 1:1: expected an expression, found Op(TemporalExists)

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
