*** crates/tla-syntax/src/parser.rs:550:21: delete match arm Op::Exists in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Op::Exists in Parser::prefix
@@ -542,17 +542,17 @@
         if let Some(labelled) = self.skip_expression_label() {
             return labelled;
         }
         let op = match *self.peek() {
             Tok::Op(o @ (Op::Forall | Op::Exists | Op::TemporalForall | Op::TemporalExists)) => {
                 self.advance();
                 let kind = match o {
                     Op::Forall => QuantKind::Forall,
-                    Op::Exists => QuantKind::Exists,
+                     /* ~ changed by cargo-mutants ~ */
                     Op::TemporalForall => QuantKind::TemporalForall,
                     _ => QuantKind::TemporalExists,
                 };
                 let bounds = self.bounds(&Tok::Colon)?;
                 self.expect(&Tok::Colon)?;
                 let body = self.expr(0)?;
                 return Ok(Expr::Quant {
                     kind,

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (943162) panicked at crates/tla-syntax/tests/parse_specs.rs:84:5:
assertion `left == right` failed
  left: TemporalExists
 right: Exists

failures:
    nested_junctions_nest

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
