*** crates/tla-syntax/src/parser.rs:558:9: replace Parser::fixity_declaration -> Option<Param> with None

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::fixity_declaration -> Option<Param> with None
@@ -550,42 +550,17 @@
         }
         Ok(params)
     }
 
     /// An operator declared by the shape it is written in rather than by a
     /// name: `_+_` takes two operands around it, `-._` one after it, `_^#` one
     /// before it. The underscores are where the operands go.
     fn fixity_declaration(&mut self) -> Option<Param> {
-        let mark = self.pos;
-        // `_ op _` and `_ op`
-        if matches!(self.peek(), Tok::Underscore)
-            && let Tok::Op(op) = *self.peek_at(1)
-        {
-            self.advance();
-            self.advance();
-            let arity = if self.eat(&Tok::Underscore) { 2 } else { 1 };
-            return Some(Param {
-                name: op.symbol().to_string(),
-                arity,
-            });
-        }
-        // `op _`, and the `-._` spelling that marks a prefix minus.
-        if let Tok::Op(op) = *self.peek() {
-            self.advance();
-            self.eat(&Tok::Dot);
-            if self.eat(&Tok::Underscore) {
-                return Some(Param {
-                    name: op.symbol().to_string(),
-                    arity: 1,
-                });
-            }
-            self.pos = mark;
-        }
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// A formal parameter: a name, `f(_, _)` for one that is itself an
     /// operator, or an operator written by its fixity.
     fn param(&mut self) -> Result<Param> {
         if let Some(operator) = self.fixity_declaration() {
             return Ok(operator);
         }

---- operators_can_be_declared_by_their_fixity stdout ----

thread 'operators_can_be_declared_by_their_fixity' (1284129) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected an identifier, found Underscore
in:

failures:
    operators_can_be_declared_by_their_fixity

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
