*** crates/tla-syntax/src/parser.rs:563:13: delete match arm Tok::Op(o @(Op::Not | Op::Always | Op::Eventually | Op::Minus)) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(o @(Op::Not | Op::Always | Op::Eventually | Op::Minus)) in Parser::prefix
@@ -555,17 +555,17 @@
                 self.expect(&Tok::Colon)?;
                 let body = self.expr(0)?;
                 return Ok(Expr::Quant {
                     kind,
                     bounds,
                     body: Box::new(body),
                 });
             }
-            Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Domain) => Op::Domain,
             Tok::Kw(Kw::Subset) => Op::Subset,
             Tok::Kw(Kw::Union) => Op::BigUnion,
             Tok::Kw(Kw::Enabled) => Op::Enabled,
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };
         self.advance();

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (468395) panicked at crates/tla-syntax/tests/grammar.rs:189:5:
assertion failed: m.units.iter().any(|u| matches!(u, Unit::Theorem(_)))

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (468398) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:10: expected an expression, found Op(Always)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (468411) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:1: expected an expression, found Op(Always)

failures:
    a_named_theorem_keeps_its_statement
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
