*** crates/tla-syntax/src/parser.rs:565:13: delete match arm Tok::Kw(Kw::Subset) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Subset) in Parser::prefix
@@ -557,17 +557,17 @@
                 return Ok(Expr::Quant {
                     kind,
                     bounds,
                     body: Box::new(body),
                 });
             }
             Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
             Tok::Kw(Kw::Domain) => Op::Domain,
-            Tok::Kw(Kw::Subset) => Op::Subset,
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Union) => Op::BigUnion,
             Tok::Kw(Kw::Enabled) => Op::Enabled,
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };
         self.advance();
         // Every prefix operator here binds tighter than `/\`, so `[][A]_v /\ B`
         // is a conjunction of two formulas rather than `[]` over both.

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (469787) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
RaftElection.tla: parse error at 16:34: expected an expression, found Kw(Subset)

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (469793) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected an expression, found Kw(Subset)", line: 16, col: 34 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
