*** crates/tla-syntax/src/parser.rs:576:13: delete match arm Op::Domain | Op::Subset | Op::BigUnion in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Op::Domain | Op::Subset | Op::BigUnion in Parser::prefix
@@ -568,17 +568,17 @@
             Tok::Kw(Kw::Unchanged) => Op::Unchanged,
             _ => return self.postfix(),
         };
         self.advance();
         // Every prefix operator here binds tighter than `/\`, so `[][A]_v /\ B`
         // is a conjunction of two formulas rather than `[]` over both.
         let operand_prec = match op {
             Op::Minus => 11,
-            Op::Domain | Op::Subset | Op::BigUnion => 9,
+             /* ~ changed by cargo-mutants ~ */
             _ => 5,
         };
         let operand = self.expr(operand_prec)?;
         Ok(Expr::Unary(op, Box::new(operand)))
     }
 
     /// A label names a subexpression so a proof can refer to it. It has no
     /// bearing on the expression's value, so it is dropped.

*** result: Success
