*** crates/tla-syntax/src/parser.rs:576:23: replace += with -= in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::skip_expression_label
@@ -568,17 +568,17 @@
                         if depth == 0 {
                             ahead += 1;
                             break;
                         }
                     }
                     Tok::Eof => return None,
                     _ => {}
                 }
-                ahead += 1;
+                ahead -= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
         if !matches!(self.peek_at(ahead), Tok::ColonColon) {
             return None;
         }
         for _ in 0..=ahead {
             self.advance();
         }

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (71245) panicked at crates/tla-syntax/src/parser.rs:576:17:
attempt to subtract with overflow

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (71253) panicked at crates/tla-syntax/src/parser.rs:576:17:
attempt to subtract with overflow

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (71262) panicked at crates/tla-syntax/src/parser.rs:576:17:
attempt to subtract with overflow

failures:
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
