*** crates/tla-syntax/src/parser.rs:579:12: delete ! in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::skip_expression_label
@@ -571,17 +571,17 @@
                         }
                     }
                     Tok::Eof => return None,
                     _ => {}
                 }
                 ahead += 1;
             }
         }
-        if !matches!(self.peek_at(ahead), Tok::ColonColon) {
+        if  /* ~ changed by cargo-mutants ~ */matches!(self.peek_at(ahead), Tok::ColonColon) {
             return None;
         }
         for _ in 0..=ahead {
             self.advance();
         }
         Some(self.expr(0))
     }

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (72081) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an expression, found DefEq
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (72079) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:31: expected Colon, found RBrace
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (72080) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected an expression, found ModuleEnd
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list
    except_accepts_several_indices_at_once
    higher_order_parameters_record_their_arity

test result: FAILED. 5 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
