*** crates/tla-syntax/src/parser.rs:586:12: delete ! in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::skip_expression_label
@@ -578,17 +578,17 @@
         };
         let operand = self.expr(operand_prec)?;
         Ok(Expr::Unary(op, Box::new(operand)))
     }
 
     /// A label names a subexpression so a proof can refer to it. It has no
     /// bearing on the expression's value, so it is dropped.
     fn skip_expression_label(&mut self) -> Option<Result<Expr>> {
-        if !matches!(self.peek(), Tok::Ident(_)) {
+        if  /* ~ changed by cargo-mutants ~ */matches!(self.peek(), Tok::Ident(_)) {
             return None;
         }
         let mut ahead = 1;
         if matches!(self.peek_at(1), Tok::LParen) {
             let mut depth = 0usize;
             loop {
                 match self.peek_at(ahead) {
                     Tok::LParen => depth += 1,

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (477286) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:15: expected a declaration, found ColonColon
in:

failures:
    labels_are_read_and_dropped

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
