*** crates/tla-syntax/src/parser.rs:586:9: replace Parser::skip_expression_label -> Option<Result<Expr>> with None

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::skip_expression_label -> Option<Result<Expr>> with None
@@ -578,45 +578,17 @@
         };
         let operand = self.expr(operand_prec)?;
         Ok(Expr::Unary(op, Box::new(operand)))
     }
 
     /// A label names a subexpression so a proof can refer to it. It has no
     /// bearing on the expression's value, so it is dropped.
     fn skip_expression_label(&mut self) -> Option<Result<Expr>> {
-        if !matches!(self.peek(), Tok::Ident(_)) {
-            return None;
-        }
-        let mut ahead = 1;
-        if matches!(self.peek_at(1), Tok::LParen) {
-            let mut depth = 0usize;
-            loop {
-                match self.peek_at(ahead) {
-                    Tok::LParen => depth += 1,
-                    Tok::RParen => {
-                        depth -= 1;
-                        if depth == 0 {
-                            ahead += 1;
-                            break;
-                        }
-                    }
-                    Tok::Eof => return None,
-                    _ => {}
-                }
-                ahead += 1;
-            }
-        }
-        if !matches!(self.peek_at(ahead), Tok::ColonColon) {
-            return None;
-        }
-        for _ in 0..=ahead {
-            self.advance();
-        }
-        Some(self.expr(0))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn postfix(&mut self) -> Result<Expr> {
         let mut e = self.primary()?;
         loop {
             if self.fenced() {
                 break;
             }

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (476143) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:15: expected a declaration, found ColonColon
in:

failures:
    labels_are_read_and_dropped

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
