*** crates/tla-syntax/src/parser.rs:594:21: delete match arm Tok::LParen in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::LParen in Parser::skip_expression_label
@@ -586,17 +586,17 @@
         if !matches!(self.peek(), Tok::Ident(_)) {
             return None;
         }
         let mut ahead = 1;
         if matches!(self.peek_at(1), Tok::LParen) {
             let mut depth = 0usize;
             loop {
                 match self.peek_at(ahead) {
-                    Tok::LParen => depth += 1,
+                     /* ~ changed by cargo-mutants ~ */
                     Tok::RParen => {
                         depth -= 1;
                         if depth == 0 {
                             ahead += 1;
                             break;
                         }
                     }
                     Tok::Eof => return None,

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (947337) panicked at crates/tla-syntax/src/parser.rs:596:25:
attempt to subtract with overflow

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (947345) panicked at crates/tla-syntax/src/parser.rs:596:25:
attempt to subtract with overflow

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (947354) panicked at crates/tla-syntax/src/parser.rs:596:25:
attempt to subtract with overflow

failures:
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
