*** crates/tla-syntax/src/parser.rs:596:31: replace -= with /= in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace -= with /= in Parser::skip_expression_label
@@ -588,17 +588,17 @@
         }
         let mut ahead = 1;
         if matches!(self.peek_at(1), Tok::LParen) {
             let mut depth = 0usize;
             loop {
                 match self.peek_at(ahead) {
                     Tok::LParen => depth += 1,
                     Tok::RParen => {
-                        depth -= 1;
+                        depth /= /* ~ changed by cargo-mutants ~ */ 1;
                         if depth == 0 {
                             ahead += 1;
                             break;
                         }
                     }
                     Tok::Eof => return None,
                     _ => {}
                 }

*** result: Success
