*** crates/tla-syntax/src/parser.rs:598:35: replace += with -= in Parser::skip_expression_label

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::skip_expression_label
@@ -590,17 +590,17 @@
         if matches!(self.peek_at(1), Tok::LParen) {
             let mut depth = 0usize;
             loop {
                 match self.peek_at(ahead) {
                     Tok::LParen => depth += 1,
                     Tok::RParen => {
                         depth -= 1;
                         if depth == 0 {
-                            ahead += 1;
+                            ahead -= /* ~ changed by cargo-mutants ~ */ 1;
                             break;
                         }
                     }
                     Tok::Eof => return None,
                     _ => {}
                 }
                 ahead += 1;
             }

*** result: Success
