*** crates/tla-syntax/src/parser.rs:608:17: delete match arm Tok::LBrack in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::LBrack in Parser::postfix
@@ -600,22 +600,17 @@
                     let op = *op;
                     self.advance();
                     e = Expr::Unary(op, Box::new(e));
                 }
                 Tok::Dot => {
                     self.advance();
                     e = Expr::Field(Box::new(e), self.expect_ident()?);
                 }
-                Tok::LBrack => {
-                    self.advance();
-                    let args = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
-                    self.expect(&Tok::RBrack)?;
-                    e = Expr::FnApply(Box::new(e), args);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::LParen if matches!(e, Expr::Ident(_)) => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
                 Tok::Bang => {
                     let instance = match &e {

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (73555) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:30: expected RBrack, found LBrack
in:

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (73566) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:8: expected RBrace, found LBrack
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (73568) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:21: expected RBrack, found LBrack

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
