*** crates/tla-syntax/src/parser.rs:614:32: replace match guard matches!(e, Expr::Ident(_)) with true in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard matches!(e, Expr::Ident(_)) with true in Parser::postfix
@@ -606,17 +606,17 @@
                     e = Expr::Field(Box::new(e), self.expect_ident()?);
                 }
                 Tok::LBrack => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
                     self.expect(&Tok::RBrack)?;
                     e = Expr::FnApply(Box::new(e), args);
                 }
-                Tok::LParen if matches!(e, Expr::Ident(_)) => {
+                Tok::LParen if true /* ~ changed by cargo-mutants ~ */ => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
                 Tok::Bang => {
                     let instance = match &e {
                         Expr::Ident(name) => name.clone(),

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (76180) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected LParen, found ModuleEnd
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (76202) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `WF_<<a, b>>(Next)`: parse error at 1:18: expected LParen, found Eof

failures:
    a_fairness_subscript_may_be_a_tuple
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
