*** crates/tla-syntax/src/parser.rs:614:32: replace match guard matches!(e, Expr::Ident(_)) with false in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard matches!(e, Expr::Ident(_)) with false in Parser::postfix
@@ -606,17 +606,17 @@
                     e = Expr::Field(Box::new(e), self.expect_ident()?);
                 }
                 Tok::LBrack => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
                     self.expect(&Tok::RBrack)?;
                     e = Expr::FnApply(Box::new(e), args);
                 }
-                Tok::LParen if matches!(e, Expr::Ident(_)) => {
+                Tok::LParen if false /* ~ changed by cargo-mutants ~ */ => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
                 Tok::Bang => {
                     let instance = match &e {
                         Expr::Ident(name) => name.clone(),

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (76656) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected a declaration, found LParen
in:

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (76664) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:18: expected a declaration, found LParen
in:

---- set_filters_and_set_maps_are_told_apart stdout ----

thread 'set_filters_and_set_maps_are_told_apart' (76673) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:18: expected RBrace, found LParen
in:

failures:
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_operator_may_be_passed_as_an_argument
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
