*** crates/tla-syntax/src/parser.rs:620:17: delete match arm Tok::Bang in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Bang in Parser::postfix
@@ -612,52 +612,17 @@
                     e = Expr::FnApply(Box::new(e), args);
                 }
                 Tok::LParen if matches!(e, Expr::Ident(_)) => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
-                Tok::Bang => {
-                    let instance = match &e {
-                        Expr::Ident(name) => name.clone(),
-                        Expr::Qualified { instance, name, .. } => format!("{instance}!{name}"),
-                        Expr::Apply(head, _) => head.to_string(),
-                        _ => return Err(self.err("`!` must follow an instance name")),
-                    };
-                    self.advance();
-                    // `Inv!2` picks the second conjunct of `Inv`, and `Inv!:`
-                    // its whole body; both are proof notation, not values.
-                    let name = match self.peek().clone() {
-                        Tok::Num(n) => {
-                            self.advance();
-                            n.to_string()
-                        }
-                        Tok::Op(op) => {
-                            self.advance();
-                            op.symbol().to_string()
-                        }
-                        Tok::Colon => {
-                            self.advance();
-                            String::new()
-                        }
-                        _ => self.expect_ident()?,
-                    };
-                    let mut args = Vec::new();
-                    if self.eat(&Tok::LParen) {
-                        args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
-                        self.expect(&Tok::RParen)?;
-                    }
-                    e = Expr::Qualified {
-                        instance,
-                        name,
-                        args,
-                    };
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => break,
             }
         }
         Ok(e)
     }
 
     fn expr_list(&mut self, close: &Tok) -> Result<Vec<Expr>> {
         let mut out = Vec::new();

---- instance_names_may_be_chained_and_take_arguments stdout ----

thread 'instance_names_may_be_chained_and_take_arguments' (74321) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:7: expected a declaration, found Bang
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (74327) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `A!B!C`: parse error at 1:2: unexpected Bang after the expression

failures:
    instance_names_may_be_chained_and_take_arguments
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
