*** crates/tla-syntax/src/parser.rs:628:32: replace match guard op.is_postfix() with true in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard op.is_postfix() with true in Parser::postfix
@@ -620,17 +620,17 @@
             if self.fenced() {
                 break;
             }
             match self.peek() {
                 Tok::Prime => {
                     self.advance();
                     e = Expr::Prime(Box::new(e));
                 }
-                Tok::Op(op) if op.is_postfix() => {
+                Tok::Op(op) if true /* ~ changed by cargo-mutants ~ */ => {
                     let op = *op;
                     self.advance();
                     e = Expr::Unary(op, Box::new(e));
                 }
                 Tok::Dot => {
                     self.advance();
                     e = Expr::Field(Box::new(e), self.expect_ident()?);
                 }

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (960111) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected a declaration, found Num(1)
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (960115) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (960116) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 11 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
