*** crates/tla-syntax/src/parser.rs:628:32: replace match guard op.is_postfix() with false in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard op.is_postfix() with false in Parser::postfix
@@ -620,17 +620,17 @@
             if self.fenced() {
                 break;
             }
             match self.peek() {
                 Tok::Prime => {
                     self.advance();
                     e = Expr::Prime(Box::new(e));
                 }
-                Tok::Op(op) if op.is_postfix() => {
+                Tok::Op(op) if false /* ~ changed by cargo-mutants ~ */ => {
                     let op = *op;
                     self.advance();
                     e = Expr::Unary(op, Box::new(e));
                 }
                 Tok::Dot => {
                     self.advance();
                     e = Expr::Field(Box::new(e), self.expect_ident()?);
                 }

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (960706) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an identifier, found Op(Cup)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (960721) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `S^+ \cup T`: parse error at 1:2: unexpected Op(User("^+")) after the expression

failures:
    a_postfix_operator_binds_to_what_precedes_it
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
