*** crates/tla-syntax/src/parser.rs:633:17: delete match arm Tok::Dot in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Dot in Parser::postfix
@@ -625,20 +625,17 @@
                     self.advance();
                     e = Expr::Prime(Box::new(e));
                 }
                 Tok::Op(op) if op.is_postfix() => {
                     let op = *op;
                     self.advance();
                     e = Expr::Unary(op, Box::new(e));
                 }
-                Tok::Dot => {
-                    self.advance();
-                    e = Expr::Field(Box::new(e), self.expect_ident()?);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::LBrack => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
                     self.expect(&Tok::RBrack)?;
                     e = Expr::FnApply(Box::new(e), args);
                 }
                 Tok::LParen if matches!(e, Expr::Ident(_)) => {
                     self.advance();

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (487174) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected a declaration, found Dot", line: 16, col: 30 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (487178) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected a declaration, found Dot", line: 16, col: 30 }

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (487175) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected a declaration, found Dot", line: 41, col: 9 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 3 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
