*** crates/tla-syntax/src/parser.rs:652:25: delete match arm Expr::Qualified{instance, name, ..} in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Expr::Qualified{instance, name, ..} in Parser::postfix
@@ -644,17 +644,17 @@
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
                 Tok::Bang => {
                     let instance = match &e {
                         Expr::Ident(name) => name.clone(),
-                        Expr::Qualified { instance, name, .. } => format!("{instance}!{name}"),
+                         /* ~ changed by cargo-mutants ~ */
                         Expr::Apply(head, _) => head.to_string(),
                         _ => return Err(self.err("`!` must follow an instance name")),
                     };
                     self.advance();
                     // `Inv!2` picks the second conjunct of `Inv`, and `Inv!:`
                     // its whole body; both are proof notation, not values.
                     let name = match self.peek().clone() {
                         Tok::Num(n) => {

---- instance_names_may_be_chained_and_take_arguments stdout ----

thread 'instance_names_may_be_chained_and_take_arguments' (492582) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: `!` must follow an instance name
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (492588) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `A!B!C`: parse error at 1:4: `!` must follow an instance name

failures:
    instance_names_may_be_chained_and_take_arguments
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
