*** crates/tla-syntax/src/parser.rs:653:25: delete match arm Expr::Apply(head, _) in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Expr::Apply(head, _) in Parser::postfix
@@ -645,17 +645,17 @@
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
                 Tok::Bang => {
                     let instance = match &e {
                         Expr::Ident(name) => name.clone(),
                         Expr::Qualified { instance, name, .. } => format!("{instance}!{name}"),
-                        Expr::Apply(head, _) => head.to_string(),
+                         /* ~ changed by cargo-mutants ~ */
                         _ => return Err(self.err("`!` must follow an instance name")),
                     };
                     self.advance();
                     // `Inv!2` picks the second conjunct of `Inv`, and `Inv!:`
                     // its whole body; both are proof notation, not values.
                     let name = match self.peek().clone() {
                         Tok::Num(n) => {
                             self.advance();

*** result: Success
