*** crates/tla-syntax/src/parser.rs:663:9: replace Parser::expr_list -> Result<Vec<Expr>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::expr_list -> Result<Vec<Expr>> with Ok(vec![])
@@ -655,38 +655,17 @@
                 }
                 _ => break,
             }
         }
         Ok(e)
     }
 
     fn expr_list(&mut self, close: &Tok) -> Result<Vec<Expr>> {
-        let mut out = Vec::new();
-        if self.peek() == close {
-            return Ok(out);
-        }
-        loop {
-            // `FoldSet(+, 0, S)` passes the operator itself, not an
-            // application of it.
-            if let Tok::Op(op) = *self.peek()
-                && (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
-            {
-                self.advance();
-                out.push(Expr::Ident(op.symbol().to_string()));
-                if !self.eat(&Tok::Comma) {
-                    return Ok(out);
-                }
-                continue;
-            }
-            out.push(self.expr(0)?);
-            if !self.eat(&Tok::Comma) {
-                return Ok(out);
-            }
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn primary(&mut self) -> Result<Expr> {
         let at = self.pos;
         match self.advance() {
             Tok::Num(n) => Ok(Expr::Num(n)),
             Tok::Str(s) => Ok(Expr::Str(s)),
             Tok::Kw(Kw::True) => Ok(Expr::Bool(true)),

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (79990) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected RTup, found Ident("a")
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (79992) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:14: expected RParen, found Kw(Lambda)
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (79998) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:31: expected RBrack, found Ident("i")
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_be_passed_as_an_argument
    except_accepts_several_indices_at_once
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
