*** crates/tla-syntax/src/parser.rs:664:25: delete match arm Tok::Op(op) in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(op) in Parser::postfix
@@ -656,20 +656,17 @@
                     self.advance();
                     // `Inv!2` picks the second conjunct of `Inv`, and `Inv!:`
                     // its whole body; both are proof notation, not values.
                     let name = match self.peek().clone() {
                         Tok::Num(n) => {
                             self.advance();
                             n.to_string()
                         }
-                        Tok::Op(op) => {
-                            self.advance();
-                            op.symbol().to_string()
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         Tok::Colon => {
                             self.advance();
                             String::new()
                         }
                         _ => self.expect_ident()?,
                     };
                     let mut args = Vec::new();
                     if self.eat(&Tok::LParen) {

*** result: Success
