*** crates/tla-syntax/src/parser.rs:671:59: replace || with && in Parser::expr_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::expr_list
@@ -663,17 +663,17 @@
         let mut out = Vec::new();
         if self.peek() == close {
             return Ok(out);
         }
         loop {
             // `FoldSet(+, 0, S)` passes the operator itself, not an
             // application of it.
             if let Tok::Op(op) = *self.peek()
-                && (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
+                && (matches!(self.peek_at(1), Tok::Comma) && /* ~ changed by cargo-mutants ~ */ self.peek_at(1) == close)
             {
                 self.advance();
                 out.push(Expr::Ident(op.symbol().to_string()));
                 if !self.eat(&Tok::Comma) {
                     return Ok(out);
                 }
                 continue;
             }

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (81281) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an expression, found Op(Plus)
in:

failures:
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
