*** crates/tla-syntax/src/parser.rs:681:16: delete ! in Parser::expr_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::expr_list
@@ -673,17 +673,17 @@
                 self.advance();
                 out.push(Expr::Ident(op.symbol().to_string()));
                 if !self.eat(&Tok::Comma) {
                     return Ok(out);
                 }
                 continue;
             }
             out.push(self.expr(0)?);
-            if !self.eat(&Tok::Comma) {
+            if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     fn primary(&mut self) -> Result<Expr> {
         let at = self.pos;
         match self.advance() {

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (82248) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:14: expected RTup, found Ident("b")
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (82250) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:35: expected RParen, found Num(1)
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (82256) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:32: expected an expression, found RBrack
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_lambda_may_be_passed_where_an_operator_is_wanted
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_be_passed_as_an_argument
    except_accepts_several_indices_at_once
    set_filters_and_set_maps_are_told_apart
    temporal_quantifiers_parse_and_are_marked_as_such
    the_new_forms_round_trip

test result: FAILED. 15 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
