*** crates/tla-syntax/src/parser.rs:704:20: delete ! in Parser::expr_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::expr_list
@@ -696,17 +696,17 @@
         loop {
             // `FoldSet(+, 0, S)` passes the operator itself, not an
             // application of it.
             if let Tok::Op(op) = *self.peek()
                 && (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
             {
                 self.advance();
                 out.push(Expr::Ident(op.symbol().to_string()));
-                if !self.eat(&Tok::Comma) {
+                if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                     return Ok(out);
                 }
                 continue;
             }
             out.push(self.expr(0)?);
             if !self.eat(&Tok::Comma) {
                 return Ok(out);
             }

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (971118) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:22: expected RParen, found Num(0)
in:

failures:
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
