*** crates/tla-syntax/src/parser.rs:727:25: delete match arm Unit::Def(def) in Parser::primary

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Unit::Def(def) in Parser::primary
@@ -719,17 +719,17 @@
                     if self.eat(&Tok::Kw(Kw::Recursive)) {
                         self.decl_list()?;
                         continue;
                     }
                     let Tok::Ident(name) = self.peek().clone() else {
                         return Err(self.err("expected a definition inside LET"));
                     };
                     match self.named_definition(name, false)? {
-                        Unit::Def(def) => defs.push(def),
+                         /* ~ changed by cargo-mutants ~ */
                         _ => return Err(self.err("only definitions may appear inside LET")),
                     }
                 }
                 self.advance();
                 let body = self.expr(0)?;
                 Ok(Expr::Let {
                     defs,
                     body: Box::new(body),

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (83432) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 31:8: only definitions may appear inside LET

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (83429) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "only definitions may appear inside LET", line: 52, col: 8 }

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (83438) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "only definitions may appear inside LET", line: 31, col: 8 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
