*** crates/tla-syntax/src/parser.rs:72:57: replace - with + in Parser::peek_at

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace - with + in Parser::peek_at
@@ -64,17 +64,17 @@
         }
     }
 
     fn peek(&self) -> &Tok {
         &self.toks[self.pos].tok
     }
 
     fn peek_at(&self, offset: usize) -> &Tok {
-        let i = (self.pos + offset).min(self.toks.len() - 1);
+        let i = (self.pos + offset).min(self.toks.len() + /* ~ changed by cargo-mutants ~ */ 1);
         &self.toks[i].tok
     }
 
     fn col(&self) -> u32 {
         self.toks[self.pos].col
     }
 
     fn advance(&mut self) -> Tok {

*** result: Success
