*** crates/tla-syntax/src/parser.rs:771:33: replace != with == in Parser::primary

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace != with == in Parser::primary
@@ -763,17 +763,17 @@
                     defs,
                     body: Box::new(body),
                 })
             }
             Tok::Kw(Kw::Choose) => {
                 let mut bounds = self.bounds(&Tok::Colon)?;
                 self.expect(&Tok::Colon)?;
                 let body = self.expr(0)?;
-                if bounds.len() != 1 {
+                if bounds.len() == /* ~ changed by cargo-mutants ~ */ 1 {
                     return Err(self.err("CHOOSE takes exactly one bound variable"));
                 }
                 Ok(Expr::Choose {
                     bound: Box::new(bounds.remove(0)),
                     body: Box::new(body),
                 })
             }
             Tok::Kw(Kw::Case) => self.case_form(),

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (973538) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:31: CHOOSE takes exactly one bound variable
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (973560) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `{CHOOSE x \in S : TRUE}`: parse error at 1:23: CHOOSE takes exactly one bound variable

failures:
    a_choose_inside_braces_is_not_a_set_filter
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
