*** crates/tla-syntax/src/parser.rs:77:9: replace Parser::col -> u32 with 1

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::col -> u32 with 1
@@ -69,17 +69,17 @@
     }
 
     fn peek_at(&self, offset: usize) -> &Tok {
         let i = (self.pos + offset).min(self.toks.len() - 1);
         &self.toks[i].tok
     }
 
     fn col(&self) -> u32 {
-        self.toks[self.pos].col
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn advance(&mut self) -> Tok {
         let t = self.toks[self.pos].tok.clone();
         if self.pos + 1 < self.toks.len() {
             self.pos += 1;
         }
         t

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (421723) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an identifier, found Num(1)
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (421724) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected a declaration, found LParen
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (421727) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    instance_names_may_be_chained_and_take_arguments
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined

test result: FAILED. 10 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
