*** crates/tla-syntax/src/parser.rs:824:35: delete ! in Parser::case_form

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::case_form
@@ -816,17 +816,17 @@
             if self.eat(&Tok::Kw(Kw::Other)) {
                 self.expect(&Tok::Arrow)?;
                 other = Some(Box::new(self.expr(0)?));
             } else {
                 let guard = self.expr(0)?;
                 self.expect(&Tok::Arrow)?;
                 arms.push((guard, self.expr(0)?));
             }
-            if other.is_some() || !self.eat(&Tok::Op(Op::Always)) {
+            if other.is_some() ||  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Op(Op::Always)) {
                 return Ok(Expr::Case { arms, other });
             }
         }
     }
 
     fn tuple_or_action(&mut self) -> Result<Expr> {
         let items = self.bracketed(|p| p.expr_list(&Tok::RTup))?;
         self.expect(&Tok::RTup)?;

---- case_arms_are_separated_by_boxes stdout ----

thread 'case_arms_are_separated_by_boxes' (502744) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:38: expected an identifier, found Num(2)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (502753) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `CASE n = 1 -> "a" [] OTHER -> "b"`: parse error at 1:22: unexpected Kw(Other) after the expression

failures:
    case_arms_are_separated_by_boxes
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
