*** crates/tla-syntax/src/parser.rs:82:21: replace + with * in Parser::advance

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with * in Parser::advance
@@ -74,17 +74,17 @@
     }
 
     fn col(&self) -> u32 {
         self.toks[self.pos].col
     }
 
     fn advance(&mut self) -> Tok {
         let t = self.toks[self.pos].tok.clone();
-        if self.pos + 1 < self.toks.len() {
+        if self.pos * /* ~ changed by cargo-mutants ~ */ 1 < self.toks.len() {
             self.pos += 1;
         }
         t
     }
 
     fn eat(&mut self, tok: &Tok) -> bool {
         if self.peek() == tok {
             self.advance();

*** result: Success
