*** crates/tla-syntax/src/parser.rs:831:16: delete ! in Parser::subscript

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::subscript
@@ -823,17 +823,17 @@
             _ => false,
         }
     }
 
     /// The `v` of `[A]_v`, parsed tightly so it cannot swallow what follows.
     fn subscript(&mut self) -> Result<Expr> {
         if let Tok::Ident(name) = self.peek()
             && let Some(rest) = name.strip_prefix('_')
-            && !rest.is_empty()
+            &&  /* ~ changed by cargo-mutants ~ */rest.is_empty()
         {
             let subscript = Expr::Ident(rest.to_string());
             self.advance();
             return Ok(subscript);
         }
         self.expect(&Tok::Underscore)?;
         self.postfix()
     }

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (87257) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:42: expected Underscore, found Ident("_vars")
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (87270) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:33: expected Underscore, found Ident("_vars")

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
