*** crates/tla-syntax/src/parser.rs:834:28: replace != with == in Parser::tuple_or_action

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace != with == in Parser::tuple_or_action
@@ -826,17 +826,17 @@
             }
         }
     }
 
     fn tuple_or_action(&mut self) -> Result<Expr> {
         let items = self.bracketed(|p| p.expr_list(&Tok::RTup))?;
         self.expect(&Tok::RTup)?;
         if self.at_subscript() {
-            if items.len() != 1 {
+            if items.len() == /* ~ changed by cargo-mutants ~ */ 1 {
                 return Err(self.err("`<<A>>_v` takes a single action"));
             }
             let subscript = self.subscript()?;
             return Ok(Expr::ActionAngle {
                 action: Box::new(items.into_iter().next().expect("length checked")),
                 subscript: Box::new(subscript),
             });
         }

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (504058) panicked at crates/tla-syntax/tests/queries.rs:9:29:
parsing `<<A>>_v`: parse error at 1:6: `<<A>>_v` takes a single action

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
