*** crates/tla-syntax/src/parser.rs:849:9: replace Parser::at_subscript -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_subscript -> bool with true
@@ -841,21 +841,17 @@
             });
         }
         Ok(Expr::Tuple(items))
     }
 
     /// Is a `_v` subscript coming? Identifiers may begin with an underscore,
     /// so `[A]_vars` reaches the parser as one token, not two.
     fn at_subscript(&self) -> bool {
-        match self.peek() {
-            Tok::Underscore => true,
-            Tok::Ident(name) => name.starts_with('_'),
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The `v` of `[A]_v`, parsed tightly so it cannot swallow what follows.
     fn subscript(&mut self) -> Result<Expr> {
         if let Tok::Ident(name) = self.peek()
             && let Some(rest) = name.strip_prefix('_')
             && !rest.is_empty()
         {

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (504079) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: `<<A>>_v` takes a single action
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (504100) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `WF_<<a, b>>(Next)`: parse error at 1:12: `<<A>>_v` takes a single action

failures:
    a_fairness_subscript_may_be_a_tuple
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
