*** crates/tla-syntax/src/parser.rs:865:9: replace Parser::expr_list -> Result<Vec<Expr>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::expr_list -> Result<Vec<Expr>> with Ok(vec![])
@@ -857,38 +857,17 @@
                 }
                 _ => break,
             }
         }
         Ok(e)
     }
 
     fn expr_list(&mut self, close: &Tok) -> Result<Vec<Expr>> {
-        let mut out = Vec::new();
-        if self.peek() == close {
-            return Ok(out);
-        }
-        loop {
-            // `FoldSet(+, 0, S)` passes the operator itself, not an
-            // application of it. So does `apply(', v')`, where the operator is
-            // the prime.
-            if (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
-                && let Some(operator) = self.operator_by_symbol()
-            {
-                out.push(operator);
-                if !self.eat(&Tok::Comma) {
-                    return Ok(out);
-                }
-                continue;
-            }
-            out.push(self.expr(0)?);
-            if !self.eat(&Tok::Comma) {
-                return Ok(out);
-            }
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
         let symbol = match self.peek() {
             Tok::Op(op) => op.symbol(),
             Tok::Prime => "'",
             Tok::Kw(Kw::Enabled) => "ENABLED",

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1293713) panicked at crates/tla-syntax/tests/golden.rs:38:72:
BankTransfer.tla: parse error at 10:32: expected RParen, found Ident("Acct")

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1293714) panicked at crates/tla-syntax/tests/golden.rs:78:70:
RaftElection.tla: parse error at 8:20: expected RBrack, found Ident("s")

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
