*** crates/tla-syntax/src/parser.rs:873:55: replace || with && in Parser::expr_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::expr_list
@@ -865,17 +865,17 @@
         let mut out = Vec::new();
         if self.peek() == close {
             return Ok(out);
         }
         loop {
             // `FoldSet(+, 0, S)` passes the operator itself, not an
             // application of it. So does `apply(', v')`, where the operator is
             // the prime.
-            if (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
+            if (matches!(self.peek_at(1), Tok::Comma) && /* ~ changed by cargo-mutants ~ */ self.peek_at(1) == close)
                 && let Some(operator) = self.operator_by_symbol()
             {
                 out.push(operator);
                 if !self.eat(&Tok::Comma) {
                     return Ok(out);
                 }
                 continue;
             }

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (1294577) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an expression, found Op(Plus)
in:

---- operators_can_be_passed_by_symbol stdout ----

thread 'operators_can_be_passed_by_symbol' (1294586) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an expression, found Prime
in:

failures:
    an_operator_may_be_passed_as_an_argument
    operators_can_be_passed_by_symbol

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
