*** crates/tla-syntax/src/parser.rs:892:13: delete match arm Tok::Op(op) in Parser::operator_by_symbol

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(op) in Parser::operator_by_symbol
@@ -884,17 +884,17 @@
                 return Ok(out);
             }
         }
     }
 
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
         let symbol = match self.peek() {
-            Tok::Op(op) => op.symbol(),
+             /* ~ changed by cargo-mutants ~ */
             Tok::Prime => "'",
             Tok::Kw(Kw::Enabled) => "ENABLED",
             Tok::Kw(Kw::Unchanged) => "UNCHANGED",
             Tok::Kw(Kw::Domain) => "DOMAIN",
             Tok::Kw(Kw::Subset) => "SUBSET",
             Tok::Kw(Kw::Union) => "UNION",
             _ => return None,
         };

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (1297253) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an expression, found Op(Plus)
in:

---- operators_can_be_passed_by_symbol stdout ----

thread 'operators_can_be_passed_by_symbol' (1297262) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an expression, found Op(Cup)
in:

failures:
    an_operator_may_be_passed_as_an_argument
    operators_can_be_passed_by_symbol

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
