*** crates/tla-syntax/src/parser.rs:89:24: replace == with != in Parser::eat

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::eat
@@ -81,17 +81,17 @@
         let t = self.toks[self.pos].tok.clone();
         if self.pos + 1 < self.toks.len() {
             self.pos += 1;
         }
         t
     }
 
     fn eat(&mut self, tok: &Tok) -> bool {
-        if self.peek() == tok {
+        if self.peek() != /* ~ changed by cargo-mutants ~ */ tok {
             self.advance();
             true
         } else {
             false
         }
     }
 
     fn expect(&mut self, tok: &Tok) -> Result<()> {

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (428501) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:6: expected Kw(Module), found Kw(Module)
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (428498) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:6: expected Kw(Module), found Kw(Module)
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (428499) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:6: expected Kw(Module), found Kw(Module)
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
