*** crates/tla-syntax/src/parser.rs:929:18: replace != with == in Parser::bracket_form

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace != with == in Parser::bracket_form
@@ -921,17 +921,17 @@
                 })
             }
             Shape::Closed => {
                 let action = p.expr(0)?;
                 p.expect(&Tok::RBrack)?;
                 Ok(action)
             }
         })?;
-        if shape != Shape::Closed {
+        if shape == /* ~ changed by cargo-mutants ~ */ Shape::Closed {
             return Ok(inner);
         }
         let subscript = self.subscript()?;
         Ok(Expr::ActionBox {
             action: Box::new(inner),
             subscript: Box::new(subscript),
         })
     }

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (87580) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (87585) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected Underscore, found ModuleEnd
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (87593) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:23: expected Underscore, found Eof

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
