*** crates/tla-syntax/src/parser.rs:940:9: replace Parser::field_list -> Result<Vec<(String, Expr)>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::field_list -> Result<Vec<(String, Expr)>> with Ok(vec![])
@@ -932,25 +932,17 @@
         let subscript = self.subscript()?;
         Ok(Expr::ActionBox {
             action: Box::new(inner),
             subscript: Box::new(subscript),
         })
     }
 
     fn field_list(&mut self, sep: &Tok) -> Result<Vec<(String, Expr)>> {
-        let mut out = Vec::new();
-        loop {
-            let name = self.expect_ident()?;
-            self.expect(sep)?;
-            out.push((name, self.expr(0)?));
-            if !self.eat(&Tok::Comma) {
-                return Ok(out);
-            }
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn except_updates(&mut self) -> Result<Vec<(Vec<ExceptPath>, Expr)>> {
         let mut out = Vec::new();
         loop {
             self.expect(&Tok::Bang)?;
             let mut path = Vec::new();
             loop {

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (87959) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"msgs\")", line: 10, col: 9 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (87963) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"msgs\")", line: 10, col: 9 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (87966) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"type\")", line: 9, col: 4 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
