*** crates/tla-syntax/src/parser.rs:974:16: delete ! in Parser::field_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::field_list
@@ -966,17 +966,17 @@
     }
 
     fn field_list(&mut self, sep: &Tok) -> Result<Vec<(String, Expr)>> {
         let mut out = Vec::new();
         loop {
             let name = self.expect_ident()?;
             self.expect(sep)?;
             out.push((name, self.expr(0)?));
-            if !self.eat(&Tok::Comma) {
+            if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     fn except_updates(&mut self) -> Result<Vec<(Vec<ExceptPath>, Expr)>> {
         let mut out = Vec::new();
         loop {

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (982391) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"rmState\")", line: 10, col: 22 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (982395) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"rmState\")", line: 10, col: 22 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (982396) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"bal\")", line: 13, col: 24 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
