*** crates/tla-syntax/src/parser.rs:976:16: delete ! in Parser::except_updates

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::except_updates
@@ -968,17 +968,17 @@
                     break;
                 }
             }
             if path.is_empty() {
                 return Err(self.err("EXCEPT update needs a `[...]` or `.field` path"));
             }
             self.expect(&Tok::Op(Op::Eq))?;
             out.push((path, self.expr(0)?));
-            if !self.eat(&Tok::Comma) {
+            if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     fn bounds(&mut self, terminator: &Tok) -> Result<Vec<Bound>> {
         let mut out = Vec::new();
         loop {

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (89662) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:29: expected Bang, found RBrack
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (89670) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:22: expected Bang, found RBrack

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
