*** crates/tla-syntax/src/parser.rs:981:9: replace Parser::except_updates -> Result<Vec<(Vec<ExceptPath>, Expr)>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::except_updates -> Result<Vec<(Vec<ExceptPath>, Expr)>> with Ok(vec![])
@@ -973,44 +973,17 @@
             out.push((name, self.expr(0)?));
             if !self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     fn except_updates(&mut self) -> Result<Vec<(Vec<ExceptPath>, Expr)>> {
-        let mut out = Vec::new();
-        loop {
-            self.expect(&Tok::Bang)?;
-            let mut path = Vec::new();
-            loop {
-                if self.eat(&Tok::LBrack) {
-                    let indices = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
-                    self.expect(&Tok::RBrack)?;
-                    path.push(ExceptPath::Index(if indices.len() == 1 {
-                        indices.into_iter().next().expect("length checked")
-                    } else {
-                        Expr::Tuple(indices)
-                    }));
-                } else if self.eat(&Tok::Dot) {
-                    path.push(ExceptPath::Field(self.expect_ident()?));
-                } else {
-                    break;
-                }
-            }
-            if path.is_empty() {
-                return Err(self.err("EXCEPT update needs a `[...]` or `.field` path"));
-            }
-            self.expect(&Tok::Op(Op::Eq))?;
-            out.push((path, self.expr(0)?));
-            if !self.eat(&Tok::Comma) {
-                return Ok(out);
-            }
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn bounds(&mut self, terminator: &Tok) -> Result<Vec<Bound>> {
         let mut out = Vec::new();
         loop {
             let mut destructure = false;
             let mut names = Vec::new();
             if self.eat(&Tok::LTup) {

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (509555) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:18: expected RBrack, found Bang
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (509563) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:11: expected RBrack, found Bang

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
