*** crates/tla-syntax/src/parser.rs:989:66: replace == with != in Parser::except_updates

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::except_updates
@@ -981,17 +981,17 @@
         let mut out = Vec::new();
         loop {
             self.expect(&Tok::Bang)?;
             let mut path = Vec::new();
             loop {
                 if self.eat(&Tok::LBrack) {
                     let indices = self.bracketed(|p| p.expr_list(&Tok::RBrack))?;
                     self.expect(&Tok::RBrack)?;
-                    path.push(ExceptPath::Index(if indices.len() == 1 {
+                    path.push(ExceptPath::Index(if indices.len() != /* ~ changed by cargo-mutants ~ */ 1 {
                         indices.into_iter().next().expect("length checked")
                     } else {
                         Expr::Tuple(indices)
                     }));
                 } else if self.eat(&Tok::Dot) {
                     path.push(ExceptPath::Field(self.expect_ident()?));
                 } else {
                     break;

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (510801) panicked at crates/tla-syntax/tests/grammar.rs:258:9:
assertion `left == right` failed: `[f EXCEPT ![a, b] = v]` printed as `[f EXCEPT ![a] = v]`
  left: Except { base: Ident("f"), updates: [([Index(Ident("a"))], Ident("v"))] }
 right: Except { base: Ident("f"), updates: [([Index(Tuple([Ident("a")]))], Ident("v"))] }

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
