*** crates/tla-syntax/src/print.rs:102:37: replace match guard op.is_postfix() with false in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace match guard op.is_postfix() with false in bare
@@ -94,17 +94,17 @@
         } => {
             write!(f, "{instance}!{name}")?;
             if args.is_empty() {
                 Ok(())
             } else {
                 write!(f, "({})", list(args))
             }
         }
-        Expr::Unary(op, operand) if op.is_postfix() => {
+        Expr::Unary(op, operand) if false /* ~ changed by cargo-mutants ~ */ => {
             write(operand, ATOM, f)?;
             f.write_str(op.symbol())
         }
         Expr::Unary(op, operand) => {
             f.write_str(op.symbol())?;
             if op.is_word() {
                 f.write_str(" ")?;
             }

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (552806) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading `^+S \cup T`: parse error at 1:1: expected an expression, found Op(User("^+"))

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
