*** crates/tla-syntax/src/print.rs:116:23: replace + with * in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace + with * in bare
@@ -108,17 +108,17 @@
             if op.is_word() {
                 f.write_str(" ")?;
             }
             write(operand, op.prefix_prec(), f)
         }
         Expr::Binary(op, lhs, rhs) => {
             let prec = op.infix_prec().unwrap_or(TRAILING);
             let (left, right) = if op.is_right_assoc() {
-                (prec + 1, prec)
+                (prec * /* ~ changed by cargo-mutants ~ */ 1, prec)
             } else {
                 (prec, prec + 1)
             };
             write(lhs, left, f)?;
             write!(f, " {} ", op.symbol())?;
             write(rhs, right, f)
         }
         Expr::Tuple(items) => write!(f, "<<{}>>", list(items)),

*** result: Success
