*** crates/tla-syntax/src/print.rs:118:29: replace + with - in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace + with - in bare
@@ -110,17 +110,17 @@
             }
             write(operand, op.prefix_prec(), f)
         }
         Expr::Binary(op, lhs, rhs) => {
             let prec = op.infix_prec().unwrap_or(TRAILING);
             let (left, right) = if op.is_right_assoc() {
                 (prec + 1, prec)
             } else {
-                (prec, prec + 1)
+                (prec, prec - /* ~ changed by cargo-mutants ~ */ 1)
             };
             write(lhs, left, f)?;
             write!(f, " {} ", op.symbol())?;
             write(rhs, right, f)
         }
         Expr::Tuple(items) => write!(f, "<<{}>>", list(items)),
         Expr::SetEnum(items) => write!(f, "{{{}}}", list(items)),
         Expr::SetFilter { bound, pred } => write!(f, "{{{bound} : {pred}}}"),

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (117143) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
