*** crates/tla-syntax/src/print.rs:137:22: replace > with < in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with < in bare
@@ -129,17 +129,17 @@
         Expr::RecordSet(fields) => write!(f, "[{}]", fields_list(fields, ":")),
         Expr::FnDef { bounds, body } => {
             write!(f, "[{} |-> {body}]", bounds_list(bounds))
         }
         Expr::FnSet { domain, range } => write!(f, "[{domain} -> {range}]"),
         Expr::Except { base, updates } => {
             write!(f, "[{base} EXCEPT ")?;
             for (i, (path, value)) in updates.iter().enumerate() {
-                if i > 0 {
+                if i < /* ~ changed by cargo-mutants ~ */ 0 {
                     f.write_str(", ")?;
                 }
                 f.write_str("!")?;
                 for step in path {
                     match step {
                         ExceptPath::Index(index) => write!(f, "[{index}]")?,
                         ExceptPath::Field(name) => write!(f, ".{name}")?,
                     }

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (118325) panicked at crates/tla-syntax/tests/parse_specs.rs:168:37:
BankTransfer.tla: Transfer printed as `from # to /\ bal[from] >= amt /\ bal' = [bal EXCEPT ![from] = @ - amt![to] = @ + amt]`: parse error at 1:71: expected an identifier, found LBrack

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
