*** crates/tla-syntax/src/print.rs:137:22: replace > with >= in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with >= in bare
@@ -129,17 +129,17 @@
         Expr::RecordSet(fields) => write!(f, "[{}]", fields_list(fields, ":")),
         Expr::FnDef { bounds, body } => {
             write!(f, "[{} |-> {body}]", bounds_list(bounds))
         }
         Expr::FnSet { domain, range } => write!(f, "[{domain} -> {range}]"),
         Expr::Except { base, updates } => {
             write!(f, "[{base} EXCEPT ")?;
             for (i, (path, value)) in updates.iter().enumerate() {
-                if i > 0 {
+                if i >= /* ~ changed by cargo-mutants ~ */ 0 {
                     f.write_str(", ")?;
                 }
                 f.write_str("!")?;
                 for step in path {
                     match step {
                         ExceptPath::Index(index) => write!(f, "[{index}]")?,
                         ExceptPath::Field(name) => write!(f, ".{name}")?,
                     }

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1035100) panicked at crates/tla-syntax/tests/grammar.rs:260:33:
re-reading `[f EXCEPT , ![<<a, b>>] = v]`: parse error at 1:11: expected Bang, found Comma

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
