*** crates/tla-syntax/src/print.rs:164:22: replace > with == in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with == in bare
@@ -156,17 +156,17 @@
                 QuantKind::TemporalExists => Op::TemporalExists,
             };
             write!(f, "{} {} : {body}", symbol.symbol(), bounds_list(bounds))
         }
         Expr::Choose { bound, body } => write!(f, "CHOOSE {bound} : {body}"),
         Expr::Let { defs, body } => {
             f.write_str("LET ")?;
             for (i, def) in defs.iter().enumerate() {
-                if i > 0 {
+                if i == /* ~ changed by cargo-mutants ~ */ 0 {
                     f.write_str(" ")?;
                 }
                 write!(f, "{def}")?;
             }
             write!(f, " IN {body}")
         }
         Expr::If {
             cond,

---- every_shape_of_expression_survives_printing stdout ----

thread 'every_shape_of_expression_survives_printing' (1035985) panicked at crates/tla-syntax/tests/printing.rs:12:29:
`LET a == 1 b == 2 IN a + b` printed as `LET  a == 1b == 2 IN a + b`, which failed: parse error at 1:15: expected a definition inside LET

failures:
    every_shape_of_expression_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
