*** crates/tla-syntax/src/print.rs:179:22: replace > with == in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with == in bare
@@ -171,17 +171,17 @@
         Expr::If {
             cond,
             then,
             otherwise,
         } => write!(f, "IF {cond} THEN {then} ELSE {otherwise}"),
         Expr::Case { arms, other } => {
             f.write_str("CASE ")?;
             for (i, (guard, result)) in arms.iter().enumerate() {
-                if i > 0 {
+                if i == /* ~ changed by cargo-mutants ~ */ 0 {
                     f.write_str(" [] ")?;
                 }
                 write!(f, "{guard} -> {result}")?;
             }
             match other {
                 Some(value) => write!(f, " [] OTHER -> {value}"),
                 None => Ok(()),
             }

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (121036) panicked at crates/tla-syntax/tests/grammar.rs:258:9:
assertion `left == right` failed: `CASE n = 1 -> "a" [] OTHER -> "b"` printed as `CASE  [] n = 1 -> "a" [] OTHER -> "b"`
  left: Case { arms: [(Binary(Eq, Ident("n"), Num(1)), Str("a"))], other: Some(Str("b")) }
 right: Case { arms: [(Unary(Always, Binary(Eq, Ident("n"), Num(1))), Str("a"))], other: Some(Str("b")) }

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
