*** crates/tla-syntax/src/print.rs:206:12: delete ! in <impl fmt::Display for Def>::fmt

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete ! in <impl fmt::Display for Def>::fmt
@@ -198,17 +198,17 @@
             write!(f, "{kind}_{subscript}({action})")
         }
     }
 }
 
 impl fmt::Display for Def {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
-        if !self.params.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */self.params.is_empty() {
             write!(f, "({})", params_list(&self.params))?;
         }
         write!(f, " == {}", self.body)
     }
 }
 
 impl fmt::Display for Param {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1040462) panicked at crates/tla-syntax/tests/parse_specs.rs:168:37:
BankTransfer.tla: SumOver printed as `IF S = {} THEN 0 ELSE LET x() == CHOOSE y \in S : TRUE IN bal[x] + SumOver(S \ {x})`: parse error at 1:29: expected an identifier, found RParen

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
