*** crates/tla-syntax/src/print.rs:215:9: replace <impl fmt::Display for Param>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace <impl fmt::Display for Param>::fmt -> fmt::Result with Ok(Default::default())
@@ -207,22 +207,17 @@
             write!(f, "({})", params_list(&self.params))?;
         }
         write!(f, " == {}", self.body)
     }
 }
 
 impl fmt::Display for Param {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.name)?;
-        if self.arity > 0 {
-            let holes = vec!["_"; self.arity].join(", ");
-            write!(f, "({holes})")?;
-        }
-        Ok(())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn params_list(params: &[Param]) -> String {
     params
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (563612) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading `Apply(LAMBDA ,  : x + y, 1)`: parse error at 1:14: expected an identifier, found Comma

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
