*** crates/tla-syntax/src/print.rs:216:23: replace > with == in <impl fmt::Display for Param>::fmt

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with == in <impl fmt::Display for Param>::fmt
@@ -208,17 +208,17 @@
         }
         write!(f, " == {}", self.body)
     }
 }
 
 impl fmt::Display for Param {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
-        if self.arity > 0 {
+        if self.arity == /* ~ changed by cargo-mutants ~ */ 0 {
             let holes = vec!["_"; self.arity].join(", ");
             write!(f, "({holes})")?;
         }
         Ok(())
     }
 }
 
 fn params_list(params: &[Param]) -> String {

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (563913) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading `Apply(LAMBDA x(), y() : x + y, 1)`: parse error at 1:16: expected an identifier, found RParen

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
