*** crates/tla-syntax/src/print.rs:216:23: replace > with < in <impl fmt::Display for Param>::fmt

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with < in <impl fmt::Display for Param>::fmt
@@ -208,17 +208,17 @@
         }
         write!(f, " == {}", self.body)
     }
 }
 
 impl fmt::Display for Param {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
-        if self.arity > 0 {
+        if self.arity < /* ~ changed by cargo-mutants ~ */ 0 {
             let holes = vec!["_"; self.arity].join(", ");
             write!(f, "({holes})")?;
         }
         Ok(())
     }
 }
 
 fn params_list(params: &[Param]) -> String {

*** result: Success
