*** crates/tla-syntax/src/print.rs:21:9: replace <impl fmt::Display for Expr>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace <impl fmt::Display for Expr>::fmt -> fmt::Result with Ok(Default::default())
@@ -13,17 +13,17 @@
 /// The binding power of the constructs that run to the end of the expression.
 /// They are parenthesized inside any operator, which is what makes
 /// `(\A x \in S : P) /\ Q` come back as itself.
 const TRAILING: u8 = 0;
 const ATOM: u8 = u8::MAX;
 
 impl fmt::Display for Expr {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write(self, TRAILING, f)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Bound {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         if self.destructure {
             write!(f, "<<{}>>", self.names.join(", "))?;
         } else {

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (541916) panicked at crates/tla-syntax/tests/grammar.rs:220:5:
assertion `left == right` failed
  left: ""
 right: "x = 1 /\\ y = 2"

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (541921) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading ``: parse error at 1:1: expected an expression, found Eof

failures:
    labels_are_read_and_dropped
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
