*** crates/tla-syntax/src/print.rs:225:5: replace params_list -> String with String::new()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace params_list -> String with String::new()
@@ -217,21 +217,17 @@
             let holes = vec!["_"; self.arity].join(", ");
             write!(f, "({holes})")?;
         }
         Ok(())
     }
 }
 
 fn params_list(params: &[Param]) -> String {
-    params
-        .iter()
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn list(items: &[Expr]) -> String {
     items
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (565742) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading `Apply(LAMBDA  : x + y, 1)`: parse error at 1:15: expected an identifier, found Colon

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
