*** crates/tla-syntax/src/print.rs:225:5: replace params_list -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace params_list -> String with "xyzzy".into()
@@ -217,21 +217,17 @@
             let holes = vec!["_"; self.arity].join(", ");
             write!(f, "({holes})")?;
         }
         Ok(())
     }
 }
 
 fn params_list(params: &[Param]) -> String {
-    params
-        .iter()
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn list(items: &[Expr]) -> String {
     items
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (125025) panicked at crates/tla-syntax/tests/grammar.rs:258:9:
assertion `left == right` failed: `Apply(LAMBDA x, y : x + y, 1)` printed as `Apply(LAMBDA xyzzy : x + y, 1)`
  left: Apply(Ident("Apply"), [Lambda { params: [Param { name: "x", arity: 0 }, Param { name: "y", arity: 0 }], body: Binary(Plus, Ident("x"), Ident("y")) }, Num(1)])
 right: Apply(Ident("Apply"), [Lambda { params: [Param { name: "xyzzy", arity: 0 }], body: Binary(Plus, Ident("x"), Ident("y")) }, Num(1)])

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
