*** crates/tla-syntax/src/print.rs:249:5: replace fields_list -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace fields_list -> String with "xyzzy".into()
@@ -241,14 +241,10 @@
     bounds
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 fn fields_list(fields: &[(String, Expr)], separator: &str) -> String {
-    fields
-        .iter()
-        .map(|(name, value)| format!("{name} {separator} {value}"))
-        .collect::<Vec<_>>()
-        .join(", ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1049266) panicked at crates/tla-syntax/tests/parse_specs.rs:168:37:
Paxos.tla: Message printed as `[xyzzy] \cup [xyzzy] \cup [xyzzy] \cup [xyzzy]`: parse error at 1:9: expected Underscore, found Op(Cup)

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
