*** crates/tla-syntax/src/print.rs:27:9: replace <impl fmt::Display for Bound>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace <impl fmt::Display for Bound>::fmt -> fmt::Result with Ok(Default::default())
@@ -19,25 +19,17 @@
 impl fmt::Display for Expr {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write(self, TRAILING, f)
     }
 }
 
 impl fmt::Display for Bound {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        if self.destructure {
-            write!(f, "<<{}>>", self.names.join(", "))?;
-        } else {
-            f.write_str(&self.names.join(", "))?;
-        }
-        match &self.domain {
-            Some(domain) => write!(f, " \\in {domain}"),
-            None => Ok(()),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
     match e {
         Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
         Expr::Unary(op, _) if op.is_postfix() => ATOM,
         Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (542581) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading `\EE  : Timer(t)`: parse error at 1:6: expected an identifier, found Colon

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
