*** crates/tla-syntax/src/print.rs:335:9: replace <impl fmt::Display for LetInstance>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace <impl fmt::Display for LetInstance>::fmt -> fmt::Result with Ok(Default::default())
@@ -327,29 +327,17 @@
             Unit::Inner(module) => write!(f, "{module}"),
             Unit::Opaque => Ok(()),
         }
     }
 }
 
 impl fmt::Display for LetInstance {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        if let Some(name) = &self.name {
-            write!(f, "{name} == ")?;
-        }
-        write!(f, "INSTANCE {}", self.module)?;
-        if !self.subs.is_empty() {
-            let with: Vec<String> = self
-                .subs
-                .iter()
-                .map(|(name, value)| format!("{name} <- {value}"))
-                .collect();
-            write!(f, " WITH {}", with.join(", "))?;
-        }
-        Ok(())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Decl {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
         if self.arity > 0 {
             write!(f, "({})", vec!["_"; self.arity].join(", "))?;

*** result: Success
