*** crates/tla-syntax/src/print.rs:40:5: replace precedence -> u8 with 0

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace precedence -> u8 with 0
@@ -32,28 +32,17 @@
         match &self.domain {
             Some(domain) => write!(f, " \\in {domain}"),
             None => Ok(()),
         }
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
-    match e {
-        Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
-        Expr::Unary(op, _) if op.is_postfix() => ATOM,
-        Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),
-        Expr::Quant { .. }
-        | Expr::Choose { .. }
-        | Expr::Let { .. }
-        | Expr::If { .. }
-        | Expr::Case { .. }
-        | Expr::Lambda { .. } => TRAILING,
-        _ => ATOM,
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn write(e: &Expr, min: u8, f: &mut fmt::Formatter<'_>) -> fmt::Result {
     if precedence(e) < min {
         write!(f, "(")?;
         write(e, TRAILING, f)?;
         return write!(f, ")");
     }

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (110377) panicked at crates/tla-syntax/tests/grammar.rs:220:5:
assertion `left == right` failed
  left: "((x) = (1)) /\\ ((y) = (2))"
 right: "x = 1 /\\ y = 2"

failures:
    labels_are_read_and_dropped

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
