*** crates/tla-syntax/src/print.rs:42:31: replace match guard op.is_postfix() with false in precedence

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace match guard op.is_postfix() with false in precedence
@@ -34,17 +34,17 @@
             None => Ok(()),
         }
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
     match e {
         Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
-        Expr::Unary(op, _) if op.is_postfix() => ATOM,
+        Expr::Unary(op, _) if false /* ~ changed by cargo-mutants ~ */ => ATOM,
         Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),
         Expr::Quant { .. }
         | Expr::Choose { .. }
         | Expr::Let { .. }
         | Expr::If { .. }
         | Expr::Case { .. }
         | Expr::Lambda { .. } => TRAILING,
         _ => ATOM,

*** result: Success
