*** crates/tla-syntax/src/print.rs:43:9: delete match arm Expr::Unary(op, _) in precedence

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete match arm Expr::Unary(op, _) in precedence
@@ -35,17 +35,17 @@
         }
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
     match e {
         Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
         Expr::Unary(op, _) if op.is_postfix() => ATOM,
-        Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),
+         /* ~ changed by cargo-mutants ~ */
         Expr::Quant { .. }
         | Expr::Choose { .. }
         | Expr::Let { .. }
         | Expr::If { .. }
         | Expr::Case { .. }
         | Expr::Lambda { .. } => TRAILING,
         _ => ATOM,
     }

*** result: Success
