*** crates/tla-syntax/src/print.rs:44:9: delete match arm Expr::Quant{..} | Expr::Choose{..} | Expr::Let{..} | Expr::If{..} | Expr::Case{..} | Expr::Lambda{..} in precedence

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete match arm Expr::Quant{..} | Expr::Choose{..} | Expr::Let{..} | Expr::If{..} | Expr::Case{..} | Expr::Lambda{..} in precedence
@@ -36,22 +36,17 @@
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
     match e {
         Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
         Expr::Unary(op, _) if op.is_postfix() => ATOM,
         Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),
-        Expr::Quant { .. }
-        | Expr::Choose { .. }
-        | Expr::Let { .. }
-        | Expr::If { .. }
-        | Expr::Case { .. }
-        | Expr::Lambda { .. } => TRAILING,
+         /* ~ changed by cargo-mutants ~ */
         _ => ATOM,
     }
 }
 
 fn write(e: &Expr, min: u8, f: &mut fmt::Formatter<'_>) -> fmt::Result {
     if precedence(e) < min {
         write!(f, "(")?;
         write(e, TRAILING, f)?;

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1023986) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
