*** crates/tla-syntax/src/print.rs:55:5: replace write -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace write -> fmt::Result with Ok(Default::default())
@@ -47,22 +47,17 @@
         | Expr::If { .. }
         | Expr::Case { .. }
         | Expr::Lambda { .. } => TRAILING,
         _ => ATOM,
     }
 }
 
 fn write(e: &Expr, min: u8, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-    if precedence(e) < min {
-        write!(f, "(")?;
-        write(e, TRAILING, f)?;
-        return write!(f, ")");
-    }
-    bare(e, f)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[expect(
     clippy::too_many_lines,
     reason = "one arm per syntactic form; splitting it would only scatter the grammar"
 )]
 fn bare(e: &Expr, f: &mut fmt::Formatter<'_>) -> fmt::Result {
     match e {

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (113636) panicked at crates/tla-syntax/tests/grammar.rs:220:5:
assertion `left == right` failed
  left: ""
 right: "x = 1 /\\ y = 2"

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (113641) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
re-reading ``: parse error at 1:1: expected an expression, found Eof

failures:
    labels_are_read_and_dropped
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
