*** crates/tla-syntax/src/print.rs:68:5: replace bare -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace bare -> fmt::Result with Ok(Default::default())
@@ -60,149 +60,17 @@
     bare(e, f)
 }
 
 #[expect(
     clippy::too_many_lines,
     reason = "one arm per syntactic form; splitting it would only scatter the grammar"
 )]
 fn bare(e: &Expr, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-    match e {
-        Expr::Num(n) => write!(f, "{n}"),
-        Expr::Str(s) => write!(f, "\"{}\"", s.replace('\\', "\\\\").replace('"', "\\\"")),
-        Expr::Bool(b) => f.write_str(if *b { "TRUE" } else { "FALSE" }),
-        Expr::Ident(name) => f.write_str(name),
-        Expr::At => f.write_str("@"),
-        Expr::Prime(inner) => {
-            write(inner, ATOM, f)?;
-            f.write_str("'")
-        }
-        Expr::Apply(head, args) => {
-            write(head, ATOM, f)?;
-            write!(f, "({})", list(args))
-        }
-        Expr::FnApply(head, args) => {
-            write(head, ATOM, f)?;
-            write!(f, "[{}]", list(args))
-        }
-        Expr::Field(inner, name) => {
-            write(inner, ATOM, f)?;
-            write!(f, ".{name}")
-        }
-        Expr::Qualified {
-            instance,
-            name,
-            args,
-        } => {
-            write!(f, "{instance}!{name}")?;
-            if args.is_empty() {
-                Ok(())
-            } else {
-                write!(f, "({})", list(args))
-            }
-        }
-        Expr::Unary(op, operand) if op.is_postfix() => {
-            write(operand, ATOM, f)?;
-            f.write_str(op.symbol())
-        }
-        Expr::Unary(op, operand) => {
-            f.write_str(op.symbol())?;
-            if op.is_word() {
-                f.write_str(" ")?;
-            }
-            write(operand, op.prefix_prec(), f)
-        }
-        Expr::Binary(op, lhs, rhs) => {
-            let prec = op.infix_prec().unwrap_or(TRAILING);
-            let (left, right) = if op.is_right_assoc() {
-                (prec + 1, prec)
-            } else {
-                (prec, prec + 1)
-            };
-            write(lhs, left, f)?;
-            write!(f, " {} ", op.symbol())?;
-            write(rhs, right, f)
-        }
-        Expr::Tuple(items) => write!(f, "<<{}>>", list(items)),
-        Expr::SetEnum(items) => write!(f, "{{{}}}", list(items)),
-        Expr::SetFilter { bound, pred } => write!(f, "{{{bound} : {pred}}}"),
-        Expr::SetMap { expr, bounds } => write!(f, "{{{expr} : {}}}", bounds_list(bounds)),
-        Expr::Record(fields) => write!(f, "[{}]", fields_list(fields, "|->")),
-        Expr::RecordSet(fields) => write!(f, "[{}]", fields_list(fields, ":")),
-        Expr::FnDef { bounds, body } => {
-            write!(f, "[{} |-> {body}]", bounds_list(bounds))
-        }
-        Expr::FnSet { domain, range } => write!(f, "[{domain} -> {range}]"),
-        Expr::Except { base, updates } => {
-            write!(f, "[{base} EXCEPT ")?;
-            for (i, (path, value)) in updates.iter().enumerate() {
-                if i > 0 {
-                    f.write_str(", ")?;
-                }
-                f.write_str("!")?;
-                for step in path {
-                    match step {
-                        ExceptPath::Index(index) => write!(f, "[{index}]")?,
-                        ExceptPath::Field(name) => write!(f, ".{name}")?,
-                    }
-                }
-                write!(f, " = {value}")?;
-            }
-            f.write_str("]")
-        }
-        Expr::Quant { kind, bounds, body } => {
-            let symbol = match kind {
-                QuantKind::Forall => Op::Forall,
-                QuantKind::Exists => Op::Exists,
-                QuantKind::TemporalForall => Op::TemporalForall,
-                QuantKind::TemporalExists => Op::TemporalExists,
-            };
-            write!(f, "{} {} : {body}", symbol.symbol(), bounds_list(bounds))
-        }
-        Expr::Choose { bound, body } => write!(f, "CHOOSE {bound} : {body}"),
-        Expr::Let { defs, body } => {
-            f.write_str("LET ")?;
-            for (i, def) in defs.iter().enumerate() {
-                if i > 0 {
-                    f.write_str(" ")?;
-                }
-                write!(f, "{def}")?;
-            }
-            write!(f, " IN {body}")
-        }
-        Expr::If {
-            cond,
-            then,
-            otherwise,
-        } => write!(f, "IF {cond} THEN {then} ELSE {otherwise}"),
-        Expr::Case { arms, other } => {
-            f.write_str("CASE ")?;
-            for (i, (guard, result)) in arms.iter().enumerate() {
-                if i > 0 {
-                    f.write_str(" [] ")?;
-                }
-                write!(f, "{guard} -> {result}")?;
-            }
-            match other {
-                Some(value) => write!(f, " [] OTHER -> {value}"),
-                None => Ok(()),
-            }
-        }
-        Expr::Lambda { params, body } => write!(f, "LAMBDA {} : {body}", params_list(params)),
-        Expr::ActionBox { action, subscript } => write!(f, "[{action}]_{subscript}"),
-        Expr::ActionAngle { action, subscript } => write!(f, "<<{action}>>_{subscript}"),
-        Expr::Fairness {
-            strong,
-            subscript,
-            action,
-        } => {
-            let kind = if *strong { "SF" } else { "WF" };
-            write!(f, "{kind}_{subscript}({action})")
-        }
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 impl fmt::Display for Def {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
         if !self.params.is_empty() {
             write!(f, "({})", params_list(&self.params))?;
         }

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (1028021) panicked at crates/tla-syntax/tests/grammar.rs:223:5:
assertion `left == right` failed
  left: ""
 right: "x = 1 /\\ y = 2"

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1028033) panicked at crates/tla-syntax/tests/grammar.rs:260:33:
re-reading ``: parse error at 1:1: expected an expression, found Eof

failures:
    labels_are_read_and_dropped
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
