*** crates/tla-syntax/src/token.rs:207:9: replace Op::infix_prec -> Option<u8> with None

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::infix_prec -> Option<u8> with None
@@ -199,48 +199,17 @@
 
 impl Op {
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
-        Some(match self {
-            Self::Implies => 1,
-            Self::Equiv | Self::LeadsTo => 2,
-            Self::Or => 3,
-            Self::And => 4,
-            Self::Eq
-            | Self::Neq
-            | Self::Lt
-            | Self::Gt
-            | Self::Le
-            | Self::Ge
-            | Self::In
-            | Self::NotIn
-            | Self::Subseteq
-            | Self::Supseteq => 5,
-            Self::AtAt => 6,
-            Self::OneTo => 7,
-            Self::Cup | Self::Cap | Self::SetMinus => 8,
-            Self::DotDot => 9,
-            Self::Plus | Self::Minus => 10,
-            Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
-            Self::Concat => 12,
-            Self::Pow => 13,
-            Self::User(_) if self.is_postfix() => return None,
-            Self::User(symbol) => {
-                return USER_OPERATORS
-                    .iter()
-                    .find(|(name, _)| *name == symbol)
-                    .map(|(_, prec)| *prec);
-            }
-            _ => return None,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
         matches!(self, Self::User("^+" | "^*" | "^#"))
     }

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (1073597) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:30: expected RParen, found Op(Plus)
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (1073600) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (1073596) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an identifier, found Num(1)
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    set_filters_and_set_maps_are_told_apart

test result: FAILED. 10 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
