*** crates/tla-syntax/src/token.rs:207:9: replace Op::infix_prec -> Option<u8> with Some(0)

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::infix_prec -> Option<u8> with Some(0)
@@ -199,48 +199,17 @@
 
 impl Op {
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
-        Some(match self {
-            Self::Implies => 1,
-            Self::Equiv | Self::LeadsTo => 2,
-            Self::Or => 3,
-            Self::And => 4,
-            Self::Eq
-            | Self::Neq
-            | Self::Lt
-            | Self::Gt
-            | Self::Le
-            | Self::Ge
-            | Self::In
-            | Self::NotIn
-            | Self::Subseteq
-            | Self::Supseteq => 5,
-            Self::AtAt => 6,
-            Self::OneTo => 7,
-            Self::Cup | Self::Cap | Self::SetMinus => 8,
-            Self::DotDot => 9,
-            Self::Plus | Self::Minus => 10,
-            Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
-            Self::Concat => 12,
-            Self::Pow => 13,
-            Self::User(_) if self.is_postfix() => return None,
-            Self::User(symbol) => {
-                return USER_OPERATORS
-                    .iter()
-                    .find(|(name, _)| *name == symbol)
-                    .map(|(_, prec)| *prec);
-            }
-            _ => return None,
-        })
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
         matches!(self, Self::User("^+" | "^*" | "^#"))
     }

---- case_arms_are_separated_by_boxes stdout ----

thread 'case_arms_are_separated_by_boxes' (1073810) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:40: expected a declaration, found Arrow
in:

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (1073814) panicked at crates/tla-syntax/tests/grammar.rs:223:5:
assertion `left == right` failed
  left: "x = 1 /\\ (y = 2)"
 right: "x = 1 /\\ y = 2"

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1073819) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `CASE n = 1 -> "a" [] OTHER -> "b"`: parse error at 1:22: expected an expression, found Kw(Other)

failures:
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    the_new_forms_round_trip

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
