*** crates/tla-syntax/src/token.rs:209:13: delete match arm Self::Equiv | Self::LeadsTo in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Equiv | Self::LeadsTo in Op::infix_prec
@@ -201,17 +201,17 @@
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
         Some(match self {
             Self::Implies => 1,
-            Self::Equiv | Self::LeadsTo => 2,
+             /* ~ changed by cargo-mutants ~ */
             Self::Or => 3,
             Self::And => 4,
             Self::Eq
             | Self::Neq
             | Self::Lt
             | Self::Gt
             | Self::Le
             | Self::Ge

---- every_infix_operator_survives_printing stdout ----

thread 'every_infix_operator_survives_printing' (1076540) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `a <=> b`: parse error at 1:3: unexpected Op(Equiv) after the expression

failures:
    every_infix_operator_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
