*** crates/tla-syntax/src/token.rs:210:13: delete match arm Self::Or in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Or in Op::infix_prec
@@ -202,17 +202,17 @@
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
         Some(match self {
             Self::Implies => 1,
             Self::Equiv | Self::LeadsTo => 2,
-            Self::Or => 3,
+             /* ~ changed by cargo-mutants ~ */
             Self::And => 4,
             Self::Eq
             | Self::Neq
             | Self::Lt
             | Self::Gt
             | Self::Le
             | Self::Ge
             | Self::In

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (143554) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BoundedBuffer.tla: parse error at 34:1: expected DefEq, found Ident("Spec")

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (143552) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected an identifier, found Op(Exists)", line: 70, col: 38 }

---- module_name_and_extends stdout ----

thread 'module_name_and_extends' (143557) panicked at crates/tla-syntax/tests/parse_specs.rs:39:49:
parses: Error { stage: Parse, message: "expected an identifier, found Op(Exists)", line: 70, col: 38 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
