*** crates/tla-syntax/src/token.rs:211:13: delete match arm Self::And in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::And in Op::infix_prec
@@ -203,17 +203,17 @@
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
         Some(match self {
             Self::Implies => 1,
             Self::Equiv | Self::LeadsTo => 2,
             Self::Or => 3,
-            Self::And => 4,
+             /* ~ changed by cargo-mutants ~ */
             Self::Eq
             | Self::Neq
             | Self::Lt
             | Self::Gt
             | Self::Le
             | Self::Ge
             | Self::In
             | Self::NotIn

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (596881) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 23:17: expected an identifier, found Op(Always)

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (596879) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected DefEq, found Dot", line: 49, col: 42 }

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (596878) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected DefEq, found Op(Eq)", line: 16, col: 50 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
