*** crates/tla-syntax/src/token.rs:222:13: delete match arm Self::AtAt in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::AtAt in Op::infix_prec
@@ -214,17 +214,17 @@
             | Self::Lt
             | Self::Gt
             | Self::Le
             | Self::Ge
             | Self::In
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
-            Self::AtAt => 6,
+             /* ~ changed by cargo-mutants ~ */
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,

---- every_infix_operator_survives_printing stdout ----

thread 'every_infix_operator_survives_printing' (1079470) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `a @@ b`: parse error at 1:3: unexpected Op(AtAt) after the expression

failures:
    every_infix_operator_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
