*** crates/tla-syntax/src/token.rs:223:13: delete match arm Self::OneTo in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::OneTo in Op::infix_prec
@@ -215,17 +215,17 @@
             | Self::Gt
             | Self::Le
             | Self::Ge
             | Self::In
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
-            Self::OneTo => 7,
+             /* ~ changed by cargo-mutants ~ */
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {

*** result: Success
