*** crates/tla-syntax/src/token.rs:224:13: delete match arm Self::Cup | Self::Cap | Self::SetMinus in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Cup | Self::Cap | Self::SetMinus in Op::infix_prec
@@ -216,17 +216,17 @@
             | Self::Le
             | Self::Ge
             | Self::In
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
-            Self::Cup | Self::Cap | Self::SetMinus => 8,
+             /* ~ changed by cargo-mutants ~ */
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (598842) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (598857) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `S^+ \cup T`: parse error at 1:5: unexpected Op(Cup) after the expression

failures:
    a_postfix_operator_binds_to_what_precedes_it
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
