*** crates/tla-syntax/src/token.rs:225:13: delete match arm Self::DotDot in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::DotDot in Op::infix_prec
@@ -217,17 +217,17 @@
             | Self::Ge
             | Self::In
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
-            Self::DotDot => 9,
+             /* ~ changed by cargo-mutants ~ */
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS
                     .iter()

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (599767) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 12:29: expected RBrack, found Op(DotDot)

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (599764) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected DefEq, found Op(And)", line: 23, col: 14 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (599768) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected DefEq, found Op(And)", line: 23, col: 14 }

failures:
    always_binds_tighter_than_conjunction
    every_fixture_parses
    instance_substitutions_are_recorded
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
