*** crates/tla-syntax/src/token.rs:226:13: delete match arm Self::Plus | Self::Minus in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Plus | Self::Minus in Op::infix_prec
@@ -218,17 +218,17 @@
             | Self::In
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
-            Self::Plus | Self::Minus => 10,
+             /* ~ changed by cargo-mutants ~ */
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS
                     .iter()
                     .find(|(name, _)| *name == symbol)

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (600260) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an identifier, found Num(1)
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (600261) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:30: expected RParen, found Op(Plus)
in:

---- prefix_and_postfix_operators_can_be_defined stdout ----

thread 'prefix_and_postfix_operators_can_be_defined' (600276) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found Ident("b")
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 19 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
