*** crates/tla-syntax/src/token.rs:227:13: delete match arm Self::Times | Self::Div | Self::Mod | Self::Cartesian in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Times | Self::Div | Self::Mod | Self::Cartesian in Op::infix_prec
@@ -219,17 +219,17 @@
             | Self::NotIn
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
-            Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
+             /* ~ changed by cargo-mutants ~ */
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS
                     .iter()
                     .find(|(name, _)| *name == symbol)
                     .map(|(_, prec)| *prec);

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (601074) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 12:1: expected DefEq, found Ident("TypeOK")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (601080) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"TypeOK\")", line: 12, col: 1 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
