*** crates/tla-syntax/src/token.rs:228:13: delete match arm Self::Concat in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Concat in Op::infix_prec
@@ -220,17 +220,17 @@
             | Self::Subseteq
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
-            Self::Concat => 12,
+             /* ~ changed by cargo-mutants ~ */
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS
                     .iter()
                     .find(|(name, _)| *name == symbol)
                     .map(|(_, prec)| *prec);
             }

*** result: Success
