*** crates/tla-syntax/src/token.rs:229:13: delete match arm Self::Pow in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Pow in Op::infix_prec
@@ -221,17 +221,17 @@
             | Self::Supseteq => 5,
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
-            Self::Pow => 13,
+             /* ~ changed by cargo-mutants ~ */
             Self::User(_) if self.is_postfix() => return None,
             Self::User(symbol) => {
                 return USER_OPERATORS
                     .iter()
                     .find(|(name, _)| *name == symbol)
                     .map(|(_, prec)| *prec);
             }
             _ => return None,

---- every_infix_operator_survives_printing stdout ----

thread 'every_infix_operator_survives_printing' (1084896) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `a ^ b`: parse error at 1:3: unexpected Op(Pow) after the expression

failures:
    every_infix_operator_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
