*** crates/tla-syntax/src/token.rs:231:13: delete match arm Self::User(symbol) in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::User(symbol) in Op::infix_prec
@@ -223,22 +223,17 @@
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,
             Self::User(_) if self.is_postfix() => return None,
-            Self::User(symbol) => {
-                return USER_OPERATORS
-                    .iter()
-                    .find(|(name, _)| *name == symbol)
-                    .map(|(_, prec)| *prec);
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => return None,
         })
     }
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
         matches!(self, Self::User("^+" | "^*" | "^#"))

---- every_infix_operator_survives_printing stdout ----

thread 'every_infix_operator_survives_printing' (1085542) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `a \prec b`: parse error at 1:3: unexpected Op(User("\\prec")) after the expression

failures:
    every_infix_operator_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
