*** crates/tla-syntax/src/token.rs:244:9: replace Op::is_postfix -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_postfix -> bool with true
@@ -236,17 +236,17 @@
             }
             _ => return None,
         })
     }
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
-        matches!(self, Self::User("^+" | "^*" | "^#"))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_right_assoc(self) -> bool {
         matches!(self, Self::Implies | Self::Pow)
     }
 
     /// How the operator is written. Where TLA+ offers several spellings the
     /// ASCII one is chosen, so printed output can be re-read by the parser.

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (605866) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected a declaration, found Num(1)
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (605870) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (605867) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:32: expected RParen, found Ident("y")
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 11 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
