*** crates/tla-syntax/src/token.rs:244:9: replace Op::is_postfix -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_postfix -> bool with false
@@ -236,17 +236,17 @@
             }
             _ => return None,
         })
     }
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
-        matches!(self, Self::User("^+" | "^*" | "^#"))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_right_assoc(self) -> bool {
         matches!(self, Self::Implies | Self::Pow)
     }
 
     /// How the operator is written. Where TLA+ offers several spellings the
     /// ASCII one is chosen, so printed output can be re-read by the parser.

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (606533) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:12: expected an expression, found Op(Cup)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (606548) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `S^+ \cup T`: parse error at 1:5: expected an expression, found Op(Cup)

failures:
    a_postfix_operator_binds_to_what_precedes_it
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
