*** crates/tla-syntax/src/token.rs:248:9: replace Op::is_right_assoc -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_right_assoc -> bool with true
@@ -240,17 +240,17 @@
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
         matches!(self, Self::User("^+" | "^*" | "^#"))
     }
 
     pub fn is_right_assoc(self) -> bool {
-        matches!(self, Self::Implies | Self::Pow)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// How the operator is written. Where TLA+ offers several spellings the
     /// ASCII one is chosen, so printed output can be re-read by the parser.
     pub fn symbol(self) -> &'static str {
         match self {
             Self::Implies => "=>",
             Self::Equiv => "<=>",

---- parentheses_are_restored_exactly_where_they_are_needed stdout ----

thread 'parentheses_are_restored_exactly_where_they_are_needed' (1089968) panicked at crates/tla-syntax/tests/printing.rs:174:5:
assertion `left == right` failed
  left: "a - b - c"
 right: "a - (b - c)"

failures:
    parentheses_are_restored_exactly_where_they_are_needed

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
