*** crates/tla-syntax/src/token.rs:248:9: replace Op::is_right_assoc -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_right_assoc -> bool with false
@@ -240,17 +240,17 @@
 
     /// `s^+`, `s^*` and `s^#` follow their operand rather than sitting
     /// between two, so they are never infix.
     pub fn is_postfix(self) -> bool {
         matches!(self, Self::User("^+" | "^*" | "^#"))
     }
 
     pub fn is_right_assoc(self) -> bool {
-        matches!(self, Self::Implies | Self::Pow)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// How the operator is written. Where TLA+ offers several spellings the
     /// ASCII one is chosen, so printed output can be re-read by the parser.
     pub fn symbol(self) -> &'static str {
         match self {
             Self::Implies => "=>",
             Self::Equiv => "<=>",

*** result: Success
