*** crates/tla-syntax/src/token.rs:254:9: replace Op::symbol -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::symbol -> &'static str with "xyzzy"
@@ -246,60 +246,17 @@
 
     pub fn is_right_assoc(self) -> bool {
         matches!(self, Self::Implies | Self::Pow)
     }
 
     /// How the operator is written. Where TLA+ offers several spellings the
     /// ASCII one is chosen, so printed output can be re-read by the parser.
     pub fn symbol(self) -> &'static str {
-        match self {
-            Self::Implies => "=>",
-            Self::Equiv => "<=>",
-            Self::Or => "\\/",
-            Self::And => "/\\",
-            Self::Eq => "=",
-            Self::Neq => "#",
-            Self::Lt => "<",
-            Self::Gt => ">",
-            Self::Le => "<=",
-            Self::Ge => ">=",
-            Self::In => "\\in",
-            Self::NotIn => "\\notin",
-            Self::Subseteq => "\\subseteq",
-            Self::Supseteq => "\\supseteq",
-            Self::AtAt => "@@",
-            Self::OneTo => ":>",
-            Self::Cup => "\\cup",
-            Self::Cap => "\\cap",
-            Self::SetMinus => "\\",
-            Self::DotDot => "..",
-            Self::Plus => "+",
-            Self::Minus => "-",
-            Self::Times => "*",
-            Self::Div => "\\div",
-            Self::Mod => "%",
-            Self::Cartesian => "\\X",
-            Self::Concat => "\\o",
-            Self::Pow => "^",
-            Self::Not => "~",
-            Self::Always => "[]",
-            Self::Eventually => "<>",
-            Self::Forall => "\\A",
-            Self::Exists => "\\E",
-            Self::Domain => "DOMAIN",
-            Self::Subset => "SUBSET",
-            Self::BigUnion => "UNION",
-            Self::Enabled => "ENABLED",
-            Self::Unchanged => "UNCHANGED",
-            Self::LeadsTo => "~>",
-            Self::TemporalForall => "\\AA",
-            Self::TemporalExists => "\\EE",
-            Self::User(symbol) => symbol,
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// How tightly the operator holds its operand when used as a prefix, and
     /// so how tightly it binds as a node in printed output.
     pub fn prefix_prec(self) -> u8 {
         match self {
             Self::Minus => 11,
             Self::Domain | Self::Subset | Self::BigUnion => 9,

---- an_infix_operator_can_be_defined stdout ----

thread 'an_infix_operator_can_be_defined' (151885) panicked at crates/tla-syntax/tests/grammar.rs:44:38:
the operator is defined

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (151886) panicked at crates/tla-syntax/tests/grammar.rs:125:5:
assertion `left == right` failed
  left: Ident("xyzzy")
 right: Ident("+")

---- labels_are_read_and_dropped stdout ----

thread 'labels_are_read_and_dropped' (151892) panicked at crates/tla-syntax/tests/grammar.rs:220:5:
assertion `left == right` failed
  left: "x xyzzy 1 xyzzy y xyzzy 2"
 right: "x = 1 /\\ y = 2"

failures:
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 18 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
