*** crates/tla-syntax/src/token.rs:303:9: replace Op::prefix_prec -> u8 with 0

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::prefix_prec -> u8 with 0
@@ -295,21 +295,17 @@
             Self::TemporalExists => "\\EE",
             Self::User(symbol) => symbol,
         }
     }
 
     /// How tightly the operator holds its operand when used as a prefix, and
     /// so how tightly it binds as a node in printed output.
     pub fn prefix_prec(self) -> u8 {
-        match self {
-            Self::Minus => 11,
-            Self::Domain | Self::Subset | Self::BigUnion => 9,
-            _ => 5,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// True for the word-shaped prefix operators, which need a space before
     /// their operand where the symbolic ones do not.
     pub fn is_word(self) -> bool {
         matches!(
             self,
             Self::Domain | Self::Subset | Self::BigUnion | Self::Enabled | Self::Unchanged

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (609995) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: TwoPhase.tla: TPConsistent did not survive printing as `\A r1, r2 \in RM : ~rmState[r1] = "aborted" /\ rmState[r2] = "committed"`
  left: Quant { kind: Forall, bounds: [Bound { names: ["r1", "r2"], domain: Some(Ident("RM")), destructure: false }], body: Binary(And, Unary(Not, Binary(Eq, FnApply(Ident("rmState"), [Ident("r1")]), Str("aborted"))), Binary(Eq, FnApply(Ident("rmState"), [Ident("r2")]), Str("committed"))) }
 right: Quant { kind: Forall, bounds: [Bound { names: ["r1", "r2"], domain: Some(Ident("RM")), destructure: false }], body: Unary(Not, Binary(And, Binary(Eq, FnApply(Ident("rmState"), [Ident("r1")]), Str("aborted")), Binary(Eq, FnApply(Ident("rmState"), [Ident("r2")]),

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
