*** crates/tla-syntax/src/token.rs:304:13: delete match arm Self::Minus in Op::prefix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Minus in Op::prefix_prec
@@ -296,17 +296,17 @@
             Self::User(symbol) => symbol,
         }
     }
 
     /// How tightly the operator holds its operand when used as a prefix, and
     /// so how tightly it binds as a node in printed output.
     pub fn prefix_prec(self) -> u8 {
         match self {
-            Self::Minus => 11,
+             /* ~ changed by cargo-mutants ~ */
             Self::Domain | Self::Subset | Self::BigUnion => 9,
             _ => 5,
         }
     }
 
     /// True for the word-shaped prefix operators, which need a space before
     /// their operand where the symbolic ones do not.
     pub fn is_word(self) -> bool {

*** result: Success
