*** crates/tla-syntax/src/token.rs:305:13: delete match arm Self::Domain | Self::Subset | Self::BigUnion in Op::prefix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Domain | Self::Subset | Self::BigUnion in Op::prefix_prec
@@ -297,17 +297,17 @@
         }
     }
 
     /// How tightly the operator holds its operand when used as a prefix, and
     /// so how tightly it binds as a node in printed output.
     pub fn prefix_prec(self) -> u8 {
         match self {
             Self::Minus => 11,
-            Self::Domain | Self::Subset | Self::BigUnion => 9,
+             /* ~ changed by cargo-mutants ~ */
             _ => 5,
         }
     }
 
     /// True for the word-shaped prefix operators, which need a space before
     /// their operand where the symbolic ones do not.
     pub fn is_word(self) -> bool {
         matches!(

*** result: Success
