*** crates/tla-syntax/src/token.rs:313:9: replace Op::is_word -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_word -> bool with true
@@ -305,20 +305,17 @@
             Self::Domain | Self::Subset | Self::BigUnion => 9,
             _ => 5,
         }
     }
 
     /// True for the word-shaped prefix operators, which need a space before
     /// their operand where the symbolic ones do not.
     pub fn is_word(self) -> bool {
-        matches!(
-            self,
-            Self::Domain | Self::Subset | Self::BigUnion | Self::Enabled | Self::Unchanged
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Tok {
     Ident(String),
     Num(i64),
     Str(String),

*** result: Success
