*** crates/tla-syntax/src/token.rs:313:9: replace Op::is_word -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Op::is_word -> bool with false
@@ -305,20 +305,17 @@
             Self::Domain | Self::Subset | Self::BigUnion => 9,
             _ => 5,
         }
     }
 
     /// True for the word-shaped prefix operators, which need a space before
     /// their operand where the symbolic ones do not.
     pub fn is_word(self) -> bool {
-        matches!(
-            self,
-            Self::Domain | Self::Subset | Self::BigUnion | Self::Enabled | Self::Unchanged
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Tok {
     Ident(String),
     Num(i64),
     Str(String),

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1095938) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BoundedBuffer.tla: Put did not survive printing as `Len(buf) < Capacity /\ nextVal <= MaxItems /\ buf' = Append(buf, nextVal) /\ nextVal' = nextVal + 1 /\ (UNCHANGEDreceived)`

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
