*** crates/tla-syntax/src/token.rs:36:9: replace Kw::lookup -> Option<Self> with None

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Kw::lookup -> Option<Self> with None
@@ -28,49 +28,17 @@
     Subset,
     Union,
     Enabled,
     Unchanged,
 }
 
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
-        Some(match word {
-            "MODULE" => Self::Module,
-            "EXTENDS" => Self::Extends,
-            "CONSTANT" | "CONSTANTS" => Self::Constant,
-            "VARIABLE" | "VARIABLES" => Self::Variable,
-            "LET" => Self::Let,
-            "IN" => Self::In,
-            "IF" => Self::If,
-            "THEN" => Self::Then,
-            "ELSE" => Self::Else,
-            "CHOOSE" => Self::Choose,
-            "CASE" => Self::Case,
-            "OTHER" => Self::Other,
-            "ASSUME" | "ASSUMPTION" => Self::Assume,
-            "INSTANCE" => Self::Instance,
-            "WITH" => Self::With,
-            "LOCAL" => Self::Local,
-            "RECURSIVE" => Self::Recursive,
-            "LAMBDA" => Self::Lambda,
-            "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
-            "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
-            | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
-            | "NEW" | "ONLY" => Self::Proof,
-            "EXCEPT" => Self::Except,
-            "TRUE" => Self::True,
-            "FALSE" => Self::False,
-            "DOMAIN" => Self::Domain,
-            "SUBSET" => Self::Subset,
-            "UNION" => Self::Union,
-            "ENABLED" => Self::Enabled,
-            "UNCHANGED" => Self::Unchanged,
-            _ => return None,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Op {
     Implies,
     Equiv,
     Or,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (128011) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (128013) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (128012) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
