*** crates/tla-syntax/src/token.rs:37:13: delete match arm "MODULE" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "MODULE" in Kw::lookup
@@ -29,17 +29,17 @@
     Union,
     Enabled,
     Unchanged,
 }
 
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
-            "MODULE" => Self::Module,
+             /* ~ changed by cargo-mutants ~ */
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (572501) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (572499) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (572502) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:21: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 1 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
