*** crates/tla-syntax/src/token.rs:40:13: delete match arm "VARIABLE" | "VARIABLES" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "VARIABLE" | "VARIABLES" in Kw::lookup
@@ -32,17 +32,17 @@
 }
 
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
-            "VARIABLE" | "VARIABLES" => Self::Variable,
+             /* ~ changed by cargo-mutants ~ */
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (574505) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"rmState\")", line: 4, col: 11 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (574508) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 8:10: expected DefEq, found Ident("bal")

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (574509) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"rmState\")", line: 4, col: 11 }

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
