*** crates/tla-syntax/src/token.rs:41:13: delete match arm "LET" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "LET" in Kw::lookup
@@ -33,17 +33,17 @@
 
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
-            "LET" => Self::Let,
+             /* ~ changed by cargo-mutants ~ */
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (574740) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 31:8: expected a declaration, found Kw(In)

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (574733) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected a declaration, found Kw(In)", line: 52, col: 8 }

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (574787) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected a declaration, found Kw(In)", line: 31, col: 8 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
