*** crates/tla-syntax/src/token.rs:43:13: delete match arm "IF" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "IF" in Kw::lookup
@@ -35,17 +35,17 @@
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
-            "IF" => Self::If,
+             /* ~ changed by cargo-mutants ~ */
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (130837) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 29:10: expected an identifier, found LBrace

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (130843) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected an identifier, found LBrace", line: 29, col: 10 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
