*** crates/tla-syntax/src/token.rs:44:13: delete match arm "THEN" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "THEN" in Kw::lookup
@@ -36,17 +36,17 @@
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
-            "THEN" => Self::Then,
+             /* ~ changed by cargo-mutants ~ */
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (577635) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 29:13: expected Kw(Then), found Ident("THEN")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (577651) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected Kw(Then), found Ident(\"THEN\")", line: 29, col: 13 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
