*** crates/tla-syntax/src/token.rs:46:13: delete match arm "CHOOSE" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "CHOOSE" in Kw::lookup
@@ -38,17 +38,17 @@
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
-            "CHOOSE" => Self::Choose,
+             /* ~ changed by cargo-mutants ~ */
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (132473) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: expected RBrace, found Ident("x")
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (132495) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `{CHOOSE x \in S : TRUE}`: parse error at 1:9: expected RBrace, found Ident("x")

failures:
    a_choose_inside_braces_is_not_a_set_filter
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
