*** crates/tla-syntax/src/token.rs:47:13: delete match arm "CASE" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "CASE" in Kw::lookup
@@ -39,17 +39,17 @@
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
-            "CASE" => Self::Case,
+             /* ~ changed by cargo-mutants ~ */
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,

---- case_arms_are_separated_by_boxes stdout ----

thread 'case_arms_are_separated_by_boxes' (579824) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:20: expected an identifier, found Num(1)
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (579833) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `CASE n = 1 -> "a" [] OTHER -> "b"`: parse error at 1:6: unexpected Ident("n") after the expression

failures:
    case_arms_are_separated_by_boxes
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
