*** crates/tla-syntax/src/token.rs:51:13: delete match arm "WITH" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "WITH" in Kw::lookup
@@ -43,17 +43,17 @@
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
-            "WITH" => Self::With,
+             /* ~ changed by cargo-mutants ~ */
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (1061569) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"RM\")", line: 6, col: 29 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (1061573) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"RM\")", line: 6, col: 29 }

---- qualified_names_resolve_through_the_instance stdout ----

thread 'qualified_names_resolve_through_the_instance' (1061584) panicked at crates/tla-syntax/tests/parse_specs.rs:115:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"RM\")", line: 6, col: 29 }

failures:
    always_binds_tighter_than_conjunction
    every_fixture_parses
    instance_substitutions_are_recorded
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
