*** crates/tla-syntax/src/token.rs:53:13: delete match arm "RECURSIVE" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "RECURSIVE" in Kw::lookup
@@ -45,17 +45,17 @@
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
-            "RECURSIVE" => Self::Recursive,
+             /* ~ changed by cargo-mutants ~ */
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (135758) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 27:11: expected DefEq, found Ident("SumOver")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (135764) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"SumOver\")", line: 27, col: 11 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
