*** crates/tla-syntax/src/token.rs:54:13: delete match arm "LAMBDA" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "LAMBDA" in Kw::lookup
@@ -46,17 +46,17 @@
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
-            "LAMBDA" => Self::Lambda,
+             /* ~ changed by cargo-mutants ~ */
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (583320) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:21: expected RParen, found Ident("x")
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (583339) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `Apply(LAMBDA x, y : x + y, 1)`: parse error at 1:14: expected RParen, found Ident("x")

failures:
    a_lambda_may_be_passed_where_an_operator_is_wanted
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
