*** crates/tla-syntax/src/token.rs:55:13: delete match arm "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" in Kw::lookup
@@ -47,17 +47,17 @@
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,
-            "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
+             /* ~ changed by cargo-mutants ~ */
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (135813) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expected DefEq, found Ident("Correct")
in:

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (135811) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expected DefEq, found Ident("Correct")
in:

failures:
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
