*** crates/tla-syntax/src/token.rs:56:13: delete match arm "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE" | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE" | "NEW" | "ONLY" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE" | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE" | "NEW" | "ONLY" in Kw::lookup
@@ -48,19 +48,17 @@
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
-            "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
-            | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
-            | "NEW" | "ONLY" => Self::Proof,
+             /* ~ changed by cargo-mutants ~ */
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,
             "UNION" => Self::Union,
             "ENABLED" => Self::Enabled,
             "UNCHANGED" => Self::Unchanged,

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (136797) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 6:5: expected an identifier, found Num(1)
in:

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
