*** crates/tla-syntax/src/token.rs:59:13: delete match arm "EXCEPT" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "EXCEPT" in Kw::lookup
@@ -51,17 +51,17 @@
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
-            "EXCEPT" => Self::Except,
+             /* ~ changed by cargo-mutants ~ */
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,
             "UNION" => Self::Union,
             "ENABLED" => Self::Enabled,
             "UNCHANGED" => Self::Unchanged,
             _ => return None,

---- except_accepts_several_indices_at_once stdout ----

thread 'except_accepts_several_indices_at_once' (137430) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected RBrack, found Ident("EXCEPT")
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (137438) panicked at crates/tla-syntax/tests/grammar.rs:254:33:
parsing `[f EXCEPT ![a, b] = v]`: parse error at 1:4: expected RBrack, found Ident("EXCEPT")

failures:
    except_accepts_several_indices_at_once
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
