*** crates/tla-syntax/src/token.rs:62:13: delete match arm "DOMAIN" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "DOMAIN" in Kw::lookup
@@ -54,17 +54,17 @@
             "LAMBDA" => Self::Lambda,
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
-            "DOMAIN" => Self::Domain,
+             /* ~ changed by cargo-mutants ~ */
             "SUBSET" => Self::Subset,
             "UNION" => Self::Union,
             "ENABLED" => Self::Enabled,
             "UNCHANGED" => Self::Unchanged,
             _ => return None,
         })
     }
 }

---- every_prefix_and_postfix_operator_survives_printing stdout ----

thread 'every_prefix_and_postfix_operator_survives_printing' (1067854) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `DOMAIN f`: parse error at 1:8: unexpected Ident("f") after the expression

---- word_operators_keep_their_space stdout ----

thread 'word_operators_keep_their_space' (1067858) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `DOMAIN f`: parse error at 1:8: unexpected Ident("f") after the expression

failures:
    every_prefix_and_postfix_operator_survives_printing
    word_operators_keep_their_space

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
