*** crates/tla-syntax/src/token.rs:63:13: delete match arm "SUBSET" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "SUBSET" in Kw::lookup
@@ -55,17 +55,17 @@
             "THEOREM" | "LEMMA" | "COROLLARY" | "PROPOSITION" => Self::Theorem,
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
-            "SUBSET" => Self::Subset,
+             /* ~ changed by cargo-mutants ~ */
             "UNION" => Self::Union,
             "ENABLED" => Self::Enabled,
             "UNCHANGED" => Self::Unchanged,
             _ => return None,
         })
     }
 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (139133) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
RaftElection.tla: parse error at 16:41: expected RBrack, found Ident("Server")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (139139) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected RBrack, found Ident(\"Server\")", line: 16, col: 41 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
