*** crates/tla-syntax/src/token.rs:64:13: delete match arm "UNION" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "UNION" in Kw::lookup
@@ -56,17 +56,17 @@
             "PROOF" | "BY" | "OBVIOUS" | "OMITTED" | "QED" | "DEF" | "DEFS" | "DEFINE"
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,
-            "UNION" => Self::Union,
+             /* ~ changed by cargo-mutants ~ */
             "ENABLED" => Self::Enabled,
             "UNCHANGED" => Self::Unchanged,
             _ => return None,
         })
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]

---- every_prefix_and_postfix_operator_survives_printing stdout ----

thread 'every_prefix_and_postfix_operator_survives_printing' (1069338) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `UNION S`: parse error at 1:7: unexpected Ident("S") after the expression

---- word_operators_keep_their_space stdout ----

thread 'word_operators_keep_their_space' (1069342) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `UNION S`: parse error at 1:7: unexpected Ident("S") after the expression

failures:
    every_prefix_and_postfix_operator_survives_printing
    word_operators_keep_their_space

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
