*** crates/tla-syntax/src/token.rs:65:13: delete match arm "ENABLED" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "ENABLED" in Kw::lookup
@@ -57,17 +57,17 @@
             | "SUFFICES" | "PICK" | "WITNESS" | "HAVE" | "TAKE" | "USE" | "HIDE" | "PROVE"
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,
             "UNION" => Self::Union,
-            "ENABLED" => Self::Enabled,
+             /* ~ changed by cargo-mutants ~ */
             "UNCHANGED" => Self::Unchanged,
             _ => return None,
         })
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Op {

---- every_prefix_and_postfix_operator_survives_printing stdout ----

thread 'every_prefix_and_postfix_operator_survives_printing' (1070050) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `ENABLED A`: parse error at 1:9: unexpected Ident("A") after the expression

---- word_operators_keep_their_space stdout ----

thread 'word_operators_keep_their_space' (1070054) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `ENABLED A`: parse error at 1:9: unexpected Ident("A") after the expression

failures:
    every_prefix_and_postfix_operator_survives_printing
    word_operators_keep_their_space

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
