*** crates/tla-syntax/src/token.rs:66:13: delete match arm "UNCHANGED" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "UNCHANGED" in Kw::lookup
@@ -58,17 +58,17 @@
             | "NEW" | "ONLY" => Self::Proof,
             "EXCEPT" => Self::Except,
             "TRUE" => Self::True,
             "FALSE" => Self::False,
             "DOMAIN" => Self::Domain,
             "SUBSET" => Self::Subset,
             "UNION" => Self::Union,
             "ENABLED" => Self::Enabled,
-            "UNCHANGED" => Self::Unchanged,
+             /* ~ changed by cargo-mutants ~ */
             _ => return None,
         })
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum Op {
     Implies,

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (140221) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"TraceSpec\")", line: 32, col: 1 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (140226) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"TraceSpec\")", line: 32, col: 1 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (140225) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BoundedBuffer.tla: parse error at 26:1: expected DefEq, found Ident("Get")

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
