*** crates/tlatools/src/main.rs:27:5: replace run -> Result<ExitCode, String> with Ok(Default::default())

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ replace run -> Result<ExitCode, String> with Ok(Default::default())
@@ -19,44 +19,17 @@
         Err(message) => {
             eprintln!("tlatools: {message}");
             ExitCode::from(2)
         }
     }
 }
 
 fn run() -> Result<ExitCode, String> {
-    let args: Vec<String> = std::env::args().skip(1).collect();
-    let rest = match args.first().map(String::as_str) {
-        Some("check") => &args[1..],
-        Some("--help" | "-h") => {
-            println!("{}", usage());
-            return Ok(ExitCode::SUCCESS);
-        }
-        Some(other) => return Err(format!("unknown command `{other}`\n\n{}", usage())),
-        None => return Err(format!("no command given\n\n{}", usage())),
-    };
-
-    let source = match rest.first().map(String::as_str) {
-        None | Some("-") => read_stdin()?,
-        Some(path) => std::fs::read_to_string(path).map_err(|e| format!("reading {path}: {e}"))?,
-    };
-
-    let job: Job = serde_json::from_str(&source).map_err(|e| format!("reading the job: {e}"))?;
-    let report = check(&job);
-    let rendered =
-        serde_json::to_string(&report).map_err(|e| format!("writing the report: {e}"))?;
-    let mut out = std::io::stdout().lock();
-    writeln!(out, "{rendered}").map_err(|e| e.to_string())?;
-
-    Ok(match report.status {
-        Status::Pass => ExitCode::SUCCESS,
-        Status::Error => ExitCode::from(2),
-        _ => ExitCode::from(1),
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_stdin() -> Result<String, String> {
     let mut buffer = String::new();
     std::io::stdin()
         .read_to_string(&mut buffer)
         .map_err(|e| format!("reading stdin: {e}"))?;
     Ok(buffer)

---- a_missing_file_is_reported_and_is_not_a_verdict stdout ----

thread 'a_missing_file_is_reported_and_is_not_a_verdict' (613872) panicked at crates/tlatools/tests/cli.rs:111:5:
assertion `left == right` failed
  left: Some(0)
 right: Some(2)

---- an_impossible_job_exits_two stdout ----

thread 'an_impossible_job_exits_two' (613874) panicked at crates/tlatools/tests/cli.rs:85:5:
assertion `left == right` failed
  left: Some(0)
 right: Some(2)

---- a_failing_implementation_exits_one stdout ----

thread 'a_failing_implementation_exits_one' (613871) panicked at crates/tlatools/tests/cli.rs:71:5:
assertion `left == right` failed
  left: Some(0)
 right: Some(1)

failures:
    a_failing_implementation_exits_one
    a_missing_file_is_reported_and_is_not_a_verdict
    a_refining_implementation_exits_zero
    an_impossible_job_exits_two
    an_unknown_command_is_refused_with_usage
    help_is_available_and_succeeds
    malformed_json_is_refused_before_anything_is_decided
    no_command_is_refused_with_usage
    the_job_may_come_from_a_file

test result: FAILED. 0 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
