*** crates/tlatools/src/main.rs:51:9: delete match arm Status::Pass in run

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ delete match arm Status::Pass in run
@@ -43,17 +43,17 @@
     let job: Job = serde_json::from_str(&source).map_err(|e| format!("reading the job: {e}"))?;
     let report = check(&job);
     let rendered =
         serde_json::to_string(&report).map_err(|e| format!("writing the report: {e}"))?;
     let mut out = std::io::stdout().lock();
     writeln!(out, "{rendered}").map_err(|e| e.to_string())?;
 
     Ok(match report.status {
-        Status::Pass => ExitCode::SUCCESS,
+         /* ~ changed by cargo-mutants ~ */
         Status::Error => ExitCode::from(2),
         _ => ExitCode::from(1),
     })
 }
 
 fn read_stdin() -> Result<String, String> {
     let mut buffer = String::new();
     std::io::stdin()

---- the_job_may_come_from_a_file stdout ----

thread 'the_job_may_come_from_a_file' (1097299) panicked at crates/tlatools/tests/cli.rs:100:5:
assertion `left == right` failed
  left: Some(1)
 right: Some(0)

---- a_refining_implementation_exits_zero stdout ----

thread 'a_refining_implementation_exits_zero' (1097287) panicked at crates/tlatools/tests/cli.rs:61:5:
assertion `left == right` failed
  left: Some(1)
 right: Some(0)

failures:
    a_refining_implementation_exits_zero
    the_job_may_come_from_a_file

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
