*** crates/tlatools/src/main.rs:52:9: delete match arm Status::Error in run

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ delete match arm Status::Error in run
@@ -44,17 +44,17 @@
     let report = check(&job);
     let rendered =
         serde_json::to_string(&report).map_err(|e| format!("writing the report: {e}"))?;
     let mut out = std::io::stdout().lock();
     writeln!(out, "{rendered}").map_err(|e| e.to_string())?;
 
     Ok(match report.status {
         Status::Pass => ExitCode::SUCCESS,
-        Status::Error => ExitCode::from(2),
+         /* ~ changed by cargo-mutants ~ */
         _ => ExitCode::from(1),
     })
 }
 
 fn read_stdin() -> Result<String, String> {
     let mut buffer = String::new();
     std::io::stdin()
         .read_to_string(&mut buffer)

---- an_impossible_job_exits_two stdout ----

thread 'an_impossible_job_exits_two' (1097402) panicked at crates/tlatools/tests/cli.rs:85:5:
assertion `left == right` failed
  left: Some(1)
 right: Some(2)

failures:
    an_impossible_job_exits_two

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
