*** crates/tlatools/src/main.rs:58:5: replace read_stdin -> Result<String, String> with Ok("xyzzy".into())

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ replace read_stdin -> Result<String, String> with Ok("xyzzy".into())
@@ -50,21 +50,17 @@
     Ok(match report.status {
         Status::Pass => ExitCode::SUCCESS,
         Status::Error => ExitCode::from(2),
         _ => ExitCode::from(1),
     })
 }
 
 fn read_stdin() -> Result<String, String> {
-    let mut buffer = String::new();
-    std::io::stdin()
-        .read_to_string(&mut buffer)
-        .map_err(|e| format!("reading stdin: {e}"))?;
-    Ok(buffer)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn usage() -> &'static str {
     "usage: tlatools check [JOB.json]
 
 Decide whether an implementation's reachable state graph refines a TLA+
 specification. The job is read from JOB.json, or from stdin when the path is
 omitted or is `-`. The verdict is written to stdout as JSON.

---- a_failing_implementation_exits_one stdout ----

thread 'a_failing_implementation_exits_one' (1098596) panicked at crates/tlatools/tests/cli.rs:71:5:
assertion `left == right` failed
  left: Some(2)
 right: Some(1)

---- an_impossible_job_exits_two stdout ----

thread 'an_impossible_job_exits_two' (1098599) panicked at crates/tlatools/tests/cli.rs:47:9:
stdout was not JSON: EOF while parsing a value at line 1 column 0
stdout: 
stderr: tlatools: reading the job: expected value at line 1 column 1

---- a_refining_implementation_exits_zero stdout ----

thread 'a_refining_implementation_exits_zero' (1098598) panicked at crates/tlatools/tests/cli.rs:61:5:
assertion `left == right` failed
  left: Some(2)
 right: Some(0)

failures:
    a_failing_implementation_exits_one
    a_refining_implementation_exits_zero
    an_impossible_job_exits_two

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
