*** crates/tlatools/src/main.rs:66:5: replace usage -> &'static str with ""

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ replace usage -> &'static str with ""
@@ -58,19 +58,10 @@
     let mut buffer = String::new();
     std::io::stdin()
         .read_to_string(&mut buffer)
         .map_err(|e| format!("reading stdin: {e}"))?;
     Ok(buffer)
 }
 
 fn usage() -> &'static str {
-    "usage: tlatools check [JOB.json]
-
-Decide whether an implementation's reachable state graph refines a TLA+
-specification. The job is read from JOB.json, or from stdin when the path is
-omitted or is `-`. The verdict is written to stdout as JSON.
-
-exit status
-  0  the implementation refines the specification
-  1  it does not
-  2  the job could not be carried out"
+    "" /* ~ changed by cargo-mutants ~ */
 }

---- help_is_available_and_succeeds stdout ----

thread 'help_is_available_and_succeeds' (615230) panicked at crates/tlatools/tests/cli.rs:123:5:

---- an_unknown_command_is_refused_with_usage stdout ----

thread 'an_unknown_command_is_refused_with_usage' (615228) panicked at crates/tlatools/tests/cli.rs:133:5:
tlatools: unknown command `frobnicate`

---- no_command_is_refused_with_usage stdout ----

thread 'no_command_is_refused_with_usage' (615235) panicked at crates/tlatools/tests/cli.rs:140:5:
assertion failed: String::from_utf8_lossy(&out.stderr).contains("usage")

failures:
    an_unknown_command_is_refused_with_usage
    help_is_available_and_succeeds
    no_command_is_refused_with_usage

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
