*** crates/tlatools/src/main.rs:66:5: replace usage -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tlatools/src/main.rs
+++ replace usage -> &'static str with "xyzzy"
@@ -58,19 +58,10 @@
     let mut buffer = String::new();
     std::io::stdin()
         .read_to_string(&mut buffer)
         .map_err(|e| format!("reading stdin: {e}"))?;
     Ok(buffer)
 }
 
 fn usage() -> &'static str {
-    "usage: tlatools check [JOB.json]
-
-Decide whether an implementation's reachable state graph refines a TLA+
-specification. The job is read from JOB.json, or from stdin when the path is
-omitted or is `-`. The verdict is written to stdout as JSON.
-
-exit status
-  0  the implementation refines the specification
-  1  it does not
-  2  the job could not be carried out"
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
