*** crates/tla-eval/src/builtin.rs:114:19: replace - with + in index_range

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace - with + in index_range
@@ -106,17 +106,17 @@
         "BOOLEAN" => Value::Set(BTreeSet::from([Value::Bool(false), Value::Bool(true)])),
         _ => return None,
     })
 }
 
 /// A `SubSeq` range, already clamped to `1..=len`, as a Rust slice range.
 fn index_range(lo: i64, hi: i64) -> (usize, usize) {
     let to_index = |n: i64| usize::try_from(n).expect("clamped to the sequence's own bounds");
-    (to_index(lo) - 1, to_index(hi))
+    (to_index(lo) + /* ~ changed by cargo-mutants ~ */ 1, to_index(hi))
 }
 
 fn seq<'a>(v: &'a Value, who: &str) -> Result<&'a [Value]> {
     match v {
         Value::Seq(items) => Ok(items),
         other => type_error(format!("{who} expects a sequence, got {other}")),
     }
 }

---- subseq_clamps_and_can_be_empty stdout ----

thread 'subseq_clamps_and_can_be_empty' (638727) panicked at crates/tla-eval/tests/standard_operators.rs:92:5:
assertion `left == right` failed
  left: Seq([])
 right: Seq([Int(2), Int(3)])

failures:
    subseq_clamps_and_can_be_empty

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
