*** crates/tla-eval/src/builtin.rs:34:9: delete match arm "Len" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Len" in call
@@ -26,20 +26,17 @@
                 )),
                 other => type_error(format!("Cardinality expects a set, got {other}")),
             }
         }
         "IsFiniteSet" => {
             arity(1)?;
             Ok(Value::Bool(matches!(args[0], Value::Set(_))))
         }
-        "Len" => {
-            arity(1)?;
-            seq(&args[0], name).map(|s| Value::Int(count(s.len())))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Head" => {
             arity(1)?;
             seq(&args[0], name)?
                 .first()
                 .cloned()
                 .ok_or_else(|| Error::Type("Head of an empty sequence".to_string()))
         }
         "Tail" => {

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (172565) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (172569) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (172568) panicked at crates/tla-eval/tests/evaluate_specs.rs:433:5:
`Len` is not defined

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling

test result: FAILED. 14 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
