*** crates/tla-eval/src/builtin.rs:45:9: delete match arm "Tail" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Tail" in call
@@ -37,24 +37,17 @@
         }
         "Head" => {
             arity(1)?;
             seq(&args[0], name)?
                 .first()
                 .cloned()
                 .ok_or_else(|| Error::Type("Head of an empty sequence".to_string()))
         }
-        "Tail" => {
-            arity(1)?;
-            let s = seq(&args[0], name)?;
-            if s.is_empty() {
-                return type_error("Tail of an empty sequence");
-            }
-            Ok(Value::Seq(s[1..].to_vec()))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Append" => {
             arity(2)?;
             let mut s = seq(&args[0], name)?.to_vec();
             s.push(args[1].clone());
             Ok(Value::Seq(s))
         }
         "SubSeq" => {
             arity(3)?;

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (626943) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:50:
called `Result::unwrap()` on an `Err` value: Undefined("Tail")

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (626942) panicked at crates/tla-eval/tests/evaluate_specs.rs:35:50:
called `Result::unwrap()` on an `Err` value: Undefined("Tail")

failures:
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
