*** crates/tla-eval/src/builtin.rs:64:19: replace < with == in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ replace < with == in call
@@ -56,17 +56,17 @@
             s.push(args[1].clone());
             Ok(Value::Seq(s))
         }
         "SubSeq" => {
             arity(3)?;
             let s = seq(&args[0], name)?;
             let lo = int(&args[1], name)?.max(1);
             let hi = int(&args[2], name)?.min(count(s.len()));
-            if hi < lo {
+            if hi == /* ~ changed by cargo-mutants ~ */ lo {
                 return Ok(Value::Seq(Vec::new()));
             }
             let (lo, hi) = index_range(lo, hi);
             Ok(Value::Seq(s[lo..hi].to_vec()))
         }
         "Seq" => {
             arity(1)?;
             Ok(Value::Infinite(Infinite::Sequences(Box::new(

---- subseq_clamps_and_can_be_empty stdout ----

thread 'subseq_clamps_and_can_be_empty' (179859) panicked at crates/tla-eval/tests/standard_operators.rs:93:5:
assertion `left == right` failed
  left: Seq([])
 right: Seq([Int(2)])

failures:
    subseq_clamps_and_can_be_empty

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
