*** crates/tla-eval/src/builtin.rs:70:9: delete match arm "Seq" in call

*** mutation diff:
--- crates/tla-eval/src/builtin.rs
+++ delete match arm "Seq" in call
@@ -62,22 +62,17 @@
             let lo = int(&args[1], name)?.max(1);
             let hi = int(&args[2], name)?.min(count(s.len()));
             if hi < lo {
                 return Ok(Value::Seq(Vec::new()));
             }
             let (lo, hi) = index_range(lo, hi);
             Ok(Value::Seq(s[lo..hi].to_vec()))
         }
-        "Seq" => {
-            arity(1)?;
-            Ok(Value::Infinite(Infinite::Sequences(Box::new(
-                args[0].clone(),
-            ))))
-        }
+         /* ~ changed by cargo-mutants ~ */
         "Assert" => {
             arity(2)?;
             if args[0] == Value::Bool(true) {
                 Ok(Value::Bool(true))
             } else {
                 Err(Error::Malformed(format!("assertion failed: {}", args[1])))
             }
         }

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (177749) panicked at crates/tla-eval/tests/evaluate_specs.rs:29:42:
called `Result::unwrap()` on an `Err` value: Undefined("Seq")

failures:
    bounded_buffer_accepts_the_protocol

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
