*** crates/tla-eval/src/diagnose.rs:100:9: replace Evaluator<'m>::probe -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace Evaluator<'m>::probe -> Result<()> with Ok(())
@@ -92,71 +92,17 @@
     fn probe(
         &self,
         e: &'m Expr,
         ctx: &mut Ctx<'m, '_>,
         label: Option<&str>,
         found: &mut Probe,
         depth: usize,
     ) -> Result<()> {
-        if depth >= MAX_DEPTH {
-            return Ok(());
-        }
-        match e {
-            Expr::Binary(Op::Or, lhs, rhs) => {
-                self.probe(lhs, ctx, label, found, depth + 1)?;
-                self.probe(rhs, ctx, label, found, depth + 1)
-            }
-            Expr::Quant {
-                kind: QuantKind::Exists,
-                bounds,
-                body,
-            } => {
-                for binding in self.expand(bounds, ctx)? {
-                    let restore = push(ctx, &binding);
-                    let walked = self.probe(body, ctx, label, found, depth + 1);
-                    ctx.locals.truncate(restore);
-                    walked?;
-                }
-                Ok(())
-            }
-            Expr::Let { defs, body } => {
-                let base = ctx.locals.len();
-                let scope = base + defs.len();
-                for def in defs {
-                    ctx.locals
-                        .push((def.name.clone(), Local::Def { def, scope }));
-                }
-                let walked = self.probe(body, ctx, label, found, depth + 1);
-                ctx.locals.truncate(base);
-                walked
-            }
-            Expr::Apply(head, args) => {
-                if let Expr::Ident(name) = &**head
-                    && let Some((_, def)) = self.spec.definition(ctx.module, name)
-                {
-                    return self.enter(def, args, ctx, found, depth);
-                }
-                self.record(e, ctx, label, found);
-                Ok(())
-            }
-            Expr::Ident(name) => {
-                if let Some((_, def)) = self.spec.definition(ctx.module, name)
-                    && def.params.is_empty()
-                {
-                    return self.enter(def, &[], ctx, found, depth);
-                }
-                self.record(e, ctx, label, found);
-                Ok(())
-            }
-            _ => {
-                self.record(e, ctx, label, found);
-                Ok(())
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Step into a named action, naming it by the arguments it was given.
     fn enter(
         &self,
         def: &'m Def,
         args: &'m [Expr],
         ctx: &mut Ctx<'m, '_>,

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (645374) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (645365) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (645384) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
