*** crates/tla-eval/src/diagnose.rs:106:58: replace + with - in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with - in Evaluator<'m>::probe
@@ -98,17 +98,17 @@
         depth: usize,
     ) -> Result<()> {
         if depth >= MAX_DEPTH {
             return Ok(());
         }
         match e {
             Expr::Binary(Op::Or, lhs, rhs) => {
                 self.probe(lhs, ctx, label, found, depth + 1)?;
-                self.probe(rhs, ctx, label, found, depth + 1)
+                self.probe(rhs, ctx, label, found, depth - /* ~ changed by cargo-mutants ~ */ 1)
             }
             Expr::Quant {
                 kind: QuantKind::Exists,
                 bounds,
                 body,
             } => {
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (197759) panicked at crates/tla-eval/src/diagnose.rs:106:52:
attempt to subtract with overflow

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (197761) panicked at crates/tla-eval/src/diagnose.rs:106:52:
attempt to subtract with overflow

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (197766) panicked at crates/tla-eval/src/diagnose.rs:106:52:
attempt to subtract with overflow

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_allowed_step_has_nothing_to_explain
    closeness_is_measured_over_all_of_an_actions_conjuncts

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
