*** crates/tla-eval/src/diagnose.rs:108:13: delete match arm Expr::Quant{kind:QuantKind::Exists, bounds, body,} in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ delete match arm Expr::Quant{kind:QuantKind::Exists, bounds, body,} in Evaluator<'m>::probe
@@ -100,29 +100,17 @@
         if depth >= MAX_DEPTH {
             return Ok(());
         }
         match e {
             Expr::Binary(Op::Or, lhs, rhs) => {
                 self.probe(lhs, ctx, label, found, depth + 1)?;
                 self.probe(rhs, ctx, label, found, depth + 1)
             }
-            Expr::Quant {
-                kind: QuantKind::Exists,
-                bounds,
-                body,
-            } => {
-                for binding in self.expand(bounds, ctx)? {
-                    let restore = push(ctx, &binding);
-                    let walked = self.probe(body, ctx, label, found, depth + 1);
-                    ctx.locals.truncate(restore);
-                    walked?;
-                }
-                Ok(())
-            }
+             /* ~ changed by cargo-mutants ~ */
             Expr::Let { defs, body, .. } => {
                 let base = ctx.locals.len();
                 let scope = base + defs.len();
                 for def in defs {
                     ctx.locals
                         .push((def.name.clone(), Local::Def { def, scope }));
                 }
                 let walked = self.probe(body, ctx, label, found, depth + 1);

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (1212344) panicked at crates/tla-eval/tests/evaluate_specs.rs:482:5:
assertion `left == right` failed
  left: "\\E s \\in Server : Timeout(s) \\/ BecomeLeader(s) \\/ (\\E c \\in Server : UpdateTerm(s, c) \\/ GrantVote(s, c))"
 right: "BecomeLeader(c = \"s1\")"

failures:
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
