*** crates/tla-eval/src/diagnose.rs:115:76: replace + with * in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with * in Evaluator<'m>::probe
@@ -107,17 +107,17 @@
             }
             Expr::Quant {
                 kind: QuantKind::Exists,
                 bounds,
                 body,
             } => {
                 for binding in self.expand(bounds, ctx)? {
                     let restore = push(ctx, &binding);
-                    let walked = self.probe(body, ctx, label, found, depth + 1);
+                    let walked = self.probe(body, ctx, label, found, depth * /* ~ changed by cargo-mutants ~ */ 1);
                     ctx.locals.truncate(restore);
                     walked?;
                 }
                 Ok(())
             }
             Expr::Let { defs, body } => {
                 let base = ctx.locals.len();
                 let scope = base + defs.len();

*** result: Success
