*** crates/tla-eval/src/diagnose.rs:123:34: replace + with * in Evaluator<'m>::probe

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace + with * in Evaluator<'m>::probe
@@ -115,17 +115,17 @@
                     let walked = self.probe(body, ctx, label, found, depth + 1);
                     ctx.locals.truncate(restore);
                     walked?;
                 }
                 Ok(())
             }
             Expr::Let { defs, body } => {
                 let base = ctx.locals.len();
-                let scope = base + defs.len();
+                let scope = base * /* ~ changed by cargo-mutants ~ */ defs.len();
                 for def in defs {
                     ctx.locals
                         .push((def.name.clone(), Local::Def { def, scope }));
                 }
                 let walked = self.probe(body, ctx, label, found, depth + 1);
                 ctx.locals.truncate(base);
                 walked
             }

*** result: Success
