*** crates/tla-eval/src/diagnose.rs:166:9: replace Evaluator<'m>::enter -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace Evaluator<'m>::enter -> Result<()> with Ok(())
@@ -158,34 +158,17 @@
     fn enter(
         &self,
         def: &'m Def,
         args: &'m [Expr],
         ctx: &mut Ctx<'m, '_>,
         found: &mut Probe,
         depth: usize,
     ) -> Result<()> {
-        if def.params.len() != args.len() {
-            return Ok(());
-        }
-        let mut values = Vec::with_capacity(args.len());
-        for arg in args {
-            values.push(self.eval(arg, ctx)?);
-        }
-        let label = render_call(&def.name, &def.params, &values);
-
-        // An operator sees its parameters and the module, never the locals of
-        // whoever called it -- the same rule evaluation follows.
-        let hidden = std::mem::take(&mut ctx.locals);
-        for (param, value) in def.params.iter().zip(values) {
-            ctx.locals.push((param.name.clone(), Local::Val(value)));
-        }
-        let walked = self.probe(&def.body, ctx, Some(&label), found, depth + 1);
-        ctx.locals = hidden;
-        walked
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Evaluate a leaf action conjunct by conjunct and keep the furthest it got.
     fn record(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>, label: Option<&str>, found: &mut Probe) {
         let parts = conjuncts(e);
         let mut satisfied = 0;
         let mut first_failure = None;
         for part in &parts {

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (654827) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (654842) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (654834) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
