*** crates/tla-eval/src/diagnose.rs:196:39: replace += with *= in Evaluator<'m>::record

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace += with *= in Evaluator<'m>::record
@@ -188,17 +188,17 @@
         let parts = conjuncts(e);
         let mut satisfied = 0;
         let mut first_failure = None;
         for part in &parts {
             // A conjunct after a failed guard may not be evaluable at all --
             // `Head(buf)` once `Len(buf) > 0` is false. That is a failure to
             // satisfy it, not a reason to abandon the whole diagnosis.
             match self.eval_bool(part, ctx) {
-                Ok(true) => satisfied += 1,
+                Ok(true) => satisfied *= /* ~ changed by cargo-mutants ~ */ 1,
                 Ok(false) => {
                     first_failure.get_or_insert((*part, None));
                 }
                 Err(e) => {
                     first_failure.get_or_insert((*part, Some(e.to_string())));
                 }
             }
         }

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (656809) panicked at crates/tla-eval/tests/evaluate_specs.rs:504:5:
assertion `left == right` failed
  left: "Get"
 right: "Put"

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (656817) panicked at crates/tla-eval/tests/evaluate_specs.rs:488:5:
assertion `left == right` failed
  left: (0, 4)
 right: (3, 4)

failures:
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
