*** crates/tla-eval/src/diagnose.rs:230:5: replace conjuncts -> Vec<&Expr> with vec![]

*** mutation diff:
--- crates/tla-eval/src/diagnose.rs
+++ replace conjuncts -> Vec<&Expr> with vec![]
@@ -222,24 +222,17 @@
             _ => {
                 found.best.insert(key, candidate);
             }
         }
     }
 }
 
 fn conjuncts(e: &Expr) -> Vec<&Expr> {
-    match e {
-        Expr::Binary(Op::And, lhs, rhs) => {
-            let mut out = conjuncts(lhs);
-            out.extend(conjuncts(rhs));
-            out
-        }
-        other => vec![other],
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_call(name: &str, params: &[Param], values: &[Value]) -> String {
     if params.is_empty() {
         return name.to_string();
     }
     let bindings: Vec<String> = params
         .iter()

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (206372) panicked at crates/tla-eval/tests/evaluate_specs.rs:527:10:
Get is a candidate

---- closeness_is_measured_over_all_of_an_actions_conjuncts stdout ----

thread 'closeness_is_measured_over_all_of_an_actions_conjuncts' (206379) panicked at crates/tla-eval/tests/evaluate_specs.rs:503:27:
index out of bounds: the len is 0 but the index is 0

---- the_closest_action_and_its_blocking_guard_are_named stdout ----

thread 'the_closest_action_and_its_blocking_guard_are_named' (206387) panicked at crates/tla-eval/tests/evaluate_specs.rs:481:35:
some action came close

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    closeness_is_measured_over_all_of_an_actions_conjuncts
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
