*** crates/tla-eval/src/eval.rs:197:34: replace + with - in Evaluator<'m>::eval

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace + with - in Evaluator<'m>::eval
@@ -189,17 +189,17 @@
                     v = self.update(v, path, rhs, ctx)?;
                 }
                 Ok(v)
             }
             Expr::Quant { kind, bounds, body } => self.quantify(*kind, bounds, body, ctx),
             Expr::Choose { bound, body } => self.choose(bound, body, ctx),
             Expr::Let { defs, body } => {
                 let base = ctx.locals.len();
-                let scope = base + defs.len();
+                let scope = base - /* ~ changed by cargo-mutants ~ */ defs.len();
                 for def in defs {
                     ctx.locals
                         .push((def.name.clone(), Local::Def { def, scope }));
                 }
                 let out = self.eval(body, ctx);
                 ctx.locals.truncate(base);
                 out
             }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (213887) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Undefined("S")

failures:
    bank_transfer_conserves_and_refuses_overdraft

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
