*** crates/tla-eval/src/eval.rs:253:9: replace Evaluator<'m>::eval_all -> Result<Vec<Value>> with Ok(vec![])

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::eval_all -> Result<Vec<Value>> with Ok(vec![])
@@ -245,17 +245,17 @@
     pub(crate) fn eval_bool(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<bool> {
         match self.eval(e, ctx)? {
             Value::Bool(b) => Ok(b),
             other => type_error(format!("expected a boolean, got {other}")),
         }
     }
 
     fn eval_all(&self, items: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Vec<Value>> {
-        items.iter().map(|e| self.eval(e, ctx)).collect()
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn key(&self, args: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let mut values = self.eval_all(args, ctx)?;
         Ok(if values.len() == 1 {
             values.remove(0)
         } else {
             Value::Seq(values)

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (214802) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (214800) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (214804) panicked at crates/tla-eval/tests/evaluate_specs.rs:29:42:
called `Result::unwrap()` on an `Err` value: Malformed("Seq takes 1 argument(s), given 0")

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    an_action_evaluated_as_a_predicate_says_so
    an_allowed_step_has_nothing_to_explain
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term

test result: FAILED. 3 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
