*** crates/tla-eval/src/eval.rs:258:28: replace == with != in Evaluator<'m>::key

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::key
@@ -250,17 +250,17 @@
     }
 
     fn eval_all(&self, items: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Vec<Value>> {
         items.iter().map(|e| self.eval(e, ctx)).collect()
     }
 
     fn key(&self, args: &'m [Expr], ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let mut values = self.eval_all(args, ctx)?;
-        Ok(if values.len() == 1 {
+        Ok(if values.len() != /* ~ changed by cargo-mutants ~ */ 1 {
             values.remove(0)
         } else {
             Value::Seq(values)
         })
     }
 
     fn primed(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let saved = ctx.primed;

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (667491) panicked at crates/tla-eval/tests/evaluate_specs.rs:283:44:
called `Result::unwrap()` on an `Err` value: Type("[a |-> 5, b |-> 5] is not defined at <<\"a\">>")

---- ring_election_builds_its_initial_state stdout ----

thread 'ring_election_builds_its_initial_state' (667501) panicked at crates/tla-eval/tests/evaluate_specs.rs:331:39:
called `Result::unwrap()` on an `Err` value: Type("[n1 |-> \"n2\", n2 |-> \"n3\", n3 |-> \"n1\"] is not defined at <<\"n1\">>")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (667499) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:58:
called `Result::unwrap()` on an `Err` value: Type("[s1 |-> \"candidate\", s2 |-> \"follower\", s3 |-> \"follower\"] is not defined at <<\"s1\">>")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 11 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
