*** crates/tla-eval/src/eval.rs:387:13: delete match arm 2 in Evaluator<'m>::apply_symbol

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete match arm 2 in Evaluator<'m>::apply_symbol
@@ -379,21 +379,17 @@
         }
         let values = self.eval_all(args, ctx)?;
         builtin::call(name, &values)
     }
 
     /// An operator symbol used as a value: `+` in `FoldSet(+, 0, S)`.
     fn apply_symbol(op: Op, mut values: Vec<Value>) -> Result<Value> {
         match values.len() {
-            2 => {
-                let right = values.pop().expect("length checked");
-                let left = values.pop().expect("length checked");
-                combine(op, left, right)
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(Error::Malformed(format!(
                 "`{}` takes two arguments, given {}",
                 op.symbol(),
                 values.len()
             ))),
         }
     }

---- an_operator_symbol_may_be_passed stdout ----

thread 'an_operator_symbol_may_be_passed' (217151) panicked at crates/tla-eval/tests/modules.rs:113:53:
called `Result::unwrap()` on an `Err` value: Malformed("`+` takes two arguments, given 2")

failures:
    an_operator_symbol_may_be_passed

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
