*** crates/tla-eval/src/eval.rs:627:33: replace == with != in Evaluator<'m>::unary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::unary
@@ -619,17 +619,17 @@
         let bindings = args.iter().cloned().map(Local::Val).collect();
         self.run(&def.name, &def.body, scope, &def.params, bindings, ctx)
     }
 
     // -------------------------------------------------------------- operators
 
     fn unary(&self, op: Op, inner: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         if let Some((module, def)) = self.spec.definition(ctx.module, op.symbol())
-            && def.params.len() == 1
+            && def.params.len() != /* ~ changed by cargo-mutants ~ */ 1
         {
             let values = vec![self.eval(inner, ctx)?];
             return self.in_module(module, ctx, |me, ctx| me.call(def, 0, &values, ctx));
         }
         match op {
             Op::Not => Ok(Value::Bool(!self.eval_bool(inner, ctx)?)),
             Op::Minus => match self.eval(inner, ctx)? {
                 Value::Int(n) => Ok(Value::Int(-n)),

---- prefix_and_postfix_definitions_are_evaluated stdout ----

thread 'prefix_and_postfix_definitions_are_evaluated' (224347) panicked at crates/tla-eval/tests/modules.rs:70:42:
called `Result::unwrap()` on an `Err` value: Malformed("User(\"^+\") is not a prefix operator")

failures:
    prefix_and_postfix_definitions_are_evaluated

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
