*** crates/tla-eval/src/eval.rs:673:31: replace == with != in Evaluator<'m>::unchanged

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::unchanged
@@ -665,17 +665,17 @@
                 "{other:?} is not a prefix operator"
             ))),
         }
     }
 
     fn unchanged(&self, e: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         let before = self.eval(e, ctx)?;
         let after = self.primed(e, ctx)?;
-        Ok(Value::Bool(before == after))
+        Ok(Value::Bool(before != /* ~ changed by cargo-mutants ~ */ after))
     }
 
     fn binary(&self, op: Op, lhs: &'m Expr, rhs: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         // The propositional connectives must not evaluate their right operand
         // when the left already decides the answer: a guard like
         // `Len(buf) > 0 /\ Head(buf) = x` relies on it.
         match op {
             Op::And => {

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (677046) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- an_allowed_step_has_nothing_to_explain stdout ----

thread 'an_allowed_step_has_nothing_to_explain' (677043) panicked at crates/tla-eval/tests/evaluate_specs.rs:541:5:
assertion failed: e.why_not("Next", &empty, &one).unwrap().is_empty()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (677045) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:5:
Put

failures:
    an_allowed_step_has_nothing_to_explain
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    closeness_is_measured_over_all_of_an_actions_conjuncts
    paxos_accepts_a_first_phase
    raft_rejects_a_leader_without_a_majority
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 10 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
