*** crates/tla-eval/src/eval.rs:683:47: replace && with || in Evaluator<'m>::binary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace && with || in Evaluator<'m>::binary
@@ -675,17 +675,17 @@
 
     fn binary(&self, op: Op, lhs: &'m Expr, rhs: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         // The propositional connectives must not evaluate their right operand
         // when the left already decides the answer: a guard like
         // `Len(buf) > 0 /\ Head(buf) = x` relies on it.
         match op {
             Op::And => {
                 return Ok(Value::Bool(
-                    self.eval_bool(lhs, ctx)? && self.eval_bool(rhs, ctx)?,
+                    self.eval_bool(lhs, ctx)? || /* ~ changed by cargo-mutants ~ */ self.eval_bool(rhs, ctx)?,
                 ));
             }
             Op::Or => {
                 return Ok(Value::Bool(
                     self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
                 ));
             }
             Op::Implies => {

---- bounded_buffer_rejects_overfilling stdout ----

thread 'bounded_buffer_rejects_overfilling' (679035) panicked at crates/tla-eval/tests/evaluate_specs.rs:60:5:
assertion failed: !e.step_allowed("Next", &full, &over).unwrap()

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (679030) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: true

---- a_temporal_formula_is_refused_rather_than_guessed stdout ----

thread 'a_temporal_formula_is_refused_rather_than_guessed' (679028) panicked at crates/tla-eval/tests/evaluate_specs.rs:442:10:
Spec is a temporal formula: true

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_rejects_lifo
    bounded_buffer_rejects_overfilling
    paxos_rejects_a_proposal_without_a_quorum
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 10 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
