*** crates/tla-eval/src/eval.rs:688:47: replace || with && in Evaluator<'m>::binary

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace || with && in Evaluator<'m>::binary
@@ -680,17 +680,17 @@
         match op {
             Op::And => {
                 return Ok(Value::Bool(
                     self.eval_bool(lhs, ctx)? && self.eval_bool(rhs, ctx)?,
                 ));
             }
             Op::Or => {
                 return Ok(Value::Bool(
-                    self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
+                    self.eval_bool(lhs, ctx)? && /* ~ changed by cargo-mutants ~ */ self.eval_bool(rhs, ctx)?,
                 ));
             }
             Op::Implies => {
                 return Ok(Value::Bool(
                     !self.eval_bool(lhs, ctx)? || self.eval_bool(rhs, ctx)?,
                 ));
             }
             _ => {}

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (680216) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (680222) panicked at crates/tla-eval/tests/evaluate_specs.rs:239:5:
assertion failed: e.step_allowed("Next", &two_votes, &legal).unwrap()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (680215) panicked at crates/tla-eval/tests/evaluate_specs.rs:32:5:
Put

failures:
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_accepts_prepare_and_abort
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
