*** crates/tla-eval/src/eval.rs:715:50: replace == with != in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in combine
@@ -707,17 +707,17 @@
         let right = self.eval(rhs, ctx)?;
         combine(op, left, right)
     }
 }
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
-        Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
+        Op::Equiv => Ok(Value::Bool(as_bool(&a)? != /* ~ changed by cargo-mutants ~ */ as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
         Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),

*** result: Success
