*** crates/tla-eval/src/eval.rs:719:46: replace > with == in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace > with == in combine
@@ -711,17 +711,17 @@
 
 /// The operators whose meaning depends only on their operands' values.
 fn combine(op: Op, a: Value, b: Value) -> Result<Value> {
     match op {
         Op::Equiv => Ok(Value::Bool(as_bool(&a)? == as_bool(&b)?)),
         Op::Eq => Ok(Value::Bool(a == b)),
         Op::Neq => Ok(Value::Bool(a != b)),
         Op::Lt => Ok(Value::Bool(as_int(&a)? < as_int(&b)?)),
-        Op::Gt => Ok(Value::Bool(as_int(&a)? > as_int(&b)?)),
+        Op::Gt => Ok(Value::Bool(as_int(&a)? == /* ~ changed by cargo-mutants ~ */ as_int(&b)?)),
         Op::Le => Ok(Value::Bool(as_int(&a)? <= as_int(&b)?)),
         Op::Ge => Ok(Value::Bool(as_int(&a)? >= as_int(&b)?)),
         Op::Plus => arith(&a, &b, i64::checked_add, "+"),
         Op::Minus => arith(&a, &b, i64::checked_sub, "-"),
         Op::Times => arith(&a, &b, i64::checked_mul, "*"),
         Op::Div => arith(&a, &b, i64::checked_div_euclid, "\\div"),
         Op::Mod => arith(&a, &b, i64::checked_rem_euclid, "%"),
         Op::Pow => {

---- a_wrong_effect_is_distinguished_from_an_unmet_guard stdout ----

thread 'a_wrong_effect_is_distinguished_from_an_unmet_guard' (684962) panicked at crates/tla-eval/tests/evaluate_specs.rs:528:5:
Get was available; it is the state it produced that is wrong: Len(buf) > 0

---- bounded_buffer_rejects_lifo stdout ----

thread 'bounded_buffer_rejects_lifo' (684967) panicked at crates/tla-eval/tests/evaluate_specs.rs:49:5:
assertion failed: e.step_allowed("Next", &full, &fifo).unwrap()

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (684966) panicked at crates/tla-eval/tests/evaluate_specs.rs:35:5:
Get

failures:
    a_wrong_effect_is_distinguished_from_an_unmet_guard
    bounded_buffer_accepts_the_protocol
    bounded_buffer_rejects_lifo
    raft_rejects_a_leader_without_a_majority
    the_closest_action_and_its_blocking_guard_are_named

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
