*** crates/tla-eval/src/eval.rs:748:20: delete ! in combine

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in combine
@@ -740,17 +740,17 @@
                 if !member(&item, &b)? {
                     return Ok(Value::Bool(false));
                 }
             }
             Ok(Value::Bool(true))
         }
         Op::Supseteq => {
             for item in elements(&b)? {
-                if !member(&item, &a)? {
+                if  /* ~ changed by cargo-mutants ~ */member(&item, &a)? {
                     return Ok(Value::Bool(false));
                 }
             }
             Ok(Value::Bool(true))
         }
         Op::Cup => {
             let mut out = set_of(&a)?.clone();
             out.extend(set_of(&b)?.iter().cloned());

*** result: Success
