*** crates/tla-eval/src/eval.rs:892:23: replace == with != in Evaluator<'m>::quantify

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace == with != in Evaluator<'m>::quantify
@@ -884,17 +884,17 @@
         body: &'m Expr,
         ctx: &mut Ctx<'m, '_>,
     ) -> Result<Value> {
         let wanted = kind == QuantKind::Exists;
         for binding in self.expand(bounds, ctx)? {
             let restore = push(ctx, &binding);
             let holds = self.eval_bool(body, ctx);
             ctx.locals.truncate(restore);
-            if holds? == wanted {
+            if holds? != /* ~ changed by cargo-mutants ~ */ wanted {
                 return Ok(Value::Bool(wanted));
             }
         }
         Ok(Value::Bool(!wanted))
     }
 
     /// `CHOOSE` must be deterministic: the same set and predicate always give
     /// the same answer. Taking the least satisfying element in the value order

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (692465) panicked at crates/tla-eval/tests/evaluate_specs.rs:291:5:
assertion failed: !e.step_allowed("Next", &nearly_empty, &overdrawn).unwrap()

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (692476) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:5:
assertion failed: !e.step_allowed("Next", &init, &forwarded).unwrap()

---- paxos_rejects_a_proposal_without_a_quorum stdout ----

thread 'paxos_rejects_a_proposal_without_a_quorum' (692471) panicked at crates/tla-eval/tests/evaluate_specs.rs:421:5:
assertion failed: !e.step_allowed("Next", &init, &proposed).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_rejects_a_proposal_without_a_quorum
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 13 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
