*** crates/tla-eval/src/eval.rs:896:24: delete ! in Evaluator<'m>::quantify

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ delete ! in Evaluator<'m>::quantify
@@ -888,17 +888,17 @@
         for binding in self.expand(bounds, ctx)? {
             let restore = push(ctx, &binding);
             let holds = self.eval_bool(body, ctx);
             ctx.locals.truncate(restore);
             if holds? == wanted {
                 return Ok(Value::Bool(wanted));
             }
         }
-        Ok(Value::Bool(!wanted))
+        Ok(Value::Bool( /* ~ changed by cargo-mutants ~ */wanted))
     }
 
     /// `CHOOSE` must be deterministic: the same set and predicate always give
     /// the same answer. Taking the least satisfying element in the value order
     /// is one such rule, and sets are already held in that order.
     fn choose(&self, bound: &'m Bound, body: &'m Expr, ctx: &mut Ctx<'m, '_>) -> Result<Value> {
         for binding in self.expand(std::slice::from_ref(bound), ctx)? {
             let restore = push(ctx, &binding);

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (692530) panicked at crates/tla-eval/tests/evaluate_specs.rs:291:5:
assertion failed: !e.step_allowed("Next", &nearly_empty, &overdrawn).unwrap()

---- paxos_rejects_a_proposal_without_a_quorum stdout ----

thread 'paxos_rejects_a_proposal_without_a_quorum' (692538) panicked at crates/tla-eval/tests/evaluate_specs.rs:421:5:
assertion failed: !e.step_allowed("Next", &init, &proposed).unwrap()

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (692540) panicked at crates/tla-eval/tests/evaluate_specs.rs:225:5:
assertion failed: !e.step_allowed("Next", &one_vote, &crowned).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_rejects_a_proposal_without_a_quorum
    raft_rejects_a_leader_without_a_majority
    raft_rejects_a_second_vote_in_the_same_term
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    two_phase_rejects_commit_before_every_rm_prepared

test result: FAILED. 13 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
