*** crates/tla-eval/src/eval.rs:937:9: replace Evaluator<'m>::expand_into -> Result<()> with Ok(())

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::expand_into -> Result<()> with Ok(())
@@ -929,52 +929,17 @@
 
     fn expand_into(
         &self,
         bounds: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,
         current: &mut Vec<(String, Value)>,
         out: &mut Vec<Vec<(String, Value)>>,
     ) -> Result<()> {
-        let Some((first, rest)) = bounds.split_first() else {
-            check_size(out.len() + 1, "a quantifier")?;
-            out.push(current.clone());
-            return Ok(());
-        };
-        let Some(domain) = &first.domain else {
-            return Err(Error::Unbounded(format!(
-                "`{}` is quantified over no set, so it cannot be enumerated",
-                first.names.join(", ")
-            )));
-        };
-        let items = elements(&self.eval(domain, ctx)?)?;
-
-        if first.destructure {
-            for item in items {
-                let Value::Seq(parts) = &item else {
-                    return type_error(format!("cannot destructure {item}, which is not a tuple"));
-                };
-                if parts.len() != first.names.len() {
-                    return type_error(format!(
-                        "cannot destructure {item} into {} names",
-                        first.names.len()
-                    ));
-                }
-                let restore = ctx.locals.len();
-                for (name, part) in first.names.iter().zip(parts) {
-                    current.push((name.clone(), part.clone()));
-                    ctx.locals.push((name.clone(), Local::Val(part.clone())));
-                }
-                self.expand_into(rest, ctx, current, out)?;
-                current.truncate(current.len() - first.names.len());
-                ctx.locals.truncate(restore);
-            }
-            return Ok(());
-        }
-        self.product(&first.names, &items, rest, ctx, current, out)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn product(
         &self,
         names: &[String],
         items: &[Value],
         rest: &'m [Bound],
         ctx: &mut Ctx<'m, '_>,

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (694729) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- paxos_accepts_a_first_phase stdout ----

thread 'paxos_accepts_a_first_phase' (694734) panicked at crates/tla-eval/tests/evaluate_specs.rs:401:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (694740) panicked at crates/tla-eval/tests/evaluate_specs.rs:365:5:
assertion failed: e.step_allowed("Next", &init, &discarded).unwrap()

failures:
    bank_transfer_conserves_and_refuses_overdraft
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_builds_its_initial_state
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
