*** crates/tla-eval/src/eval.rs:93:9: replace Evaluator<'m>::holds_at -> Result<bool> with Ok(false)

*** mutation diff:
--- crates/tla-eval/src/eval.rs
+++ replace Evaluator<'m>::holds_at -> Result<bool> with Ok(false)
@@ -85,18 +85,17 @@
                 missing.join(", ")
             )));
         }
         Ok(Self { spec, constants })
     }
 
     /// Does the named state predicate hold at `state`?
     pub fn holds_at(&self, name: &str, state: &State) -> Result<bool> {
-        let body = self.body_of(name)?;
-        self.eval_bool(body, &mut self.ctx(state, None))
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Is `from -> to` a step the named action permits?
     pub fn step_allowed(&self, name: &str, from: &State, to: &State) -> Result<bool> {
         let body = self.body_of(name)?;
         self.eval_bool(body, &mut self.ctx(from, Some(to)))
     }

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (663115) panicked at crates/tla-eval/tests/evaluate_specs.rs:281:5:
assertion failed: e.holds_at("Init", &init).unwrap()

---- an_action_evaluated_as_a_predicate_says_so stdout ----

thread 'an_action_evaluated_as_a_predicate_says_so' (663113) panicked at crates/tla-eval/tests/evaluate_specs.rs:432:10:
Next primes its variables: false

---- bounded_buffer_accepts_the_protocol stdout ----

thread 'bounded_buffer_accepts_the_protocol' (663116) panicked at crates/tla-eval/tests/evaluate_specs.rs:28:5:
assertion failed: e.holds_at("Init", &empty).unwrap()

failures:
    a_temporal_formula_is_refused_rather_than_guessed
    an_action_evaluated_as_a_predicate_says_so
    bank_transfer_conserves_and_refuses_overdraft
    bounded_buffer_accepts_the_protocol
    paxos_accepts_a_first_phase
    raft_accepts_an_election
    ring_election_builds_its_initial_state
    two_phase_accepts_prepare_and_abort

test result: FAILED. 12 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
