*** crates/tla-eval/src/spec.rs:105:9: replace Spec::variables -> impl Iterator<Item =&str> with ::std::iter::once("xyzzy")

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace Spec::variables -> impl Iterator<Item =&str> with ::std::iter::once("xyzzy")
@@ -97,17 +97,17 @@
     }
 
     pub fn name(&self) -> &str {
         &self.modules[self.root].name
     }
 
     /// The variables of the root module, including any it inherits.
     pub fn variables(&self) -> impl Iterator<Item = &str> {
-        self.facts[self.root].variables.iter().map(String::as_str)
+        ::std::iter::once("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn constants(&self) -> impl Iterator<Item = &str> {
         self.facts[self.root].constants.iter().map(String::as_str)
     }
 
     pub fn defines(&self, name: &str) -> bool {
         self.definition(self.root, name).is_some()

---- a_module_may_extend_another stdout ----

thread 'a_module_may_extend_another' (715980) panicked at crates/tla-eval/tests/modules.rs:143:5:
assertion `left == right` failed
  left: ["xyzzy"]
 right: ["x"]

failures:
    a_module_may_extend_another

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
