*** crates/tla-eval/src/spec.rs:171:41: replace == with != in Spec::find_instance

*** mutation diff:
--- crates/tla-eval/src/spec.rs
+++ replace == with != in Spec::find_instance
@@ -163,17 +163,17 @@
         seen: &mut BTreeSet<usize>,
     ) -> Option<&Instance> {
         if !seen.insert(module) {
             return None;
         }
         let here = self.facts[module]
             .instances
             .iter()
-            .find(|i| i.name.as_deref() == Some(name));
+            .find(|i| i.name.as_deref() != /* ~ changed by cargo-mutants ~ */ Some(name));
         if here.is_some() {
             return here;
         }
         self.facts[module]
             .extends
             .iter()
             .find_map(|&parent| self.find_instance(parent, name, seen))
     }

---- a_name_the_with_clause_omits_keeps_its_own_name stdout ----

thread 'a_name_the_with_clause_omits_keeps_its_own_name' (725561) panicked at crates/tla-eval/tests/modules.rs:258:50:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `I`")

---- instances_may_be_chained stdout ----

thread 'instances_may_be_chained' (725567) panicked at crates/tla-eval/tests/modules.rs:284:51:
called `Result::unwrap()` on an `Err` value: Undefined("no instance named `Mid`")

---- instances_of_one_module_keep_their_own_constants stdout ----

thread 'instances_of_one_module_keep_their_own_constants' (725568) panicked at crates/tla-eval/tests/modules.rs:238:5:
assertion failed: e.step_allowed("Next", &at, &state(&[("a", 3), ("b", 4)])).unwrap()

failures:
    a_name_the_with_clause_omits_keeps_its_own_name
    instances_may_be_chained
    instances_of_one_module_keep_their_own_constants
    priming_reaches_through_a_substitution

test result: FAILED. 10 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
