*** crates/tla-eval/src/value.rs:107:13: delete match arm Value::Func(map) in Value::domain

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ delete match arm Value::Func(map) in Value::domain
@@ -99,17 +99,17 @@
             _ => None,
         }
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
-            Value::Func(map) => Some(map.keys().cloned().collect()),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     pub fn apply(&self, key: &Value) -> Option<Value> {
         match (self, key) {
             (Value::Seq(items), Value::Int(i)) => usize::try_from(*i)
                 .ok()?

---- domain_and_application_agree_for_every_representation stdout ----

thread 'domain_and_application_agree_for_every_representation' (740563) panicked at crates/tla-eval/tests/standard_operators.rs:187:5:
assertion `left == right` failed
  left: None
 right: Some({Int(2), Int(4)})

failures:
    domain_and_application_agree_for_every_representation

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
