*** crates/tla-eval/src/value.rs:137:9: replace Value::is_set -> bool with true

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::is_set -> bool with true
@@ -129,17 +129,17 @@
             Value::Seq(_) => "a sequence",
             Value::Set(_) | Value::Infinite(_) => "a set",
             Value::Record(_) => "a record",
             Value::Func(_) => "a function",
         }
     }
 
     pub fn is_set(&self) -> bool {
-        matches!(self, Value::Set(_) | Value::Infinite(_))
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Value {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Value::Bool(b) => f.write_str(if *b { "TRUE" } else { "FALSE" }),
             Value::Int(n) => write!(f, "{n}"),

---- values_describe_themselves stdout ----

thread 'values_describe_themselves' (744915) panicked at crates/tla-eval/tests/standard_operators.rs:236:9:
assertion `left == right` failed: TRUE
  left: true
 right: false

failures:
    values_describe_themselves

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
