*** crates/tla-eval/src/value.rs:84:9: replace Value::entries -> Option<BTreeMap<Value, Value>> with Some(BTreeMap::new())

*** mutation diff:
--- crates/tla-eval/src/value.rs
+++ replace Value::entries -> Option<BTreeMap<Value, Value>> with Some(BTreeMap::new())
@@ -76,33 +76,17 @@
                     .collect(),
             );
         }
         Value::Func(entries)
     }
 
     /// The function's graph, for values that are functions.
     pub fn entries(&self) -> Option<BTreeMap<Value, Value>> {
-        match self {
-            Value::Seq(items) => Some(
-                items
-                    .iter()
-                    .enumerate()
-                    .map(|(i, v)| (Value::Int(count(i) + 1), v.clone()))
-                    .collect(),
-            ),
-            Value::Record(fields) => Some(
-                fields
-                    .iter()
-                    .map(|(k, v)| (Value::Str(k.clone()), v.clone()))
-                    .collect(),
-            ),
-            Value::Func(map) => Some(map.clone()),
-            _ => None,
-        }
+        Some(BTreeMap::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn domain(&self) -> Option<BTreeSet<Value>> {
         match self {
             Value::Seq(items) => Some((1..=count(items.len())).map(Value::Int).collect()),
             Value::Record(fields) => Some(fields.keys().cloned().map(Value::Str).collect()),
             Value::Func(map) => Some(map.keys().cloned().collect()),
             _ => None,

---- bank_transfer_conserves_and_refuses_overdraft stdout ----

thread 'bank_transfer_conserves_and_refuses_overdraft' (735417) panicked at crates/tla-eval/tests/evaluate_specs.rs:287:51:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [a |-> 4] is not defined at \"b\"")

---- raft_rejects_a_leader_without_a_majority stdout ----

thread 'raft_rejects_a_leader_without_a_majority' (735425) panicked at crates/tla-eval/tests/evaluate_specs.rs:239:5:
assertion failed: e.step_allowed("Next", &two_votes, &legal).unwrap()

---- ring_election_rejects_forwarding_a_smaller_id stdout ----

thread 'ring_election_rejects_forwarding_a_smaller_id' (735428) panicked at crates/tla-eval/tests/evaluate_specs.rs:356:56:
called `Result::unwrap()` on an `Err` value: Type("EXCEPT: [n1 |-> {}] is not defined at \"n2\"")

failures:
    bank_transfer_conserves_and_refuses_overdraft
    raft_accepts_an_election
    raft_rejects_a_leader_without_a_majority
    ring_election_rejects_forwarding_a_smaller_id
    the_closest_action_and_its_blocking_guard_are_named
    two_phase_accepts_prepare_and_abort

test result: FAILED. 14 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
