*** crates/tla-oracle/src/check.rs:130:21: replace == with != in Report::passed

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace == with != in Report::passed
@@ -122,17 +122,17 @@
     /// For a refinement failure: which actions came closest, closest first.
     #[serde(skip_serializing_if = "Vec::is_empty")]
     pub blocked: Vec<BlockedReport>,
     pub stats: Stats,
 }
 
 impl Report {
     pub fn passed(&self) -> bool {
-        self.status == Status::Pass
+        self.status != /* ~ changed by cargo-mutants ~ */ Status::Pass
     }
 
     fn of(status: Status, detail: impl Into<String>, stats: Stats) -> Self {
         Self {
             status,
             detail: detail.into(),
             edge: None,
             outcome: None,

---- the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept stdout ----

thread 'the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept' (748760) panicked at crates/tla-oracle/tests/jobs.rs:198:5:
assertion failed: passing.passed()

failures:
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
