*** crates/tla-oracle/src/check.rs:147:9: delete field states from struct Stats expression in check

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ delete field states from struct Stats expression in check
@@ -139,17 +139,17 @@
             blocked: Vec::new(),
             stats,
         }
     }
 }
 
 pub fn check(job: &Job) -> Report {
     let mut stats = Stats {
-        states: job.states.len(),
+         /* ~ changed by cargo-mutants ~ */
         edges: job.edges.len(),
         ..Stats::default()
     };
 
     let spec = match Spec::parse(&job.spec) {
         Ok(s) => s,
         Err(e) => return Report::of(Status::Error, format!("specification: {e}"), stats),
     };

---- the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept stdout ----

thread 'the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept' (749089) panicked at crates/tla-oracle/tests/jobs.rs:199:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
