*** crates/tla-oracle/src/check.rs:341:5: replace decode_states -> Result<Vec<State>, String> with Ok(vec![])

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace decode_states -> Result<Vec<State>, String> with Ok(vec![])
@@ -333,23 +333,17 @@
             decode(&spec.value, &spec.schema, name)
                 .map(|v| (name.clone(), v))
                 .map_err(|e| format!("constant {e}"))
         })
         .collect()
 }
 
 fn decode_states(job: &Job) -> Result<Vec<State>, String> {
-    job.states
-        .iter()
-        .enumerate()
-        .map(|(i, json)| {
-            decode_state(json, &job.schema, &format!("state[{i}]")).map_err(|e| e.to_string())
-        })
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_outcomes(job: &Job) -> Result<Vec<(String, Expr)>, String> {
     job.outcomes
         .iter()
         .map(|(name, src)| {
             parse_expression(src)
                 .map(|e| (name.clone(), e))

---- a_boolean_is_not_accepted_where_an_integer_is_wanted stdout ----

thread 'a_boolean_is_not_accepted_where_an_integer_is_wanted' (752974) panicked at crates/tla-oracle/tests/jobs.rs:266:5:
the implementation reported no states at all

---- a_constant_without_a_value_is_an_error stdout ----

thread 'a_constant_without_a_value_is_an_error' (752976) panicked at crates/tla-oracle/tests/jobs.rs:145:5:
assertion `left == right` failed
  left: Contract
 right: Error

---- a_state_of_the_wrong_shape_is_a_contract_violation stdout ----

thread 'a_state_of_the_wrong_shape_is_a_contract_violation' (752982) panicked at crates/tla-oracle/tests/jobs.rs:99:5:
the implementation reported no states at all

failures:
    a_boolean_is_not_accepted_where_an_integer_is_wanted
    a_constant_without_a_value_is_an_error
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    a_state_the_specification_cannot_read_is_a_contract_violation
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report

test result: FAILED. 3 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
