*** crates/tla-oracle/src/check.rs:341:5: replace decode_states -> Result<Vec<State>, String> with Ok(vec![Default::default()])

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace decode_states -> Result<Vec<State>, String> with Ok(vec![Default::default()])
@@ -333,23 +333,17 @@
             decode(&spec.value, &spec.schema, name)
                 .map(|v| (name.clone(), v))
                 .map_err(|e| format!("constant {e}"))
         })
         .collect()
 }
 
 fn decode_states(job: &Job) -> Result<Vec<State>, String> {
-    job.states
-        .iter()
-        .enumerate()
-        .map(|(i, json)| {
-            decode_state(json, &job.schema, &format!("state[{i}]")).map_err(|e| e.to_string())
-        })
-        .collect()
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_outcomes(job: &Job) -> Result<Vec<(String, Expr)>, String> {
     job.outcomes
         .iter()
         .map(|(name, src)| {
             parse_expression(src)
                 .map(|e| (name.clone(), e))

---- a_boolean_is_not_accepted_where_an_integer_is_wanted stdout ----

thread 'a_boolean_is_not_accepted_where_an_integer_is_wanted' (752999) panicked at crates/tla-oracle/tests/jobs.rs:265:5:
assertion `left == right` failed: Init: the state gives no value for variable `s`
  left: Error
 right: Contract

---- a_state_the_specification_cannot_read_is_a_contract_violation stdout ----

thread 'a_state_the_specification_cannot_read_is_a_contract_violation' (753009) panicked at crates/tla-oracle/tests/jobs.rs:239:5:
assertion `left == right` failed: Init: the state gives no value for variable `s`
  left: Error
 right: Contract

---- a_state_of_the_wrong_shape_is_a_contract_violation stdout ----

thread 'a_state_of_the_wrong_shape_is_a_contract_violation' (753007) panicked at crates/tla-oracle/tests/jobs.rs:98:5:
assertion `left == right` failed: Init: the state gives no value for variable `buf`
  left: Error
 right: Contract

failures:
    a_boolean_is_not_accepted_where_an_integer_is_wanted
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    a_state_the_specification_cannot_read_is_a_contract_violation
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error

test result: FAILED. 4 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
