*** crates/tla-oracle/src/check.rs:35:5: replace next_default -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-oracle/src/check.rs
+++ replace next_default -> String with "xyzzy".into()
@@ -27,17 +27,17 @@
     pub outcomes: BTreeMap<String, String>,
 }
 
 fn init_default() -> String {
     "Init".to_string()
 }
 
 fn next_default() -> String {
-    "Next".to_string()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Deserialize)]
 pub struct ConstantSpec {
     pub value: Json,
     pub schema: Schema,
 }

---- a_legal_walk_passes stdout ----

thread 'a_legal_walk_passes' (750957) panicked at crates/tla-oracle/tests/jobs.rs:45:5:
assertion `left == right` failed: xyzzy: `xyzzy` is not defined
  left: Error
 right: Pass

---- a_refinement_failure_names_the_action_that_came_closest stdout ----

thread 'a_refinement_failure_names_the_action_that_came_closest' (750961) panicked at crates/tla-oracle/tests/jobs.rs:173:42:
an action came close

---- an_illegal_edge_is_named stdout ----

thread 'an_illegal_edge_is_named' (750965) panicked at crates/tla-oracle/tests/jobs.rs:69:5:
assertion `left == right` failed: xyzzy: `xyzzy` is not defined
  left: Error
 right: Refines

failures:
    a_legal_walk_passes
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    an_illegal_edge_is_named
    an_unreachable_outcome_is_a_coverage_failure
    the_verdict_is_readable_as_a_boolean_and_the_counts_are_kept

test result: FAILED. 14 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
