*** crates/tla-oracle/src/schema.rs:65:24: delete ! in decode

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ delete ! in decode
@@ -57,17 +57,17 @@
         path: path.to_string(),
         message: message.into(),
     })
 }
 
 pub fn decode(json: &Json, schema: &Schema, path: &str) -> Result<Value> {
     match schema {
         Schema::Int => match json.as_i64() {
-            Some(n) if !json.is_boolean() => Ok(Value::Int(n)),
+            Some(n) if  /* ~ changed by cargo-mutants ~ */json.is_boolean() => Ok(Value::Int(n)),
             _ => fail(path, format!("expected an integer, got {}", kind_of(json))),
         },
         Schema::Bool => match json.as_bool() {
             Some(b) => Ok(Value::Bool(b)),
             None => fail(path, format!("expected a boolean, got {}", kind_of(json))),
         },
         Schema::Str => match json.as_str() {
             Some(s) => Ok(Value::string(s)),

---- a_constant_without_a_value_is_an_error stdout ----

thread 'a_constant_without_a_value_is_an_error' (755039) panicked at crates/tla-oracle/tests/jobs.rs:145:5:
assertion `left == right` failed
  left: Contract
 right: Error

---- an_edge_pointing_outside_the_graph_is_an_error stdout ----

thread 'an_edge_pointing_outside_the_graph_is_an_error' (755047) panicked at crates/tla-oracle/tests/jobs.rs:247:5:
constant Capacity: expected an integer, got a number

---- a_missing_variable_is_a_contract_violation stdout ----

thread 'a_missing_variable_is_a_contract_violation' (755041) panicked at crates/tla-oracle/tests/jobs.rs:106:5:
assertion `left == right` failed: constant Capacity: expected an integer, got a number
  left: Error
 right: Contract

failures:
    a_constant_without_a_value_is_an_error
    a_legal_walk_passes
    a_missing_variable_is_a_contract_violation
    a_reachable_outcome_passes
    a_refinement_failure_names_the_action_that_came_closest
    a_state_of_the_wrong_shape_is_a_contract_violation
    a_state_the_specification_cannot_read_is_a_contract_violation
    an_edge_pointing_outside_the_graph_is_an_error
    an_illegal_edge_is_named
    an_illegal_root_is_an_init_failure
    an_illegal_root_is_quoted_in_the_report
    an_outcome_that_is_not_a_predicate_is_an_error

test result: FAILED. 3 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
