*** crates/tla-oracle/src/schema.rs:81:20: delete ! in decode

*** mutation diff:
--- crates/tla-oracle/src/schema.rs
+++ delete ! in decode
@@ -73,17 +73,17 @@
             Some(s) => Ok(Value::string(s)),
             None => fail(path, format!("expected a string, got {}", kind_of(json))),
         },
         Schema::Set { of } => {
             let items = array(json, path)?;
             let mut out = BTreeSet::new();
             for (i, item) in items.iter().enumerate() {
                 let value = decode(item, of, &format!("{path}[{i}]"))?;
-                if !out.insert(value) {
+                if  /* ~ changed by cargo-mutants ~ */out.insert(value) {
                     return fail(
                         path,
                         format!("element {i} is a duplicate; a set has no repeats"),
                     );
                 }
             }
             Ok(Value::Set(out))
         }

*** result: Success
