*** crates/tla-syntax/src/ast.rs:105:9: replace Bound::mentions_next_state -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace Bound::mentions_next_state -> bool with true
@@ -97,17 +97,17 @@
     /// Absent for the unbounded forms, as in `\E x : P`.
     pub domain: Option<Expr>,
     /// True for `<<x, y>> \in S`, which destructures each element.
     pub destructure: bool,
 }
 
 impl Bound {
     pub fn mentions_next_state(&self) -> bool {
-        self.domain.as_ref().is_some_and(Expr::mentions_next_state)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub enum QuantKind {
     Forall,
     Exists,
     /// `\AA` and `\EE`, which quantify over a hidden *variable* rather than a

---- a_guard_does_not_constrain_the_successor_state stdout ----

thread 'a_guard_does_not_constrain_the_successor_state' (765023) panicked at crates/tla-syntax/tests/queries.rs:42:9:
`{y \in S : y > x}` mentions no next state

failures:
    a_guard_does_not_constrain_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
