*** crates/tla-syntax/src/ast.rs:121:9: replace QuantKind::is_temporal -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace QuantKind::is_temporal -> bool with false
@@ -113,17 +113,17 @@
     /// `\AA` and `\EE`, which quantify over a hidden *variable* rather than a
     /// value, and so describe behaviours rather than states.
     TemporalForall,
     TemporalExists,
 }
 
 impl QuantKind {
     pub fn is_temporal(self) -> bool {
-        matches!(self, Self::TemporalForall | Self::TemporalExists)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ExceptPath {
     Index(Expr),
     Field(String),
 }

---- temporal_quantifiers_parse_and_are_marked_as_such stdout ----

thread 'temporal_quantifiers_parse_and_are_marked_as_such' (765990) panicked at crates/tla-syntax/tests/grammar.rs:137:5:
assertion failed: kind.is_temporal()

failures:
    temporal_quantifiers_parse_and_are_marked_as_such

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
