*** crates/tla-syntax/src/ast.rs:246:44: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -238,17 +238,17 @@
             | Expr::ActionBox { .. }
             | Expr::ActionAngle { .. }
             | Expr::Fairness { .. } => true,
             Expr::Unary(op, inner) => {
                 *op == Op::Unchanged || *op == Op::Enabled || inner.mentions_next_state()
             }
             Expr::Binary(_, lhs, rhs) => lhs.mentions_next_state() || rhs.mentions_next_state(),
             Expr::Apply(head, args) | Expr::FnApply(head, args) => {
-                head.mentions_next_state() || args.iter().any(Expr::mentions_next_state)
+                head.mentions_next_state() && /* ~ changed by cargo-mutants ~ */ args.iter().any(Expr::mentions_next_state)
             }
             Expr::Field(inner, _) => inner.mentions_next_state(),
             Expr::Qualified { args, .. } => args.iter().any(Expr::mentions_next_state),
             Expr::Tuple(items) | Expr::SetEnum(items) => {
                 items.iter().any(Expr::mentions_next_state)
             }
             Expr::SetFilter { bound, pred } => {
                 bound.mentions_next_state() || pred.mentions_next_state()

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (771667) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`f[x']` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
