*** crates/tla-syntax/src/ast.rs:263:46: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -255,17 +255,17 @@
             }
             Expr::SetMap { expr, bounds } => {
                 expr.mentions_next_state() || bounds.iter().any(Bound::mentions_next_state)
             }
             Expr::Record(fields) | Expr::RecordSet(fields) => {
                 fields.iter().any(|(_, v)| v.mentions_next_state())
             }
             Expr::FnSet { domain, range } => {
-                domain.mentions_next_state() || range.mentions_next_state()
+                domain.mentions_next_state() && /* ~ changed by cargo-mutants ~ */ range.mentions_next_state()
             }
             Expr::Except { base, updates } => {
                 base.mentions_next_state()
                     || updates.iter().any(|(path, value)| {
                         value.mentions_next_state()
                             || path.iter().any(|step| match step {
                                 ExceptPath::Index(e) => e.mentions_next_state(),
                                 ExceptPath::Field(_) => false,

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (774608) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`[S' -> T]` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
