*** crates/tla-syntax/src/ast.rs:301:21: replace || with && in Expr::mentions_next_state

*** mutation diff:
--- crates/tla-syntax/src/ast.rs
+++ replace || with && in Expr::mentions_next_state
@@ -293,17 +293,17 @@
             Expr::Lambda { body, .. } => body.mentions_next_state(),
             Expr::Let {
                 defs,
                 instances,
                 body,
             } => {
                 body.mentions_next_state()
                     || defs.iter().any(|d| d.body.mentions_next_state())
-                    || instances
+                    && /* ~ changed by cargo-mutants ~ */ instances
                         .iter()
                         .any(|i| i.subs.iter().any(|(_, e)| e.mentions_next_state()))
             }
             Expr::If {
                 cond,
                 then,
                 otherwise,
             } => {

---- an_effect_constrains_the_successor_state stdout ----

thread 'an_effect_constrains_the_successor_state' (1212221) panicked at crates/tla-syntax/tests/queries.rs:88:9:
`LET k == x' IN k` constrains the next state

failures:
    an_effect_constrains_the_successor_state

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
