*** crates/tla-syntax/src/lexer.rs:107:56: replace && with || in Lexer::run

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace && with || in Lexer::run
@@ -99,17 +99,17 @@
             let (line, col) = (self.line, self.col);
             let Some(c) = self.peek() else { break };
             let tok = self.scan(c)?;
             match tok {
                 Tok::Kw(Kw::Module) => depth += 1,
                 Tok::ModuleEnd => depth = depth.saturating_sub(1),
                 _ => {}
             }
-            let closed = matches!(tok, Tok::ModuleEnd) && depth == 0;
+            let closed = matches!(tok, Tok::ModuleEnd) || /* ~ changed by cargo-mutants ~ */ depth == 0;
             self.out.push(Token { tok, line, col });
             if closed {
                 break;
             }
         }
         self.out.push(Token {
             tok: Tok::Eof,
             line: self.line,

---- a_choose_inside_braces_is_not_a_set_filter stdout ----

thread 'a_choose_inside_braces_is_not_a_set_filter' (812058) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:5: no `---- MODULE ----` header found
in:

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (812059) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:5: no `---- MODULE ----` header found
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (812061) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 1:5: no `---- MODULE ----` header found
in:

failures:
    a_choose_inside_braces_is_not_a_set_filter
    a_fairness_subscript_may_be_a_tuple
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_module_may_contain_another
    a_name_may_begin_with_a_digit_or_an_underscore
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_be_passed_as_an_argument

test result: FAILED. 0 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
