*** crates/tla-syntax/src/lexer.rs:170:69: replace == with != in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::scan
@@ -162,17 +162,17 @@
             return self.scan_number();
         }
         // A lone `_` is the placeholder in `Op(_, _)`; followed by more, it is
         // an ordinary identifier, and `]_vars` is disambiguated by the parser.
         if c.is_ascii_alphabetic()
             || (c == '_'
                 && self
                     .at(1)
-                    .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
+                    .is_some_and(|n| n.is_ascii_alphanumeric() || n != /* ~ changed by cargo-mutants ~ */ '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
             '<' => Ok(self.scan_lt()),

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (827667) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BoundedBuffer.tla: parse error at 34:25: expected Underscore, found Ident("_")

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (827665) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected Underscore, found Ident(\"_\")", line: 73, col: 25 }

---- module_name_and_extends stdout ----

thread 'module_name_and_extends' (827670) panicked at crates/tla-syntax/tests/parse_specs.rs:39:49:
parses: Error { stage: Parse, message: "expected Underscore, found Ident(\"_\")", line: 73, col: 25 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
