*** crates/tla-syntax/src/lexer.rs:178:13: delete match arm '<' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '<' in Lexer::scan
@@ -170,17 +170,17 @@
                     .is_some_and(|n| n.is_ascii_alphanumeric() || n == '_'))
         {
             return Ok(self.scan_word());
         }
         match c {
             '"' => self.scan_string(),
             '=' => self.scan_equals(),
             '-' => Ok(self.scan_dashes()),
-            '<' => Ok(self.scan_lt()),
+             /* ~ changed by cargo-mutants ~ */
             '>' => Ok(self.scan_gt()),
             '\\' => self.scan_backslash(),
             '/' => self.scan_slash(),
             '|' => {
                 if self.starts_with("|->") {
                     self.advance(3);
                     return Ok(Tok::MapsTo);
                 }

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (830717) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:9: unexpected character '<'
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (830724) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 3:1: unexpected character '<'
in:

---- an_infix_operator_can_be_defined stdout ----

thread 'an_infix_operator_can_be_defined' (830726) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:16: unexpected character '<'
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_proof_is_skipped_and_the_module_continues
    an_infix_operator_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 19 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
