*** crates/tla-syntax/src/lexer.rs:232:13: delete match arm '.' in Lexer::scan

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '.' in Lexer::scan
@@ -224,29 +224,17 @@
                 } else {
                     self.bump();
                     Ok(Tok::Op(Op::Not))
                 }
             }
             '&' | '$' | '?' | '%' | '#' | '!' | '^' | '(' | '+' | '*' => self
                 .user_symbol()
                 .map_or_else(|| self.scan_punctuation(c), Ok),
-            '.' => {
-                if self.starts_with("...") {
-                    self.advance(3);
-                    return Ok(Tok::Op(Op::User("...")));
-                }
-                if self.starts_with("..") {
-                    self.advance(2);
-                    Ok(Tok::Op(Op::DotDot))
-                } else {
-                    self.bump();
-                    Ok(Tok::Dot)
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             '[' => {
                 if self.starts_with("[]") {
                     self.advance(2);
                     Ok(Tok::Op(Op::Always))
                 } else {
                     self.bump();
                     Ok(Tok::LBrack)
                 }

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1329075) panicked at crates/tla-syntax/tests/boundaries.rs:120:5:
assertion failed: defines("-. a == 0 - a", "-")

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1329071) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
lex error at 3:2: unexpected character '.'
in:

failures:
    a_definition_of_any_shape_ends_the_previous_one
    a_prefix_definition_needs_a_name_or_a_hole

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
