*** crates/tla-syntax/src/lexer.rs:259:13: delete match arm '\'' in Lexer::scan_punctuation

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm '\'' in Lexer::scan_punctuation
@@ -251,17 +251,17 @@
         Ok(match c {
             '(' => Tok::LParen,
             ')' => Tok::RParen,
             ']' => Tok::RBrack,
             '{' => Tok::LBrace,
             '}' => Tok::RBrace,
             ',' => Tok::Comma,
             '!' => Tok::Bang,
-            '\'' => Tok::Prime,
+             /* ~ changed by cargo-mutants ~ */
             '_' => Tok::Underscore,
             '#' => Tok::Op(Op::Neq),
             '+' => Tok::Op(Op::Plus),
             '*' => Tok::Op(Op::Times),
             '%' => Tok::Op(Op::Mod),
             '^' => Tok::Op(Op::Pow),
             _ => {
                 return Err(Error::lex(

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (844100) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:37: unexpected character '\''
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (844129) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: lex error at 1:28: unexpected character '\''

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
