*** crates/tla-syntax/src/lexer.rs:27:13: replace && with || in module_start

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace && with || in module_start
@@ -19,17 +19,17 @@
 /// header, notes and shell transcripts below the terminator. That text is not
 /// TLA+ and must not be lexed as it — plenty of it contains `$`, `&` and `/`,
 /// which are not characters the language allows loose.
 fn module_start(src: &str) -> (usize, u32) {
     let mut offset = 0;
     for (index, text) in src.split_inclusive('\n').enumerate() {
         let trimmed = text.trim_start();
         if trimmed.starts_with("----")
-            && trimmed
+            || /* ~ changed by cargo-mutants ~ */ trimmed
                 .trim_start_matches('-')
                 .trim_start()
                 .starts_with("MODULE")
         {
             return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
         }
         offset += text.len();
     }

*** result: Success
