*** crates/tla-syntax/src/lexer.rs:302:59: replace == with != in Lexer::scan_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::scan_number
@@ -294,17 +294,17 @@
         let start = self.pos;
         while self.peek().is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
         }
         // `1aMessage` is a name, not a number followed by one: TLA+ only asks
         // that an identifier contain a letter, not that it begin with one.
         if self
             .peek()
-            .is_some_and(|c| c.is_ascii_alphabetic() || c == '_')
+            .is_some_and(|c| c.is_ascii_alphabetic() || c != /* ~ changed by cargo-mutants ~ */ '_')
         {
             self.pos = start;
             return Ok(self.scan_word());
         }
         let text: String = self.chars[start..self.pos].iter().collect();
         text.parse()
             .map(Tok::Num)
             .map_err(|_| self.err(format!("integer literal out of range: {text}")))

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (854505) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BankTransfer.tla: NoOverdraft did not survive printing as `\A a \in Acct : bal[a] >= 0`
  left: Quant { kind: Forall, bounds: [Bound { names: ["a"], domain: Some(Ident("Acct")), destructure: false }], body: Binary(Ge, FnApply(Ident("bal"), [Ident("a")]), Num(0)) }
 right: Quant { kind: Forall, bounds: [Bound { names: ["a"], domain: Some(Ident("Acct")), destructure: false }], body: Binary(Ge, FnApply(Ident("bal"), [Ident("a")]), Ident("0")) }

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
