*** crates/tla-syntax/src/lexer.rs:308:13: delete match arm Some('b' | 'B') in Lexer::scan_based_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm Some('b' | 'B') in Lexer::scan_based_number
@@ -300,17 +300,17 @@
         Some(Tok::Op(Op::User(symbol)))
     }
 
     /// `\b1011`, `\o777`, `\h1F` — a number written in another base. The
     /// digits must follow the letter directly, which is what keeps `\o` as
     /// concatenation everywhere else.
     fn scan_based_number(&mut self) -> Result<Option<Tok>> {
         let (radix, digits) = match self.at(1) {
-            Some('b' | 'B') => (2u32, "01"),
+             /* ~ changed by cargo-mutants ~ */
             Some('o' | 'O') => (8, "01234567"),
             Some('h' | 'H') => (16, "0123456789abcdefABCDEF"),
             _ => return Ok(None),
         };
         let mut end = self.pos + 2;
         while self.chars.get(end).is_some_and(|c| digits.contains(*c)) {
             end += 1;
         }

---- numbers_may_be_written_in_another_base stdout ----

thread 'numbers_may_be_written_in_another_base' (1331188) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: unknown operator `\b`
in:

failures:
    numbers_may_be_written_in_another_base

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
