*** crates/tla-syntax/src/lexer.rs:310:13: delete match arm Some('h' | 'H') in Lexer::scan_based_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm Some('h' | 'H') in Lexer::scan_based_number
@@ -302,17 +302,17 @@
 
     /// `\b1011`, `\o777`, `\h1F` — a number written in another base. The
     /// digits must follow the letter directly, which is what keeps `\o` as
     /// concatenation everywhere else.
     fn scan_based_number(&mut self) -> Result<Option<Tok>> {
         let (radix, digits) = match self.at(1) {
             Some('b' | 'B') => (2u32, "01"),
             Some('o' | 'O') => (8, "01234567"),
-            Some('h' | 'H') => (16, "0123456789abcdefABCDEF"),
+             /* ~ changed by cargo-mutants ~ */
             _ => return Ok(None),
         };
         let mut end = self.pos + 2;
         while self.chars.get(end).is_some_and(|c| digits.contains(*c)) {
             end += 1;
         }
         if end == self.pos + 2 {
             return Ok(None);

---- numbers_may_be_written_in_another_base stdout ----

thread 'numbers_may_be_written_in_another_base' (1332230) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: unknown operator `\h`
in:

failures:
    numbers_may_be_written_in_another_base

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
