*** crates/tla-syntax/src/lexer.rs:315:17: replace += with -= in Lexer::scan_based_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with -= in Lexer::scan_based_number
@@ -307,17 +307,17 @@
         let (radix, digits) = match self.at(1) {
             Some('b' | 'B') => (2u32, "01"),
             Some('o' | 'O') => (8, "01234567"),
             Some('h' | 'H') => (16, "0123456789abcdefABCDEF"),
             _ => return Ok(None),
         };
         let mut end = self.pos + 2;
         while self.chars.get(end).is_some_and(|c| digits.contains(*c)) {
-            end += 1;
+            end -= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if end == self.pos + 2 {
             return Ok(None);
         }
         let text: String = self.chars[self.pos + 2..end].iter().collect();
         let value = i64::from_str_radix(&text, radix)
             .map_err(|_| self.err(format!("number out of range: {text}")))?;
         self.advance(2 + text.chars().count());

---- numbers_may_be_written_in_another_base stdout ----

thread 'numbers_may_be_written_in_another_base' (1335251) panicked at crates/tla-syntax/src/lexer.rs:320:38:
slice index starts at 26 but ends at 25

failures:
    numbers_may_be_written_in_another_base

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
