*** crates/tla-syntax/src/lexer.rs:320:48: replace + with - in Lexer::scan_based_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace + with - in Lexer::scan_based_number
@@ -312,17 +312,17 @@
         };
         let mut end = self.pos + 2;
         while self.chars.get(end).is_some_and(|c| digits.contains(*c)) {
             end += 1;
         }
         if end == self.pos + 2 {
             return Ok(None);
         }
-        let text: String = self.chars[self.pos + 2..end].iter().collect();
+        let text: String = self.chars[self.pos - /* ~ changed by cargo-mutants ~ */ 2..end].iter().collect();
         let value = i64::from_str_radix(&text, radix)
             .map_err(|_| self.err(format!("number out of range: {text}")))?;
         self.advance(2 + text.chars().count());
         Ok(Some(Tok::Num(value)))
     }
 
     fn scan_number(&mut self) -> Result<Tok> {
         let start = self.pos;

---- numbers_may_be_written_in_another_base stdout ----

thread 'numbers_may_be_written_in_another_base' (1340782) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:6: number out of range: = \b1011
in:

failures:
    numbers_may_be_written_in_another_base

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
