*** crates/tla-syntax/src/lexer.rs:323:24: replace + with * in Lexer::scan_based_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace + with * in Lexer::scan_based_number
@@ -315,17 +315,17 @@
             end += 1;
         }
         if end == self.pos + 2 {
             return Ok(None);
         }
         let text: String = self.chars[self.pos + 2..end].iter().collect();
         let value = i64::from_str_radix(&text, radix)
             .map_err(|_| self.err(format!("number out of range: {text}")))?;
-        self.advance(2 + text.chars().count());
+        self.advance(2 * /* ~ changed by cargo-mutants ~ */ text.chars().count());
         Ok(Some(Tok::Num(value)))
     }
 
     fn scan_number(&mut self) -> Result<Tok> {
         let start = self.pos;
         while self.peek().is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
         }

*** result: Success
