*** crates/tla-syntax/src/lexer.rs:32:70: replace + with * in module_start

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace + with * in module_start
@@ -24,17 +24,17 @@
     for (index, text) in src.split_inclusive('\n').enumerate() {
         let trimmed = text.trim_start();
         if trimmed.starts_with("----")
             && trimmed
                 .trim_start_matches('-')
                 .trim_start()
                 .starts_with("MODULE")
         {
-            return (offset, u32::try_from(index).unwrap_or(u32::MAX) + 1);
+            return (offset, u32::try_from(index).unwrap_or(u32::MAX) * /* ~ changed by cargo-mutants ~ */ 1);
         }
         offset += text.len();
     }
     (0, 1)
 }
 
 impl Lexer {
     fn new(src: &str) -> Self {

---- errors_carry_a_position stdout ----

thread 'errors_carry_a_position' (788033) panicked at crates/tla-syntax/tests/parse_specs.rs:133:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    errors_carry_a_position

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
