*** crates/tla-syntax/src/lexer.rs:342:24: replace == with != in Lexer::scan_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::scan_number
@@ -334,17 +334,17 @@
         if self
             .peek()
             .is_some_and(|c| c.is_ascii_alphabetic() || c == '_')
         {
             self.pos = start;
             return Ok(self.scan_word());
         }
         // `123.456` is one number; `1..2` is a range between two.
-        if self.peek() == Some('.') && self.at(1).is_some_and(|c| c.is_ascii_digit()) {
+        if self.peek() != /* ~ changed by cargo-mutants ~ */ Some('.') && self.at(1).is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
             while self.peek().is_some_and(|c| c.is_ascii_digit()) {
                 self.bump();
             }
             return Ok(Tok::Decimal(self.chars[start..self.pos].iter().collect()));
         }
         let text: String = self.chars[start..self.pos].iter().collect();
         text.parse()

---- a_decimal_is_kept_as_written stdout ----

thread 'a_decimal_is_kept_as_written' (1228454) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:13: expected an identifier, found Num(456000)
in:

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1228466) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Kw(Proof)
in:

failures:
    a_decimal_is_kept_as_written
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
