*** crates/tla-syntax/src/lexer.rs:342:37: replace && with || in Lexer::scan_number

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace && with || in Lexer::scan_number
@@ -334,17 +334,17 @@
         if self
             .peek()
             .is_some_and(|c| c.is_ascii_alphabetic() || c == '_')
         {
             self.pos = start;
             return Ok(self.scan_word());
         }
         // `123.456` is one number; `1..2` is a range between two.
-        if self.peek() == Some('.') && self.at(1).is_some_and(|c| c.is_ascii_digit()) {
+        if self.peek() == Some('.') || /* ~ changed by cargo-mutants ~ */ self.at(1).is_some_and(|c| c.is_ascii_digit()) {
             self.bump();
             while self.peek().is_some_and(|c| c.is_ascii_digit()) {
                 self.bump();
             }
             return Ok(Tok::Decimal(self.chars[start..self.pos].iter().collect()));
         }
         let text: String = self.chars[start..self.pos].iter().collect();
         text.parse()

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1343500) panicked at crates/tla-syntax/tests/golden.rs:38:72:
BoundedBuffer.tla: parse error at 11:21: expected an identifier, found LParen

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1343501) panicked at crates/tla-syntax/tests/golden.rs:78:70:
TV.tla: parse error at 10:29: expected a declaration, found LParen

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
