*** crates/tla-syntax/src/lexer.rs:383:17: delete match arm Some('|') in Lexer::scan_equals

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm Some('|') in Lexer::scan_equals
@@ -375,20 +375,17 @@
                 Some('>') => {
                     self.advance(2);
                     Tok::Op(Op::Implies)
                 }
                 Some('<') => {
                     self.advance(2);
                     Tok::Op(Op::Le)
                 }
-                Some('|') => {
-                    self.advance(2);
-                    Tok::Op(Op::User("=|"))
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {
                     self.bump();
                     Tok::Op(Op::Eq)
                 }
             });
         }
         Err(self.err("`===` is neither a definition nor a module terminator"))
     }

---- every_infix_operator_survives_printing stdout ----

thread 'every_infix_operator_survives_printing' (860405) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `a =| b`: parse error at 1:4: expected an expression, found Op(User("|"))

failures:
    every_infix_operator_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
