*** crates/tla-syntax/src/lexer.rs:455:16: replace == with != in Lexer::scan_dashes

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace == with != in Lexer::scan_dashes
@@ -447,17 +447,17 @@
             self.advance(4);
             return Tok::Op(Op::User("-+->"));
         }
         let run = self.run_of('-');
         if run >= 4 {
             self.advance(run);
             return Tok::Separator;
         }
-        if run == 2 {
+        if run != /* ~ changed by cargo-mutants ~ */ 2 {
             self.advance(2);
             return Tok::Op(Op::User("--"));
         }
         for (text, tok) in [("->", Tok::Arrow), ("-|", Tok::Op(Op::User("-|")))] {
             if self.starts_with(text) {
                 self.advance(2);
                 return tok;
             }

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1344635) panicked at crates/tla-syntax/tests/boundaries.rs:120:5:
assertion failed: defines("-. a == 0 - a", "-")

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1344631) panicked at crates/tla-syntax/tests/boundaries.rs:45:9:
`-. p == p` should define -

failures:
    a_definition_of_any_shape_ends_the_previous_one
    a_prefix_definition_needs_a_name_or_a_hole

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
