*** crates/tla-syntax/src/lexer.rs:478:13: delete match arm "subseteq" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "subseteq" in Lexer::scan_backslash
@@ -470,17 +470,17 @@
         if end == start {
             self.bump();
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,
             "notin" => Op::NotIn,
-            "subseteq" => Op::Subseteq,
+             /* ~ changed by cargo-mutants ~ */
             "supseteq" => Op::Supseteq,
             "cup" | "union" => Op::Cup,
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (867904) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Lex, message: "unknown operator `\\subseteq`", line: 25, col: 11 }

---- module_name_and_extends stdout ----

thread 'module_name_and_extends' (867909) panicked at crates/tla-syntax/tests/parse_specs.rs:39:49:
parses: Error { stage: Lex, message: "unknown operator `\\subseteq`", line: 25, col: 11 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (867910) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Lex, message: "unknown operator `\\subseteq`", line: 16, col: 17 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
