*** crates/tla-syntax/src/lexer.rs:480:13: delete match arm "cup" | "union" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "cup" | "union" in Lexer::scan_backslash
@@ -472,17 +472,17 @@
             return Ok(Tok::Op(Op::SetMinus));
         }
         let name: String = self.chars[start..end].iter().collect();
         let op = match name.as_str() {
             "in" => Op::In,
             "notin" => Op::NotIn,
             "subseteq" => Op::Subseteq,
             "supseteq" => Op::Supseteq,
-            "cup" | "union" => Op::Cup,
+             /* ~ changed by cargo-mutants ~ */
             "cap" | "intersect" => Op::Cap,
             "times" | "X" => Op::Cartesian,
             "div" => Op::Div,
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (868986) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:12: unknown operator `\cup`
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (869001) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `S^+ \cup T`: lex error at 1:5: unknown operator `\cup`

failures:
    a_postfix_operator_binds_to_what_precedes_it
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
