*** crates/tla-syntax/src/lexer.rs:492:13: delete match arm "A" | "forall" in Lexer::scan_backslash

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ delete match arm "A" | "forall" in Lexer::scan_backslash
@@ -484,17 +484,17 @@
             "o" | "circ" => Op::Concat,
             "equiv" => Op::Equiv,
             "lnot" | "neg" => Op::Not,
             "land" => Op::And,
             "lor" => Op::Or,
             "leq" => Op::Le,
             "geq" => Op::Ge,
             "neq" => Op::Neq,
-            "A" | "forall" => Op::Forall,
+             /* ~ changed by cargo-mutants ~ */
             "E" | "exists" => Op::Exists,
             "AA" => Op::TemporalForall,
             "EE" => Op::TemporalExists,
             _ => match token::user_operator(&format!("\\{name}")) {
                 Some(op) => op,
                 None => return Err(self.err(format!("unknown operator `\\{name}`"))),
             },
         };

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (877832) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:13: unknown operator `\A`
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (877845) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: lex error at 1:4: unknown operator `\A`

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
