*** crates/tla-syntax/src/lexer.rs:63:23: replace += with *= in Lexer::bump

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace += with *= in Lexer::bump
@@ -55,17 +55,17 @@
     fn at(&self, offset: usize) -> Option<char> {
         self.chars.get(self.pos + offset).copied()
     }
 
     fn bump(&mut self) -> Option<char> {
         let c = self.chars.get(self.pos).copied()?;
         self.pos += 1;
         if c == '\n' {
-            self.line += 1;
+            self.line *= /* ~ changed by cargo-mutants ~ */ 1;
             self.col = 1;
         } else {
             self.col += 1;
         }
         Some(c)
     }
 
     fn advance(&mut self, n: usize) {

---- errors_carry_a_position stdout ----

thread 'errors_carry_a_position' (798636) panicked at crates/tla-syntax/tests/parse_specs.rs:133:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    errors_carry_a_position

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
