*** crates/tla-syntax/src/lexer.rs:78:9: replace Lexer::starts_with -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/lexer.rs
+++ replace Lexer::starts_with -> bool with false
@@ -70,17 +70,17 @@
 
     fn advance(&mut self, n: usize) {
         for _ in 0..n {
             self.bump();
         }
     }
 
     fn starts_with(&self, s: &str) -> bool {
-        s.chars().enumerate().all(|(i, c)| self.at(i) == Some(c))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn run_of(&self, c: char) -> usize {
         let mut n = 0;
         while self.at(n) == Some(c) {
             n += 1;
         }
         n

---- a_fairness_subscript_may_be_a_tuple stdout ----

thread 'a_fairness_subscript_may_be_a_tuple' (803118) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:9: expected an expression, found Op(Lt)
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (803124) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:10: expected an expression, found Op(Plus)
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (803126) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:11: expected an expression, found RBrack
in:

failures:
    a_fairness_subscript_may_be_a_tuple
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    an_action_subscript_is_recognised_past_an_inner_colon
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    the_new_forms_round_trip

test result: FAILED. 14 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
