*** crates/tla-syntax/src/parser.rs:1090:17: delete match arm Tok::Eof in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Eof in Parser::shape
@@ -1082,17 +1082,17 @@
             match &t.tok {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
-                Tok::Eof => break,
+                 /* ~ changed by cargo-mutants ~ */
                 _ if depth > 0 => {}
                 Tok::Op(Op::In) => saw_in = true,
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }

*** result: Success
