*** crates/tla-syntax/src/parser.rs:1092:17: delete match arm Tok::Op(Op::In) in Parser::shape

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(Op::In) in Parser::shape
@@ -1084,17 +1084,17 @@
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     if depth == 0 {
                         return Shape::Closed;
                     }
                     depth -= 1;
                 }
                 Tok::Eof => break,
                 _ if depth > 0 => {}
-                Tok::Op(Op::In) => saw_in = true,
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::MapsTo => return Shape::MapsTo { bounded: saw_in },
                 Tok::Colon => return Shape::Colon { bounded: saw_in },
                 Tok::Arrow => return Shape::Arrow,
                 Tok::Kw(Kw::Except) => return Shape::Except,
                 _ => {}
             }
         }
         Shape::Closed

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (1004603) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 14:18: expected MapsTo, found Op(In)

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (1004601) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected MapsTo, found Op(In)", line: 28, col: 19 }

---- nested_junctions_nest stdout ----

thread 'nested_junctions_nest' (1004607) panicked at crates/tla-syntax/tests/parse_specs.rs:77:52:
parses: Error { stage: Parse, message: "expected MapsTo, found Op(In)", line: 20, col: 19 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
