*** crates/tla-syntax/src/parser.rs:141:13: replace && with || in Parser::module

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::module
@@ -133,17 +133,17 @@
         self.fences.pop();
         out
     }
 
     // ---------------------------------------------------------------- module
 
     fn module(&mut self) -> Result<Module> {
         while !(matches!(self.peek(), Tok::Separator)
-            && matches!(self.peek_at(1), Tok::Kw(Kw::Module)))
+            || /* ~ changed by cargo-mutants ~ */ matches!(self.peek_at(1), Tok::Kw(Kw::Module)))
         {
             if matches!(self.peek(), Tok::Eof) {
                 return Err(self.err("no `---- MODULE ----` header found"));
             }
             self.advance();
         }
         self.advance();
         self.module_body()

*** result: Success
