*** crates/tla-syntax/src/parser.rs:165:17: delete match arm Tok::Kw(Kw::Module) in Parser::module_body

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Module) in Parser::module_body
@@ -157,21 +157,17 @@
         self.expect(&Tok::Separator)?;
 
         let mut extends = Vec::new();
         let mut units = Vec::new();
         loop {
             while self.eat(&Tok::Separator) {}
             match self.peek() {
                 Tok::ModuleEnd | Tok::Eof => break,
-                Tok::Kw(Kw::Module) => {
-                    let inner = self.module_body()?;
-                    self.expect(&Tok::ModuleEnd)?;
-                    units.push(Unit::Inner(Box::new(inner)));
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Kw(Kw::Extends) => {
                     self.advance();
                     extends.push(self.expect_ident()?);
                     while self.eat(&Tok::Comma) {
                         extends.push(self.expect_ident()?);
                     }
                 }
                 _ => units.push(self.unit()?),

---- a_module_may_contain_another stdout ----

thread 'a_module_may_contain_another' (900866) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:6: expected a declaration, found Kw(Module)
in:

failures:
    a_module_may_contain_another

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
