*** crates/tla-syntax/src/parser.rs:285:28: replace match guard matches!(self.peek_at(1), Tok::DefEq) && kw.text().is_some() with false in Parser::unit_body

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace match guard matches!(self.peek_at(1), Tok::DefEq) && kw.text().is_some() with false in Parser::unit_body
@@ -277,17 +277,17 @@
                     params: vec![operand],
                     body: self.expr(0)?,
                     local,
                 }))
             }
             Tok::Ident(name) => self.named_definition(name, local),
             // A specification may define something spelled like a keyword.
             // SANY reads it and complains afterwards; so do we.
-            Tok::Kw(kw) if matches!(self.peek_at(1), Tok::DefEq) && kw.text().is_some() => {
+            Tok::Kw(kw) if false /* ~ changed by cargo-mutants ~ */ => {
                 let name = kw.text().expect("checked").to_string();
                 self.named_definition(name, local)
             }
             other => Err(self.err(format!("expected a declaration, found {other:?}"))),
         }
     }
 
     /// Everything that can follow a name at the head of a definition: an

---- a_definition_may_be_named_after_a_keyword stdout ----

thread 'a_definition_may_be_named_after_a_keyword' (1348283) panicked at crates/tla-syntax/tests/boundaries.rs:169:55:
TRUE == FALSE: parse error at 2:1: expected a declaration, found Kw(True)

failures:
    a_definition_may_be_named_after_a_keyword

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
