*** crates/tla-syntax/src/parser.rs:325:9: replace Parser::skip_label with ()

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::skip_label with ()
@@ -317,20 +317,17 @@
             body: self.expr(0)?,
             local,
         }))
     }
 
     /// `THEOREM Name == ...` names the theorem; the name carries no meaning
     /// for evaluation, so it is read and dropped.
     fn skip_label(&mut self) {
-        if matches!(self.peek(), Tok::Ident(_)) && matches!(self.peek_at(1), Tok::DefEq) {
-            self.advance();
-            self.advance();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Try something, and rewind rather than fail if it does not work.
     fn recover<T>(&mut self, f: impl FnOnce(&mut Self) -> Result<T>) -> Option<T> {
         let mark = self.pos;
         let fences = self.fences.len();
         let depth = self.depth;
         let Ok(value) = f(self) else {

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (903241) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: expected a declaration, found DefEq
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (903243) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:17: expected a declaration, found DefEq
in:

failures:
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
