*** crates/tla-syntax/src/parser.rs:352:12: delete ! in Parser::skip_proof

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::skip_proof
@@ -344,17 +344,17 @@
     }
 
     /// Skip a TLAPS proof.
     ///
     /// Proofs are checked by a prover, not by an evaluator, so this crate
     /// recognises them in order to get past them. A proof runs until the next
     /// token that can only begin a new module unit.
     fn skip_proof(&mut self) {
-        if !self.at_proof() {
+        if  /* ~ changed by cargo-mutants ~ */self.at_proof() {
             return;
         }
         while !matches!(self.peek(), Tok::Eof | Tok::ModuleEnd | Tok::Separator) {
             if self.at_unit_start() {
                 return;
             }
             self.advance();
         }

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (905516) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an identifier, found Num(1)
in:

failures:
    a_proof_is_skipped_and_the_module_continues

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
