*** crates/tla-syntax/src/parser.rs:383:9: replace Parser::skip_proof with ()

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::skip_proof with ()
@@ -375,29 +375,17 @@
     }
 
     /// Skip a TLAPS proof.
     ///
     /// Proofs are checked by a prover, not by an evaluator, so this crate
     /// recognises them in order to get past them. A proof runs until the next
     /// token that can only begin a new module unit.
     fn skip_proof(&mut self) {
-        if !self.at_proof() {
-            return;
-        }
-        // Always consume the token that began the proof. A proof step can
-        // itself look like the start of a unit -- `<1> DEFINE Op == ...` --
-        // and returning without moving would leave the caller where it was.
-        self.advance();
-        while !matches!(self.peek(), Tok::Eof | Tok::ModuleEnd | Tok::Separator) {
-            if self.at_unit_start() {
-                return;
-            }
-            self.advance();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Advance to whatever comes after something that could not be read.
     fn skip_to_unit(&mut self) {
         self.advance();
         while !matches!(self.peek(), Tok::Eof | Tok::ModuleEnd | Tok::Separator) {
             if self.at_unit_start() {
                 return;

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1235453) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: cannot make sense of Op(Lt), and cannot get past it
in:

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1235454) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: cannot make sense of Op(Lt), and cannot get past it
in:

failures:
    a_proof_is_skipped_and_the_module_continues
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
