*** crates/tla-syntax/src/parser.rs:416:9: replace Parser::at_proof -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_proof -> bool with true
@@ -408,25 +408,17 @@
 
     /// Would a new unit begin `ahead` tokens from here? Used to tell an
     /// operator substitution from the start of an expression.
     fn at_unit_start_after(&self, ahead: usize) -> bool {
         self.toks.get(self.pos + ahead).is_some_and(|t| t.col == 1)
     }
 
     fn at_proof(&self) -> bool {
-        if matches!(self.peek(), Tok::Kw(Kw::Proof)) {
-            return true;
-        }
-        // A proof step is written `<1>2.`, which reaches us as `<`, a number
-        // or name, then `>`. It always begins a line; without that, the `<`
-        // and `>` of an ordinary comparison would look the same.
-        self.begins_line()
-            && matches!(self.peek(), Tok::Op(Op::Lt))
-            && matches!(self.peek_at(2), Tok::Op(Op::Gt))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn begins_line(&self) -> bool {
         self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.

---- a_bracketed_left_hand_side_is_found_past_its_brackets stdout ----

thread 'a_bracketed_left_hand_side_is_found_past_its_brackets' (1355969) panicked at crates/tla-syntax/tests/boundaries.rs:19:28:
X is gone
in:

---- a_declaration_ends_the_definition_before_it stdout ----

thread 'a_declaration_ends_the_definition_before_it' (1355970) panicked at crates/tla-syntax/tests/boundaries.rs:19:28:
X is gone
in:

---- a_definition_may_be_named_after_a_keyword stdout ----

thread 'a_definition_may_be_named_after_a_keyword' (1355972) panicked at crates/tla-syntax/tests/boundaries.rs:170:9:
TRUE == FALSE defines TRUE

failures:
    a_bracketed_left_hand_side_is_found_past_its_brackets
    a_declaration_ends_the_definition_before_it
    a_definition_is_written_with_operands_not_holes
    a_definition_may_be_named_after_a_keyword
    a_definition_of_any_shape_ends_the_previous_one
    a_later_definitions_equals_does_not_end_this_one
    a_prefix_definition_needs_a_name_or_a_hole
    a_substitution_may_be_an_operator_or_an_expression
    an_expression_wrapped_into_the_first_column_carries_on
    an_operator_may_be_the_last_argument

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
