*** crates/tla-syntax/src/parser.rs:416:9: replace Parser::at_proof -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_proof -> bool with false
@@ -408,25 +408,17 @@
 
     /// Would a new unit begin `ahead` tokens from here? Used to tell an
     /// operator substitution from the start of an expression.
     fn at_unit_start_after(&self, ahead: usize) -> bool {
         self.toks.get(self.pos + ahead).is_some_and(|t| t.col == 1)
     }
 
     fn at_proof(&self) -> bool {
-        if matches!(self.peek(), Tok::Kw(Kw::Proof)) {
-            return true;
-        }
-        // A proof step is written `<1>2.`, which reaches us as `<`, a number
-        // or name, then `>`. It always begins a line; without that, the `<`
-        // and `>` of an ordinary comparison would look the same.
-        self.begins_line()
-            && matches!(self.peek(), Tok::Op(Op::Lt))
-            && matches!(self.peek_at(2), Tok::Op(Op::Gt))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn begins_line(&self) -> bool {
         self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1356888) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: cannot make sense of Kw(Proof), and cannot get past it
in:

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1356889) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Kw(Proof)
in:

failures:
    a_proof_is_skipped_and_the_module_continues
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
