*** crates/tla-syntax/src/parser.rs:424:13: replace && with || in Parser::at_proof

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::at_proof
@@ -416,17 +416,17 @@
         if matches!(self.peek(), Tok::Kw(Kw::Proof)) {
             return true;
         }
         // A proof step is written `<1>2.`, which reaches us as `<`, a number
         // or name, then `>`. It always begins a line; without that, the `<`
         // and `>` of an ordinary comparison would look the same.
         self.begins_line()
             && matches!(self.peek(), Tok::Op(Op::Lt))
-            && matches!(self.peek_at(2), Tok::Op(Op::Gt))
+            || /* ~ changed by cargo-mutants ~ */ matches!(self.peek_at(2), Tok::Op(Op::Gt))
     }
 
     fn begins_line(&self) -> bool {
         self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1357884) panicked at crates/tla-syntax/tests/golden.rs:81:9:
assertion `left == right` failed: RaftElection.tla is not stable under printing

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1357883) panicked at crates/tla-syntax/tests/golden.rs:52:5:
the golden form has changed:
  RaftElection.tla
    line 11
    - BecomeLeader(c) == role[c] = "candidate" /\ Cardinality(votesGranted[c]) * 2 > Cardinality(Server) /\ role' = [role EXCEPT ![c] = "leader"] /\ (UNCHANGED <<currentTerm, votedFor, votesGranted>>)
    + BecomeLeader(c) == role[c] = "candidate" /\ Cardinality(votesGranted[c])
Run `UPDATE_GOLDEN=1 cargo test -p tla-syntax --test golden` once the change is intended.

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
