*** crates/tla-syntax/src/parser.rs:428:55: replace < with > in Parser::begins_line

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace < with > in Parser::begins_line
@@ -420,17 +420,17 @@
         // or name, then `>`. It always begins a line; without that, the `<`
         // and `>` of an ordinary comparison would look the same.
         self.begins_line()
             && matches!(self.peek(), Tok::Op(Op::Lt))
             && matches!(self.peek_at(2), Tok::Op(Op::Gt))
     }
 
     fn begins_line(&self) -> bool {
-        self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
+        self.pos == 0 || self.toks[self.pos - 1].line > /* ~ changed by cargo-mutants ~ */ self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
         if self.col() != 1 {
             return false;
         }

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1248470) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 4:1: expected DefEq, found Kw(Proof)
in:

failures:
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 32 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
