*** crates/tla-syntax/src/parser.rs:433:9: replace Parser::opt_params -> Result<Vec<Param>> with Ok(vec![])

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::opt_params -> Result<Vec<Param>> with Ok(vec![])
@@ -425,27 +425,17 @@
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Decl { name, arity })
     }
 
     fn opt_params(&mut self) -> Result<Vec<Param>> {
-        let mut params = Vec::new();
-        if self.eat(&Tok::LParen) {
-            loop {
-                params.push(self.param()?);
-                if !self.eat(&Tok::Comma) {
-                    break;
-                }
-            }
-            self.expect(&Tok::RParen)?;
-        }
-        Ok(params)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// A formal parameter: a name, or `f(_, _)` for one that is itself an
     /// operator and so has to be applied rather than used as a value.
     fn param(&mut self) -> Result<Param> {
         let name = self.expect_ident()?;
         let mut arity = 0;
         if self.eat(&Tok::LParen) {

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (918891) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:4: expected DefEq, found LParen
in:

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (918901) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:5: expected DefEq, found LParen
in:

failures:
    an_operator_may_be_passed_as_an_argument
    higher_order_parameters_record_their_arity

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
