*** crates/tla-syntax/src/parser.rs:434:9: replace Parser::at_unit_start -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_unit_start -> bool with true
@@ -426,33 +426,17 @@
 
     fn begins_line(&self) -> bool {
         self.pos == 0 || self.toks[self.pos - 1].line < self.toks[self.pos].line
     }
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
-        if self.col() != 1 {
-            return false;
-        }
-        match self.peek() {
-            Tok::Kw(
-                Kw::Variable
-                | Kw::Constant
-                | Kw::Assume
-                | Kw::Theorem
-                | Kw::Local
-                | Kw::Instance
-                | Kw::Recursive
-                | Kw::Extends,
-            ) => true,
-            Tok::Ident(_) | Tok::Op(_) => self.at_definition(),
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,
     /// and the next definition's `==` is only a few tokens away.
     fn at_definition(&self) -> bool {

---- a_bracketed_left_hand_side_is_found_past_its_brackets stdout ----

thread 'a_bracketed_left_hand_side_is_found_past_its_brackets' (1368857) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 3:1: expected a declaration, found LParen
in:

---- a_let_instance_keeps_its_substitutions stdout ----

thread 'a_let_instance_keeps_its_substitutions' (1368863) panicked at crates/tla-syntax/tests/boundaries.rs:199:69:
parses: Error { stage: Parse, message: "unexpected Bang after the expression", line: 1, col: 37 }

---- a_later_definitions_equals_does_not_end_this_one stdout ----

thread 'a_later_definitions_equals_does_not_end_this_one' (1368862) panicked at crates/tla-syntax/tests/boundaries.rs:75:31:
parses: Error { stage: Parse, message: "expected DefEq, found Op(Or)", line: 4, col: 1 }

failures:
    a_bracketed_left_hand_side_is_found_past_its_brackets
    a_later_definitions_equals_does_not_end_this_one
    a_let_instance_keeps_its_substitutions
    a_let_instance_survives_printing
    a_prefix_definition_needs_a_name_or_a_hole
    a_substitution_may_be_an_operator_or_an_expression
    an_expression_wrapped_into_the_first_column_carries_on
    an_operator_may_be_the_last_argument

test result: FAILED. 4 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
