*** crates/tla-syntax/src/parser.rs:437:20: delete ! in Parser::opt_params

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::opt_params
@@ -429,17 +429,17 @@
         Ok(Decl { name, arity })
     }
 
     fn opt_params(&mut self) -> Result<Vec<Param>> {
         let mut params = Vec::new();
         if self.eat(&Tok::LParen) {
             loop {
                 params.push(self.param()?);
-                if !self.eat(&Tok::Comma) {
+                if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                     break;
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(params)
     }

---- an_operator_may_be_passed_as_an_argument stdout ----

thread 'an_operator_may_be_passed_as_an_argument' (919736) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:6: expected an identifier, found RParen
in:

---- higher_order_parameters_record_their_arity stdout ----

thread 'higher_order_parameters_record_their_arity' (919740) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:16: expected RParen, found Ident("base")
in:

failures:
    an_operator_may_be_passed_as_an_argument
    higher_order_parameters_record_their_arity

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
