*** crates/tla-syntax/src/parser.rs:438:13: delete match arm Tok::Kw(Kw::Variable | Kw::Constant | Kw::Assume | Kw::Theorem | Kw::Local | Kw::Instance | Kw::Recursive | Kw::Extends,) in Parser::at_unit_start

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Variable | Kw::Constant | Kw::Assume | Kw::Theorem | Kw::Local | Kw::Instance | Kw::Recursive | Kw::Extends,) in Parser::at_unit_start
@@ -430,26 +430,17 @@
 
     /// Does a new module unit begin here? Only tokens in the first column can,
     /// which is what keeps a proof's own keywords from ending it early.
     fn at_unit_start(&self) -> bool {
         if self.col() != 1 {
             return false;
         }
         match self.peek() {
-            Tok::Kw(
-                Kw::Variable
-                | Kw::Constant
-                | Kw::Assume
-                | Kw::Theorem
-                | Kw::Local
-                | Kw::Instance
-                | Kw::Recursive
-                | Kw::Extends,
-            ) => true,
+             /* ~ changed by cargo-mutants ~ */
             Tok::Ident(_) | Tok::Op(_) | Tok::Underscore => self.at_definition(),
             _ => false,
         }
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further

*** result: Success
