*** crates/tla-syntax/src/parser.rs:448:13: delete match arm Tok::Ident(_) | Tok::Op(_) in Parser::at_unit_start

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Ident(_) | Tok::Op(_) in Parser::at_unit_start
@@ -440,17 +440,17 @@
                 | Kw::Constant
                 | Kw::Assume
                 | Kw::Theorem
                 | Kw::Local
                 | Kw::Instance
                 | Kw::Recursive
                 | Kw::Extends,
             ) => true,
-            Tok::Ident(_) | Tok::Op(_) => self.at_definition(),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         }
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1371598) panicked at crates/tla-syntax/tests/boundaries.rs:120:5:
assertion failed: defines("-. a == 0 - a", "-")

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1371594) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 3:2: expected an expression, found Dot
in:

failures:
    a_definition_of_any_shape_ends_the_previous_one
    a_prefix_definition_needs_a_name_or_a_hole

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
