*** crates/tla-syntax/src/parser.rs:448:13: delete match arm Tok::Ident(_) | Tok::Op(_) | Tok::Underscore in Parser::at_unit_start

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Ident(_) | Tok::Op(_) | Tok::Underscore in Parser::at_unit_start
@@ -440,17 +440,17 @@
                 | Kw::Constant
                 | Kw::Assume
                 | Kw::Theorem
                 | Kw::Local
                 | Kw::Instance
                 | Kw::Recursive
                 | Kw::Extends,
             ) => true,
-            Tok::Ident(_) | Tok::Op(_) | Tok::Underscore => self.at_definition(),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         }
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1254144) panicked at crates/tla-syntax/tests/grammar.rs:207:5:
the definition after the proof is still read

---- a_prefix_operator_definition_still_starts_a_unit stdout ----

thread 'a_prefix_operator_definition_still_starts_a_unit' (1254143) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:2: expected an expression, found Dot
in:

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1254145) panicked at crates/tla-syntax/tests/grammar.rs:381:5:
the proof was skipped

failures:
    a_prefix_operator_definition_still_starts_a_unit
    a_proof_is_skipped_and_the_module_continues
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 30 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
