*** crates/tla-syntax/src/parser.rs:459:9: replace Parser::at_definition -> bool with true

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_definition -> bool with true
@@ -451,34 +451,17 @@
     }
 
     /// Does a definition's left-hand side start here?
     ///
     /// Matching the shape matters rather than merely finding a `==` further
     /// on: a generated specification wraps expressions into the first column,
     /// and the next definition's `==` is only a few tokens away.
     fn at_definition(&self) -> bool {
-        let defeq = |offset: usize| matches!(self.peek_at(offset), Tok::DefEq);
-        match self.peek() {
-            // `Name ==`, `Name(..) ==`, `Name[..] ==`, `a + b ==`, `b ^+ ==`
-            Tok::Ident(_) => {
-                defeq(1)
-                    || match self.peek_at(1) {
-                        Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
-                        Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
-                        _ => false,
-                    }
-            }
-            // `-. a ==`, `- a ==`, `-. _ ==`
-            Tok::Op(_) => {
-                let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
-                self.is_name(after) && defeq(after + 1)
-            }
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_name(&self, offset: usize) -> bool {
         matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {

---- a_later_definitions_equals_does_not_end_this_one stdout ----

thread 'a_later_definitions_equals_does_not_end_this_one' (1371611) panicked at crates/tla-syntax/tests/boundaries.rs:75:31:
parses: Error { stage: Parse, message: "expected DefEq, found Op(Or)", line: 4, col: 1 }

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1371614) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 4:1: expected DefEq, found ModuleEnd
in:

---- an_expression_wrapped_into_the_first_column_carries_on stdout ----

thread 'an_expression_wrapped_into_the_first_column_carries_on' (1371616) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 4:1: expected DefEq, found ModuleEnd
in:

failures:
    a_later_definitions_equals_does_not_end_this_one
    a_prefix_definition_needs_a_name_or_a_hole
    an_expression_wrapped_into_the_first_column_carries_on

test result: FAILED. 9 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
