*** crates/tla-syntax/src/parser.rs:464:21: replace || with && in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::at_definition
@@ -456,17 +456,17 @@
     /// on: a generated specification wraps expressions into the first column,
     /// and the next definition's `==` is only a few tokens away.
     fn at_definition(&self) -> bool {
         let defeq = |offset: usize| matches!(self.peek_at(offset), Tok::DefEq);
         match self.peek() {
             // `Name ==`, `Name(..) ==`, `Name[..] ==`, `a + b ==`, `b ^+ ==`
             Tok::Ident(_) => {
                 defeq(1)
-                    || match self.peek_at(1) {
+                    && /* ~ changed by cargo-mutants ~ */ match self.peek_at(1) {
                         Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
                         Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
                         _ => false,
                     }
             }
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
                 let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1375235) panicked at crates/tla-syntax/tests/grammar.rs:207:5:
the definition after the proof is still read

---- a_proof_step_does_not_look_like_a_comparison stdout ----

thread 'a_proof_step_does_not_look_like_a_comparison' (1375236) panicked at crates/tla-syntax/tests/grammar.rs:381:5:
the proof was skipped

failures:
    a_proof_is_skipped_and_the_module_continues
    a_proof_step_does_not_look_like_a_comparison

test result: FAILED. 31 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
