*** crates/tla-syntax/src/parser.rs:466:25: delete match arm Tok::Op(_) in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Op(_) in Parser::at_definition
@@ -458,17 +458,17 @@
     fn at_definition(&self) -> bool {
         let defeq = |offset: usize| matches!(self.peek_at(offset), Tok::DefEq);
         match self.peek() {
             // `Name ==`, `Name(..) ==`, `Name[..] ==`, `a + b ==`, `b ^+ ==`
             Tok::Ident(_) => {
                 defeq(1)
                     || match self.peek_at(1) {
                         Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
-                        Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
+                         /* ~ changed by cargo-mutants ~ */
                         _ => false,
                     }
             }
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
                 let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
                 self.is_name(after) && defeq(after + 1)
             }

*** result: Success
