*** crates/tla-syntax/src/parser.rs:473:52: replace + with * in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with * in Parser::at_definition
@@ -465,17 +465,17 @@
                         Tok::LParen | Tok::LBrack => defeq(self.past_brackets(1)),
                         Tok::Op(_) => defeq(2) || (self.is_name(2) && defeq(3)),
                         _ => false,
                     }
             }
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
                 let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
-                self.is_name(after) && defeq(after + 1)
+                self.is_name(after) && defeq(after * /* ~ changed by cargo-mutants ~ */ 1)
             }
             _ => false,
         }
     }
 
     fn is_name(&self, offset: usize) -> bool {
         matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
     }

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1383934) panicked at crates/tla-syntax/tests/boundaries.rs:120:5:
assertion failed: defines("-. a == 0 - a", "-")

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1383926) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 3:2: expected an expression, found Dot
in:

failures:
    a_definition_of_any_shape_ends_the_previous_one
    a_prefix_definition_needs_a_name_or_a_hole

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
