*** crates/tla-syntax/src/parser.rs:475:20: delete ! in Parser::instance_tail

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::instance_tail
@@ -467,17 +467,17 @@
         self.expect(&Tok::Kw(Kw::Instance))?;
         let module = self.expect_ident()?;
         let mut subs = Vec::new();
         if self.eat(&Tok::Kw(Kw::With)) {
             loop {
                 let name = self.expect_ident()?;
                 self.expect(&Tok::Gets)?;
                 subs.push((name, self.expr(0)?));
-                if !self.eat(&Tok::Comma) {
+                if  /* ~ changed by cargo-mutants ~ */self.eat(&Tok::Comma) {
                     break;
                 }
             }
         }
         Ok((module, subs))
     }
 
     // ------------------------------------------------------------ expression

---- always_binds_tighter_than_conjunction stdout ----

thread 'always_binds_tighter_than_conjunction' (925469) panicked at crates/tla-syntax/tests/parse_specs.rs:91:46:
parses: Error { stage: Parse, message: "expected Gets, found DefEq", line: 8, col: 8 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (925473) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected Gets, found DefEq", line: 8, col: 8 }

---- qualified_names_resolve_through_the_instance stdout ----

thread 'qualified_names_resolve_through_the_instance' (925479) panicked at crates/tla-syntax/tests/parse_specs.rs:115:46:
parses: Error { stage: Parse, message: "expected Gets, found DefEq", line: 8, col: 8 }

failures:
    always_binds_tighter_than_conjunction
    every_fixture_parses
    instance_substitutions_are_recorded
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
