*** crates/tla-syntax/src/parser.rs:478:21: replace && with || in Parser::at_definition

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace && with || in Parser::at_definition
@@ -470,17 +470,17 @@
             // `-. a ==`, `- a ==`, `-. _ ==`
             Tok::Op(_) => {
                 let after = usize::from(matches!(self.peek_at(1), Tok::Dot)) + 1;
                 self.is_name(after) && defeq(after + 1)
             }
             // `_ + _ ==`, `_ ^# ==`
             Tok::Underscore => {
                 matches!(self.peek_at(1), Tok::Op(_))
-                    && (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
+                    || /* ~ changed by cargo-mutants ~ */ (defeq(2) || (matches!(self.peek_at(2), Tok::Underscore) && defeq(3)))
             }
             _ => false,
         }
     }
 
     fn is_name(&self, offset: usize) -> bool {
         matches!(self.peek_at(offset), Tok::Ident(_) | Tok::Underscore)
     }

*** result: Success
