*** crates/tla-syntax/src/parser.rs:489:78: replace += with -= in Parser::past_brackets

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::past_brackets
@@ -481,17 +481,17 @@
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {
         let mut depth = 0usize;
         let mut at = offset;
         loop {
             match self.peek_at(at) {
-                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
+                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth -= /* ~ changed by cargo-mutants ~ */ 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     depth -= 1;
                     if depth == 0 {
                         return at + 1;
                     }
                 }
                 Tok::Eof => return at,
                 _ => {}

---- a_bracketed_left_hand_side_is_found_past_its_brackets stdout ----

thread 'a_bracketed_left_hand_side_is_found_past_its_brackets' (1391145) panicked at crates/tla-syntax/src/parser.rs:489:72:
attempt to subtract with overflow

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1391149) panicked at crates/tla-syntax/src/parser.rs:489:72:
attempt to subtract with overflow

failures:
    a_bracketed_left_hand_side_is_found_past_its_brackets
    a_definition_of_any_shape_ends_the_previous_one

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
