*** crates/tla-syntax/src/parser.rs:494:78: replace += with *= in Parser::past_brackets

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with *= in Parser::past_brackets
@@ -486,17 +486,17 @@
     }
 
     /// The offset just past the bracket group that begins at `offset`.
     fn past_brackets(&self, offset: usize) -> usize {
         let mut depth = 0usize;
         let mut at = offset;
         loop {
             match self.peek_at(at) {
-                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
+                Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth *= /* ~ changed by cargo-mutants ~ */ 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     depth -= 1;
                     if depth == 0 {
                         return at + 1;
                     }
                 }
                 Tok::Eof => return at,
                 _ => {}

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1277801) panicked at crates/tla-syntax/src/parser.rs:496:21:
attempt to subtract with overflow

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1277802) panicked at crates/tla-syntax/src/parser.rs:496:21:
attempt to subtract with overflow

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
