*** crates/tla-syntax/src/parser.rs:496:17: delete match arm Tok::Eof in Parser::past_brackets

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Eof in Parser::past_brackets
@@ -488,17 +488,17 @@
             match self.peek_at(at) {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     depth -= 1;
                     if depth == 0 {
                         return at + 1;
                     }
                 }
-                Tok::Eof => return at,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
             at += 1;
         }
     }
 
     fn decl_list(&mut self) -> Result<Vec<Decl>> {
         let mut out = vec![self.decl()?];

*** result: Timeout
