*** crates/tla-syntax/src/parser.rs:498:35: replace + with - in Parser::past_brackets

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace + with - in Parser::past_brackets
@@ -490,17 +490,17 @@
         let mut depth = 0usize;
         let mut at = offset;
         loop {
             match self.peek_at(at) {
                 Tok::LParen | Tok::LBrack | Tok::LBrace | Tok::LTup => depth += 1,
                 Tok::RParen | Tok::RBrack | Tok::RBrace | Tok::RTup => {
                     depth -= 1;
                     if depth == 0 {
-                        return at + 1;
+                        return at - /* ~ changed by cargo-mutants ~ */ 1;
                     }
                 }
                 Tok::Eof => return at,
                 _ => {}
             }
             at += 1;
         }
     }

*** result: Success
