*** crates/tla-syntax/src/parser.rs:499:16: replace += with -= in Parser::past_brackets

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace += with -= in Parser::past_brackets
@@ -491,17 +491,17 @@
                     depth -= 1;
                     if depth == 0 {
                         return at + 1;
                     }
                 }
                 Tok::Eof => return at,
                 _ => {}
             }
-            at += 1;
+            at -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
 
     fn decl_list(&mut self) -> Result<Vec<Decl>> {
         let mut out = vec![self.decl()?];
         while self.eat(&Tok::Comma) {
             out.push(self.decl()?);
         }

---- a_bracketed_left_hand_side_is_found_past_its_brackets stdout ----

thread 'a_bracketed_left_hand_side_is_found_past_its_brackets' (1397823) panicked at crates/tla-syntax/src/parser.rs:499:13:
attempt to subtract with overflow

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1397827) panicked at crates/tla-syntax/src/parser.rs:499:13:
attempt to subtract with overflow

failures:
    a_bracketed_left_hand_side_is_found_past_its_brackets
    a_definition_of_any_shape_ends_the_previous_one

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
