*** crates/tla-syntax/src/parser.rs:513:21: replace < with > in Parser::expr_inner

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace < with > in Parser::expr_inner
@@ -505,17 +505,17 @@
             _ => self.prefix()?,
         };
         loop {
             if self.fenced() {
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };
-            if prec < min_prec {
+            if prec > /* ~ changed by cargo-mutants ~ */ min_prec {
                 break;
             }
             self.advance();
             let next_min = if op.is_right_assoc() { prec } else { prec + 1 };
             let rhs = self.expr(next_min)?;
             lhs = Expr::Binary(op, Box::new(lhs), Box::new(rhs));
         }
         Ok(lhs)

---- a_function_may_be_defined_by_its_graph stdout ----

thread 'a_function_may_be_defined_by_its_graph' (931556) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:19: expected an identifier, found Num(1)
in:

---- a_postfix_operator_binds_to_what_precedes_it stdout ----

thread 'a_postfix_operator_binds_to_what_precedes_it' (931566) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- a_lambda_may_be_passed_where_an_operator_is_wanted stdout ----

thread 'a_lambda_may_be_passed_where_an_operator_is_wanted' (931558) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:30: expected RParen, found Op(Plus)
in:

failures:
    a_function_may_be_defined_by_its_graph
    a_lambda_may_be_passed_where_an_operator_is_wanted
    a_named_theorem_keeps_its_statement
    a_postfix_operator_binds_to_what_precedes_it
    a_proof_is_skipped_and_the_module_continues
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    an_operator_may_follow_a_bulleted_list
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    prefix_and_postfix_operators_can_be_defined
    set_filters_and_set_maps_are_told_apart

test result: FAILED. 10 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
