*** crates/tla-syntax/src/parser.rs:549:21: delete match arm Op::Forall in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Op::Forall in Parser::prefix
@@ -541,17 +541,17 @@
     fn prefix(&mut self) -> Result<Expr> {
         if let Some(labelled) = self.skip_expression_label() {
             return labelled;
         }
         let op = match *self.peek() {
             Tok::Op(o @ (Op::Forall | Op::Exists | Op::TemporalForall | Op::TemporalExists)) => {
                 self.advance();
                 let kind = match o {
-                    Op::Forall => QuantKind::Forall,
+                     /* ~ changed by cargo-mutants ~ */
                     Op::Exists => QuantKind::Exists,
                     Op::TemporalForall => QuantKind::TemporalForall,
                     _ => QuantKind::TemporalExists,
                 };
                 let bounds = self.bounds(&Tok::Colon)?;
                 self.expect(&Tok::Colon)?;
                 let body = self.expr(0)?;
                 return Ok(Expr::Quant {

---- parentheses_are_restored_exactly_where_they_are_needed stdout ----

thread 'parentheses_are_restored_exactly_where_they_are_needed' (942201) panicked at crates/tla-syntax/tests/printing.rs:178:5:
assertion `left == right` failed
  left: "(\\EE x \\in S : P) /\\ Q"
 right: "(\\A x \\in S : P) /\\ Q"

failures:
    parentheses_are_restored_exactly_where_they_are_needed

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
