*** crates/tla-syntax/src/parser.rs:568:13: delete match arm Tok::Kw(Kw::Unchanged) in Parser::prefix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Unchanged) in Parser::prefix
@@ -560,17 +560,17 @@
                     body: Box::new(body),
                 });
             }
             Tok::Op(o @ (Op::Not | Op::Always | Op::Eventually | Op::Minus)) => o,
             Tok::Kw(Kw::Domain) => Op::Domain,
             Tok::Kw(Kw::Subset) => Op::Subset,
             Tok::Kw(Kw::Union) => Op::BigUnion,
             Tok::Kw(Kw::Enabled) => Op::Enabled,
-            Tok::Kw(Kw::Unchanged) => Op::Unchanged,
+             /* ~ changed by cargo-mutants ~ */
             _ => return self.postfix(),
         };
         self.advance();
         // Every prefix operator here binds tighter than `/\`, so `[][A]_v /\ B`
         // is a conjunction of two formulas rather than `[]` over both.
         let operand_prec = match op {
             Op::Minus => 11,
             Op::Domain | Op::Subset | Op::BigUnion => 9,

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (942186) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected an expression, found Kw(Unchanged)", line: 37, col: 6 }

---- instance_substitutions_are_recorded stdout ----

thread 'instance_substitutions_are_recorded' (942189) panicked at crates/tla-syntax/tests/parse_specs.rs:98:46:
parses: Error { stage: Parse, message: "expected an expression, found Kw(Unchanged)", line: 30, col: 17 }

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (942188) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BoundedBuffer.tla: parse error at 24:6: expected an expression, found Kw(Unchanged)

failures:
    always_binds_tighter_than_conjunction
    declarations_are_collected
    every_fixture_parses
    instance_substitutions_are_recorded
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser
    qualified_names_resolve_through_the_instance

test result: FAILED. 2 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
