*** crates/tla-syntax/src/parser.rs:605:9: replace Parser::instance_tail -> Result<(String, Vec<(String, Expr)>)> with Ok((String::new(), vec![]))

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::instance_tail -> Result<(String, Vec<(String, Expr)>)> with Ok((String::new(), vec![]))
@@ -597,40 +597,17 @@
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Param { name, arity })
     }
 
     fn instance_tail(&mut self) -> Result<(String, Vec<(String, Expr)>)> {
-        self.expect(&Tok::Kw(Kw::Instance))?;
-        let module = self.expect_ident()?;
-        let mut subs = Vec::new();
-        if self.eat(&Tok::Kw(Kw::With)) {
-            loop {
-                let name = self.expect_ident()?;
-                self.expect(&Tok::Gets)?;
-                let replacement = if matches!(self.peek_at(1), Tok::Comma | Tok::Eof)
-                    || self.at_unit_start_after(1)
-                {
-                    self.operator_by_symbol()
-                } else {
-                    None
-                };
-                match replacement {
-                    Some(operator) => subs.push((name, operator)),
-                    None => subs.push((name, self.expr(0)?)),
-                }
-                if !self.eat(&Tok::Comma) {
-                    break;
-                }
-            }
-        }
-        Ok((module, subs))
+        Ok((String::new(), vec![])) /* ~ changed by cargo-mutants ~ */
     }
 
     // ------------------------------------------------------------ expression
 
     fn expr(&mut self, min_prec: u8) -> Result<Expr> {
         if self.depth >= self.nesting_limit {
             let limit = self.nesting_limit;
             return Err(self.err(format!("expressions nest more than {limit} deep")));

*** result: Timeout
