*** crates/tla-syntax/src/parser.rs:610:9: replace Parser::instance_tail -> Result<(String, Vec<(String, Expr)>)> with Ok(("xyzzy".into(), vec![]))

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::instance_tail -> Result<(String, Vec<(String, Expr)>)> with Ok(("xyzzy".into(), vec![]))
@@ -602,40 +602,17 @@
                 }
             }
             self.expect(&Tok::RParen)?;
         }
         Ok(Param { name, arity })
     }
 
     fn instance_tail(&mut self) -> Result<(String, Vec<(String, Expr)>)> {
-        self.expect(&Tok::Kw(Kw::Instance))?;
-        let module = self.expect_ident()?;
-        let mut subs = Vec::new();
-        if self.eat(&Tok::Kw(Kw::With)) {
-            loop {
-                let name = self.expect_ident()?;
-                self.expect(&Tok::Gets)?;
-                let replacement = if matches!(self.peek_at(1), Tok::Comma | Tok::Eof)
-                    || self.at_unit_start_after(1)
-                {
-                    self.operator_by_symbol()
-                } else {
-                    None
-                };
-                match replacement {
-                    Some(operator) => subs.push((name, operator)),
-                    None => subs.push((name, self.expr(0)?)),
-                }
-                if !self.eat(&Tok::Comma) {
-                    break;
-                }
-            }
-        }
-        Ok((module, subs))
+        Ok(("xyzzy".into(), vec![])) /* ~ changed by cargo-mutants ~ */
     }
 
     // ------------------------------------------------------------ expression
 
     fn expr(&mut self, min_prec: u8) -> Result<Expr> {
         if self.depth >= self.nesting_limit {
             let limit = self.nesting_limit;
             return Err(self.err(format!("expressions nest more than {limit} deep")));

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1285837) panicked at crates/tla-syntax/tests/golden.rs:78:70:
TV.tla: parse error at 4:6: cannot make sense of Kw(Instance), and cannot get past it

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1285836) panicked at crates/tla-syntax/tests/golden.rs:38:72:
TV.tla: parse error at 6:6: cannot make sense of Kw(Instance), and cannot get past it

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
