*** crates/tla-syntax/src/parser.rs:613:21: replace || with && in Parser::instance_tail

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::instance_tail
@@ -605,17 +605,17 @@
         self.expect(&Tok::Kw(Kw::Instance))?;
         let module = self.expect_ident()?;
         let mut subs = Vec::new();
         if self.eat(&Tok::Kw(Kw::With)) {
             loop {
                 let name = self.expect_ident()?;
                 self.expect(&Tok::Gets)?;
                 let replacement = if matches!(self.peek_at(1), Tok::Comma | Tok::Eof)
-                    || self.at_unit_start_after(1)
+                    && /* ~ changed by cargo-mutants ~ */ self.at_unit_start_after(1)
                 {
                     self.operator_by_symbol()
                 } else {
                     None
                 };
                 match replacement {
                     Some(operator) => subs.push((name, operator)),
                     None => subs.push((name, self.expr(0)?)),

---- a_substitution_may_be_an_operator_or_an_expression stdout ----

thread 'a_substitution_may_be_an_operator_or_an_expression' (1402843) panicked at crates/tla-syntax/tests/boundaries.rs:134:6:
parses: Error { stage: Parse, message: "expected an expression, found Prime", line: 2, col: 27 }

failures:
    a_substitution_may_be_an_operator_or_an_expression

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
