*** crates/tla-syntax/src/parser.rs:624:17: delete match arm Tok::Prime in Parser::postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Prime in Parser::postfix
@@ -616,20 +616,17 @@
 
     fn postfix(&mut self) -> Result<Expr> {
         let mut e = self.primary()?;
         loop {
             if self.fenced() {
                 break;
             }
             match self.peek() {
-                Tok::Prime => {
-                    self.advance();
-                    e = Expr::Prime(Box::new(e));
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 Tok::Op(op) if op.is_postfix() => {
                     let op = *op;
                     self.advance();
                     e = Expr::Unary(op, Box::new(e));
                 }
                 Tok::Dot => {
                     self.advance();
                     e = Expr::Field(Box::new(e), self.expect_ident()?);

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (957151) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:37: expected RBrack, found Prime
in:

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (957164) panicked at crates/tla-syntax/tests/grammar.rs:257:33:
parsing `[][\A i \in Proc : p[i] = p'[i]]_vars`: parse error at 1:28: expected RBrack, found Prime

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    the_new_forms_round_trip

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
