*** crates/tla-syntax/src/parser.rs:657:54: replace || with && in Parser::expr_inner

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::expr_inner
@@ -649,17 +649,17 @@
         //     => chosen = {}
         //
         // the `=>` ends the list and then applies to it.
         let mut lhs = match *self.peek() {
             Tok::Op(op @ (Op::And | Op::Or)) => self.junction(op)?,
             _ => self.prefix()?,
         };
         loop {
-            if self.fenced() || self.at_unit_start() || self.at_proof() {
+            if self.fenced() || self.at_unit_start() && /* ~ changed by cargo-mutants ~ */ self.at_proof() {
                 break;
             }
             let Tok::Op(op) = *self.peek() else { break };
             let Some(prec) = op.infix_prec() else { break };
             if prec < min_prec {
                 break;
             }
             self.advance();

---- a_prefix_definition_needs_a_name_or_a_hole stdout ----

thread 'a_prefix_definition_needs_a_name_or_a_hole' (1403746) panicked at crates/tla-syntax/tests/boundaries.rs:120:5:
assertion failed: defines("-. a == 0 - a", "-")

---- a_definition_of_any_shape_ends_the_previous_one stdout ----

thread 'a_definition_of_any_shape_ends_the_previous_one' (1403742) panicked at crates/tla-syntax/tests/boundaries.rs:16:56:
parse error at 3:2: expected an expression, found Dot
in:

failures:
    a_definition_of_any_shape_ends_the_previous_one
    a_prefix_definition_needs_a_name_or_a_hole

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
