*** crates/tla-syntax/src/parser.rs:747:23: delete ! in Parser::primary

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::primary
@@ -739,17 +739,17 @@
                 Ok(Expr::If {
                     cond: Box::new(cond),
                     then: Box::new(then),
                     otherwise: Box::new(otherwise),
                 })
             }
             Tok::Kw(Kw::Let) => {
                 let mut defs = Vec::new();
-                while !matches!(self.peek(), Tok::Kw(Kw::In)) {
+                while  /* ~ changed by cargo-mutants ~ */matches!(self.peek(), Tok::Kw(Kw::In)) {
                     if self.eat(&Tok::Kw(Kw::Recursive)) {
                         self.decl_list()?;
                         continue;
                     }
                     let Tok::Ident(name) = self.peek().clone() else {
                         return Err(self.err("expected a definition inside LET"));
                     };
                     match self.named_definition(name, false)? {

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (972064) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 30:14: expected an expression, found DefEq

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (972062) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected an expression, found DefEq", line: 51, col: 16 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (972066) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Parse, message: "expected an expression, found DefEq", line: 51, col: 16 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
