*** crates/tla-syntax/src/parser.rs:774:30: replace || with && in Parser::continue_postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace || with && in Parser::continue_postfix
@@ -766,17 +766,17 @@
     fn postfix(&mut self) -> Result<Expr> {
         let e = self.primary()?;
         self.continue_postfix(e)
     }
 
     fn continue_postfix(&mut self, head: Expr) -> Result<Expr> {
         let mut e = head;
         loop {
-            if self.fenced() || self.at_unit_start() {
+            if self.fenced() && /* ~ changed by cargo-mutants ~ */ self.at_unit_start() {
                 break;
             }
             match self.peek() {
                 Tok::Prime => {
                     self.advance();
                     e = Expr::Prime(Box::new(e));
                 }
                 Tok::Op(op) if op.is_postfix() => {

*** result: Success
