*** crates/tla-syntax/src/parser.rs:803:17: delete match arm Tok::Bang in Parser::continue_postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Bang in Parser::continue_postfix
@@ -795,66 +795,17 @@
                     e = Expr::FnApply(Box::new(e), args);
                 }
                 Tok::LParen if matches!(e, Expr::Ident(_)) => {
                     self.advance();
                     let args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
                     self.expect(&Tok::RParen)?;
                     e = Expr::Apply(Box::new(e), args);
                 }
-                Tok::Bang => {
-                    let instance = match &e {
-                        Expr::Ident(name) => name.clone(),
-                        Expr::Qualified { instance, name, .. } => format!("{instance}!{name}"),
-                        Expr::Apply(head, _) => head.to_string(),
-                        _ => return Err(self.err("`!` must follow an instance name")),
-                    };
-                    self.advance();
-                    // `Inv!2` picks the second conjunct of `Inv`, `Inv!:` its
-                    // whole body, `Inv!<<` and `Inv!>>` the sides of a tuple,
-                    // and `Inv!@` the subject of an EXCEPT. All are proof
-                    // notation for pointing inside a definition, not values.
-                    let name = match self.peek().clone() {
-                        Tok::Num(n) => {
-                            self.advance();
-                            n.to_string()
-                        }
-                        Tok::Op(op) => {
-                            self.advance();
-                            op.symbol().to_string()
-                        }
-                        Tok::At => {
-                            self.advance();
-                            "@".to_string()
-                        }
-                        Tok::LTup => {
-                            self.advance();
-                            "<<".to_string()
-                        }
-                        Tok::RTup => {
-                            self.advance();
-                            ">>".to_string()
-                        }
-                        Tok::Colon => {
-                            self.advance();
-                            String::new()
-                        }
-                        _ => self.expect_ident()?,
-                    };
-                    let mut args = Vec::new();
-                    if self.eat(&Tok::LParen) {
-                        args = self.bracketed(|p| p.expr_list(&Tok::RParen))?;
-                        self.expect(&Tok::RParen)?;
-                    }
-                    e = Expr::Qualified {
-                        instance,
-                        name,
-                        args,
-                    };
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => break,
             }
         }
         Ok(e)
     }
 
     fn expr_list(&mut self, close: &Tok) -> Result<Vec<Expr>> {
         let mut out = Vec::new();

---- a_let_instance_keeps_its_substitutions stdout ----

thread 'a_let_instance_keeps_its_substitutions' (1406719) panicked at crates/tla-syntax/tests/boundaries.rs:199:69:
parses: Error { stage: Parse, message: "unexpected Bang after the expression", line: 1, col: 37 }

---- a_let_instance_survives_printing stdout ----

thread 'a_let_instance_survives_printing' (1406720) panicked at crates/tla-syntax/tests/boundaries.rs:187:66:
parsing `LET I == INSTANCE M IN I!Op`: parse error at 1:25: unexpected Bang after the expression

failures:
    a_let_instance_keeps_its_substitutions
    a_let_instance_survives_printing

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
