*** crates/tla-syntax/src/parser.rs:824:25: delete match arm Tok::At in Parser::continue_postfix

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::At in Parser::continue_postfix
@@ -816,20 +816,17 @@
                         Tok::Num(n) => {
                             self.advance();
                             n.to_string()
                         }
                         Tok::Op(op) => {
                             self.advance();
                             op.symbol().to_string()
                         }
-                        Tok::At => {
-                            self.advance();
-                            "@".to_string()
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         Tok::LTup => {
                             self.advance();
                             "<<".to_string()
                         }
                         Tok::RTup => {
                             self.advance();
                             ">>".to_string()
                         }

*** result: Success
