*** crates/tla-syntax/src/parser.rs:849:9: replace Parser::at_subscript -> bool with false

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::at_subscript -> bool with false
@@ -841,21 +841,17 @@
             });
         }
         Ok(Expr::Tuple(items))
     }
 
     /// Is a `_v` subscript coming? Identifiers may begin with an underscore,
     /// so `[A]_vars` reaches the parser as one token, not two.
     fn at_subscript(&self) -> bool {
-        match self.peek() {
-            Tok::Underscore => true,
-            Tok::Ident(name) => name.starts_with('_'),
-            _ => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The `v` of `[A]_v`, parsed tightly so it cannot swallow what follows.
     fn subscript(&mut self) -> Result<Expr> {
         if let Tok::Ident(name) = self.peek()
             && let Some(rest) = name.strip_prefix('_')
             && !rest.is_empty()
         {

---- every_shape_of_expression_survives_printing stdout ----

thread 'every_shape_of_expression_survives_printing' (977290) panicked at crates/tla-syntax/tests/printing.rs:9:62:
parsing `<<A>>_v`: parse error at 1:6: unexpected Ident("_v") after the expression

failures:
    every_shape_of_expression_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
