*** crates/tla-syntax/src/parser.rs:873:74: replace == with != in Parser::expr_list

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace == with != in Parser::expr_list
@@ -865,17 +865,17 @@
         let mut out = Vec::new();
         if self.peek() == close {
             return Ok(out);
         }
         loop {
             // `FoldSet(+, 0, S)` passes the operator itself, not an
             // application of it. So does `apply(', v')`, where the operator is
             // the prime.
-            if (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) == close)
+            if (matches!(self.peek_at(1), Tok::Comma) || self.peek_at(1) != /* ~ changed by cargo-mutants ~ */ close)
                 && let Some(operator) = self.operator_by_symbol()
             {
                 out.push(operator);
                 if !self.eat(&Tok::Comma) {
                     return Ok(out);
                 }
                 continue;
             }

*** result: Success
