*** crates/tla-syntax/src/parser.rs:886:9: replace Parser::operator_by_symbol -> Option<Expr> with None

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ replace Parser::operator_by_symbol -> Option<Expr> with None
@@ -878,28 +878,17 @@
             if !self.eat(&Tok::Comma) {
                 return Ok(out);
             }
         }
     }
 
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
-        let symbol = match self.peek() {
-            Tok::Op(op) => op.symbol(),
-            Tok::Prime => "'",
-            Tok::Kw(Kw::Enabled) => "ENABLED",
-            Tok::Kw(Kw::Unchanged) => "UNCHANGED",
-            Tok::Kw(Kw::Domain) => "DOMAIN",
-            Tok::Kw(Kw::Subset) => "SUBSET",
-            Tok::Kw(Kw::Union) => "UNION",
-            _ => return None,
-        };
-        self.advance();
-        Some(Expr::Ident(symbol.to_string()))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn primary(&mut self) -> Result<Expr> {
         let at = self.pos;
         match self.advance() {
             Tok::Num(n) => Ok(Expr::Num(n)),
             Tok::Decimal(text) => Ok(Expr::Decimal(text)),
             Tok::Str(s) => Ok(Expr::Str(s)),

---- a_substitution_may_be_an_operator_or_an_expression stdout ----

thread 'a_substitution_may_be_an_operator_or_an_expression' (1413706) panicked at crates/tla-syntax/tests/boundaries.rs:134:6:
parses: Error { stage: Parse, message: "expected an expression, found Prime", line: 2, col: 27 }

---- an_operator_may_be_the_last_argument stdout ----

thread 'an_operator_may_be_the_last_argument' (1413708) panicked at crates/tla-syntax/tests/boundaries.rs:146:10:
parses: Error { stage: Parse, message: "expected an expression, found Op(Plus)", line: 2, col: 15 }

failures:
    a_substitution_may_be_an_operator_or_an_expression
    an_operator_may_be_the_last_argument

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
