*** crates/tla-syntax/src/parser.rs:888:13: delete match arm Tok::Prime in Parser::operator_by_symbol

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Prime in Parser::operator_by_symbol
@@ -880,17 +880,17 @@
             }
         }
     }
 
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
         let symbol = match self.peek() {
             Tok::Op(op) => op.symbol(),
-            Tok::Prime => "'",
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Enabled) => "ENABLED",
             Tok::Kw(Kw::Unchanged) => "UNCHANGED",
             Tok::Kw(Kw::Domain) => "DOMAIN",
             Tok::Kw(Kw::Subset) => "SUBSET",
             Tok::Kw(Kw::Union) => "UNION",
             _ => return None,
         };
         self.advance();

---- a_substitution_may_be_an_operator_or_an_expression stdout ----

thread 'a_substitution_may_be_an_operator_or_an_expression' (1415363) panicked at crates/tla-syntax/tests/boundaries.rs:134:6:
parses: Error { stage: Parse, message: "expected an expression, found Prime", line: 2, col: 27 }

failures:
    a_substitution_may_be_an_operator_or_an_expression

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
