*** crates/tla-syntax/src/parser.rs:889:13: delete match arm Tok::Kw(Kw::Enabled) in Parser::operator_by_symbol

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Enabled) in Parser::operator_by_symbol
@@ -881,17 +881,17 @@
         }
     }
 
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
         let symbol = match self.peek() {
             Tok::Op(op) => op.symbol(),
             Tok::Prime => "'",
-            Tok::Kw(Kw::Enabled) => "ENABLED",
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Unchanged) => "UNCHANGED",
             Tok::Kw(Kw::Domain) => "DOMAIN",
             Tok::Kw(Kw::Subset) => "SUBSET",
             Tok::Kw(Kw::Union) => "UNION",
             _ => return None,
         };
         self.advance();
         Some(Expr::Ident(symbol.to_string()))

---- a_substitution_may_be_an_operator_or_an_expression stdout ----

thread 'a_substitution_may_be_an_operator_or_an_expression' (1416384) panicked at crates/tla-syntax/tests/boundaries.rs:134:6:
parses: Error { stage: Parse, message: "expected an expression, found Comma", line: 2, col: 42 }

failures:
    a_substitution_may_be_an_operator_or_an_expression

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
