*** crates/tla-syntax/src/parser.rs:892:13: delete match arm Tok::Kw(Kw::Subset) in Parser::operator_by_symbol

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete match arm Tok::Kw(Kw::Subset) in Parser::operator_by_symbol
@@ -884,17 +884,17 @@
     /// An operator standing where a value would, named by its own symbol.
     fn operator_by_symbol(&mut self) -> Option<Expr> {
         let symbol = match self.peek() {
             Tok::Op(op) => op.symbol(),
             Tok::Prime => "'",
             Tok::Kw(Kw::Enabled) => "ENABLED",
             Tok::Kw(Kw::Unchanged) => "UNCHANGED",
             Tok::Kw(Kw::Domain) => "DOMAIN",
-            Tok::Kw(Kw::Subset) => "SUBSET",
+             /* ~ changed by cargo-mutants ~ */
             Tok::Kw(Kw::Union) => "UNION",
             _ => return None,
         };
         self.advance();
         Some(Expr::Ident(symbol.to_string()))
     }
 
     fn primary(&mut self) -> Result<Expr> {

*** result: Success
