*** crates/tla-syntax/src/parser.rs:984:15: delete ! in Parser::let_form

*** mutation diff:
--- crates/tla-syntax/src/parser.rs
+++ delete ! in Parser::let_form
@@ -976,17 +976,17 @@
             }
             other => Err(self.err_at(at, format!("expected an expression, found {other:?}"))),
         }
     }
 
     fn let_form(&mut self) -> Result<Expr> {
         let mut defs = Vec::new();
         let mut instances = Vec::new();
-        while !matches!(self.peek(), Tok::Kw(Kw::In)) {
+        while  /* ~ changed by cargo-mutants ~ */matches!(self.peek(), Tok::Kw(Kw::In)) {
             if self.eat(&Tok::Kw(Kw::Recursive)) {
                 self.decl_list()?;
                 continue;
             }
             if matches!(self.peek(), Tok::Kw(Kw::Instance)) {
                 let (module, subs) = self.instance_tail()?;
                 instances.push(LetInstance {
                     name: None,

---- every_specification_matches_its_golden_form stdout ----

thread 'every_specification_matches_its_golden_form' (1303454) panicked at crates/tla-syntax/tests/golden.rs:38:72:
BankTransfer.tla: parse error at 30:14: expected an expression, found DefEq

---- the_golden_form_is_itself_readable stdout ----

thread 'the_golden_form_is_itself_readable' (1303455) panicked at crates/tla-syntax/tests/golden.rs:78:70:
BankTransfer.tla: parse error at 13:43: expected an expression, found DefEq

failures:
    every_specification_matches_its_golden_form
    the_golden_form_is_itself_readable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
