*** crates/tla-syntax/src/print.rs:179:22: replace > with < in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace > with < in bare
@@ -171,17 +171,17 @@
         Expr::If {
             cond,
             then,
             otherwise,
         } => write!(f, "IF {cond} THEN {then} ELSE {otherwise}"),
         Expr::Case { arms, other } => {
             f.write_str("CASE ")?;
             for (i, (guard, result)) in arms.iter().enumerate() {
-                if i > 0 {
+                if i < /* ~ changed by cargo-mutants ~ */ 0 {
                     f.write_str(" [] ")?;
                 }
                 write!(f, "{guard} -> {result}")?;
             }
             match other {
                 Some(value) => write!(f, " [] OTHER -> {value}"),
                 None => Ok(()),
             }

---- every_shape_of_expression_survives_printing stdout ----

thread 'every_shape_of_expression_survives_printing' (1038703) panicked at crates/tla-syntax/tests/printing.rs:12:29:
`CASE a -> 1 [] b -> 2` printed as `CASE a -> 1b -> 2`, which failed: parse error at 1:15: unexpected Arrow after the expression

failures:
    every_shape_of_expression_survives_printing

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
