*** crates/tla-syntax/src/print.rs:188:20: delete ! in bare

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete ! in bare
@@ -180,17 +180,17 @@
             f.write_str("LET ")?;
             for (i, def) in defs.iter().enumerate() {
                 if i > 0 {
                     f.write_str(" ")?;
                 }
                 write!(f, "{def}")?;
             }
             for instance in instances {
-                if !defs.is_empty() {
+                if  /* ~ changed by cargo-mutants ~ */defs.is_empty() {
                     f.write_str(" ")?;
                 }
                 write!(f, "{instance}")?;
             }
             write!(f, " IN {body}")
         }
         Expr::If {
             cond,

---- a_let_instance_survives_printing stdout ----

thread 'a_let_instance_survives_printing' (1425781) panicked at crates/tla-syntax/tests/boundaries.rs:190:59:
re-reading `LET d == 1I == INSTANCE M IN I!Op`: parse error at 1:14: expected a definition inside LET

failures:
    a_let_instance_survives_printing

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
