*** crates/tla-syntax/src/print.rs:205:9: replace <impl fmt::Display for Def>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace <impl fmt::Display for Def>::fmt -> fmt::Result with Ok(Default::default())
@@ -197,21 +197,17 @@
             let kind = if *strong { "SF" } else { "WF" };
             write!(f, "{kind}_{subscript}({action})")
         }
     }
 }
 
 impl fmt::Display for Def {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.name)?;
-        if !self.params.is_empty() {
-            write!(f, "({})", params_list(&self.params))?;
-        }
-        write!(f, " == {}", self.body)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Param {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.name)?;
         if self.arity > 0 {
             let holes = vec!["_"; self.arity].join(", ");

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1040332) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:
assertion `left == right` failed: BankTransfer.tla: SumOver did not survive printing as `IF S = {} THEN 0 ELSE LET  IN bal[x] + SumOver(S \ {x})`
  left: If { cond: Binary(Eq, Ident("S"), SetEnum([])), then: Num(0), otherwise: Let { defs: [], body: Binary(Plus, FnApply(Ident("bal"), [Ident("x")]), Apply(Ident("SumOver"), [Binary(SetMinus, Ident("S"), SetEnum([Ident("x")]))])) } }

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
