*** crates/tla-syntax/src/print.rs:233:5: replace list -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace list -> String with "xyzzy".into()
@@ -225,21 +225,17 @@
     params
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 fn list(items: &[Expr]) -> String {
-    items
-        .iter()
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn bounds_list(bounds: &[Bound]) -> String {
     bounds
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1046236) panicked at crates/tla-syntax/tests/grammar.rs:261:9:
assertion `left == right` failed: `\EE t : Timer(t)` printed as `\EE t : Timer(xyzzy)`
  left: Quant { kind: TemporalExists, bounds: [Bound { names: ["t"], domain: None, destructure: false }], body: Apply(Ident("Timer"), [Ident("t")]) }
 right: Quant { kind: TemporalExists, bounds: [Bound { names: ["t"], domain: None, destructure: false }], body: Apply(Ident("Timer"), [Ident("xyzzy")]) }

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
