*** crates/tla-syntax/src/print.rs:241:5: replace bounds_list -> String with String::new()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace bounds_list -> String with String::new()
@@ -233,21 +233,17 @@
     items
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 fn bounds_list(bounds: &[Bound]) -> String {
-    bounds
-        .iter()
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn fields_list(fields: &[(String, Expr)], separator: &str) -> String {
     fields
         .iter()
         .map(|(name, value)| format!("{name} {separator} {value}"))
         .collect::<Vec<_>>()
         .join(", ")

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1048129) panicked at crates/tla-syntax/tests/grammar.rs:260:33:
re-reading `\EE  : Timer(t)`: parse error at 1:6: expected an identifier, found Colon

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
