*** crates/tla-syntax/src/print.rs:241:5: replace bounds_list -> String with "xyzzy".into()

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ replace bounds_list -> String with "xyzzy".into()
@@ -233,21 +233,17 @@
     items
         .iter()
         .map(ToString::to_string)
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 fn bounds_list(bounds: &[Bound]) -> String {
-    bounds
-        .iter()
-        .map(ToString::to_string)
-        .collect::<Vec<_>>()
-        .join(", ")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn fields_list(fields: &[(String, Expr)], separator: &str) -> String {
     fields
         .iter()
         .map(|(name, value)| format!("{name} {separator} {value}"))
         .collect::<Vec<_>>()
         .join(", ")

---- the_new_forms_round_trip stdout ----

thread 'the_new_forms_round_trip' (1048934) panicked at crates/tla-syntax/tests/grammar.rs:261:9:
assertion `left == right` failed: `\EE t : Timer(t)` printed as `\EE xyzzy : Timer(t)`
  left: Quant { kind: TemporalExists, bounds: [Bound { names: ["t"], domain: None, destructure: false }], body: Apply(Ident("Timer"), [Ident("t")]) }
 right: Quant { kind: TemporalExists, bounds: [Bound { names: ["xyzzy"], domain: None, destructure: false }], body: Apply(Ident("Timer"), [Ident("t")]) }

failures:
    the_new_forms_round_trip

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
