*** crates/tla-syntax/src/print.rs:339:12: delete ! in <impl fmt::Display for LetInstance>::fmt

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete ! in <impl fmt::Display for LetInstance>::fmt
@@ -331,17 +331,17 @@
 }
 
 impl fmt::Display for LetInstance {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         if let Some(name) = &self.name {
             write!(f, "{name} == ")?;
         }
         write!(f, "INSTANCE {}", self.module)?;
-        if !self.subs.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */self.subs.is_empty() {
             let with: Vec<String> = self
                 .subs
                 .iter()
                 .map(|(name, value)| format!("{name} <- {value}"))
                 .collect();
             write!(f, " WITH {}", with.join(", "))?;
         }
         Ok(())

*** result: Success
