*** crates/tla-syntax/src/print.rs:41:9: delete match arm Expr::Binary(op, ..) in precedence

*** mutation diff:
--- crates/tla-syntax/src/print.rs
+++ delete match arm Expr::Binary(op, ..) in precedence
@@ -33,17 +33,17 @@
             Some(domain) => write!(f, " \\in {domain}"),
             None => Ok(()),
         }
     }
 }
 
 fn precedence(e: &Expr) -> u8 {
     match e {
-        Expr::Binary(op, ..) => op.infix_prec().unwrap_or(TRAILING),
+         /* ~ changed by cargo-mutants ~ */
         Expr::Unary(op, _) if op.is_postfix() => ATOM,
         Expr::Unary(op, _) => op.prefix_prec().saturating_sub(1),
         Expr::Quant { .. }
         | Expr::Choose { .. }
         | Expr::Let { .. }
         | Expr::If { .. }
         | Expr::Case { .. }
         | Expr::Lambda { .. } => TRAILING,

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1021398) panicked at crates/tla-syntax/tests/parse_specs.rs:169:13:

failures:
    printing_round_trips_through_the_parser

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
