*** crates/tla-syntax/src/token.rs:194:5: replace user_operator -> Option<Op> with None

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace user_operator -> Option<Op> with None
@@ -186,20 +186,17 @@
     ("/", 13),
     ("^+", 15),
     ("^*", 15),
     ("^#", 15),
     ("-+->", 2),
 ];
 
 pub(crate) fn user_operator(symbol: &str) -> Option<Op> {
-    USER_OPERATORS
-        .iter()
-        .find(|(name, _)| *name == symbol)
-        .map(|(name, _)| Op::User(name))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 impl Op {
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.

---- an_infix_operator_can_be_defined stdout ----

thread 'an_infix_operator_can_be_defined' (1071774) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
lex error at 2:3: unknown operator `\prec`
in:

failures:
    an_infix_operator_can_be_defined

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
