*** crates/tla-syntax/src/token.rs:196:33: replace == with != in user_operator

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace == with != in user_operator
@@ -188,17 +188,17 @@
     ("^*", 15),
     ("^#", 15),
     ("-+->", 2),
 ];
 
 pub(crate) fn user_operator(symbol: &str) -> Option<Op> {
     USER_OPERATORS
         .iter()
-        .find(|(name, _)| *name == symbol)
+        .find(|(name, _)| *name != /* ~ changed by cargo-mutants ~ */ symbol)
         .map(|(name, _)| Op::User(name))
 }
 
 impl Op {
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`

---- an_infix_operator_can_be_defined stdout ----

thread 'an_infix_operator_can_be_defined' (1073055) panicked at crates/tla-syntax/tests/grammar.rs:47:38:
the operator is defined

failures:
    an_infix_operator_can_be_defined

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
