*** crates/tla-syntax/src/token.rs:208:13: delete match arm Self::Implies in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Implies in Op::infix_prec
@@ -200,17 +200,17 @@
 impl Op {
     /// Binding power as an infix operator; `None` for prefix-only operators.
     ///
     /// Ordering follows TLA+'s table where it matters for these specs: `\cup`
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
         Some(match self {
-            Self::Implies => 1,
+             /* ~ changed by cargo-mutants ~ */
             Self::Equiv | Self::LeadsTo => 2,
             Self::Or => 3,
             Self::And => 4,
             Self::Eq
             | Self::Neq
             | Self::Lt
             | Self::Gt
             | Self::Le

---- a_named_theorem_keeps_its_statement stdout ----

thread 'a_named_theorem_keeps_its_statement' (1075937) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

---- a_proof_is_skipped_and_the_module_continues stdout ----

thread 'a_proof_is_skipped_and_the_module_continues' (1075939) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:28: expected an identifier, found Op(Always)
in:

---- an_operator_may_follow_a_bulleted_list stdout ----

thread 'an_operator_may_follow_a_bulleted_list' (1075943) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 6:1: expected DefEq, found ModuleEnd
in:

failures:
    a_named_theorem_keeps_its_statement
    a_proof_is_skipped_and_the_module_continues
    an_operator_may_follow_a_bulleted_list

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
