*** crates/tla-syntax/src/token.rs:212:13: delete match arm Self::Eq | Self::Neq | Self::Lt | Self::Gt | Self::Le | Self::Ge | Self::In | Self::NotIn | Self::Subseteq | Self::Supseteq in Op::infix_prec

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm Self::Eq | Self::Neq | Self::Lt | Self::Gt | Self::Le | Self::Ge | Self::In | Self::NotIn | Self::Subseteq | Self::Supseteq in Op::infix_prec
@@ -204,26 +204,17 @@
     /// binds tighter than `=`, and `:>` tighter than `@@`, so `a \cup {b} = c`
     /// and `("k" :> v) @@ rest` parse without parentheses.
     pub fn infix_prec(self) -> Option<u8> {
         Some(match self {
             Self::Implies => 1,
             Self::Equiv | Self::LeadsTo => 2,
             Self::Or => 3,
             Self::And => 4,
-            Self::Eq
-            | Self::Neq
-            | Self::Lt
-            | Self::Gt
-            | Self::Le
-            | Self::Ge
-            | Self::In
-            | Self::NotIn
-            | Self::Subseteq
-            | Self::Supseteq => 5,
+             /* ~ changed by cargo-mutants ~ */
             Self::AtAt => 6,
             Self::OneTo => 7,
             Self::Cup | Self::Cap | Self::SetMinus => 8,
             Self::DotDot => 9,
             Self::Plus | Self::Minus => 10,
             Self::Times | Self::Div | Self::Mod | Self::Cartesian => 11,
             Self::Concat => 12,
             Self::Pow => 13,

---- an_infix_operator_can_be_defined stdout ----

thread 'an_infix_operator_can_be_defined' (1078963) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 3:1: expected DefEq, found ModuleEnd
in:

---- an_action_subscript_is_recognised_past_an_inner_colon stdout ----

thread 'an_action_subscript_is_recognised_past_an_inner_colon' (1078962) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:34: expected RBrack, found Op(Eq)
in:

---- case_arms_are_separated_by_boxes stdout ----

thread 'case_arms_are_separated_by_boxes' (1078968) panicked at crates/tla-syntax/tests/grammar.rs:12:43:
parse error at 2:18: expected Arrow, found Op(Eq)
in:

failures:
    an_action_subscript_is_recognised_past_an_inner_colon
    an_infix_operator_can_be_defined
    case_arms_are_separated_by_boxes
    labels_are_read_and_dropped
    set_filters_and_set_maps_are_told_apart
    the_new_forms_round_trip

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
