*** crates/tla-syntax/src/token.rs:39:13: delete match arm "CONSTANT" | "CONSTANTS" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "CONSTANT" | "CONSTANTS" in Kw::lookup
@@ -31,17 +31,17 @@
     Unchanged,
 }
 
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
-            "CONSTANT" | "CONSTANTS" => Self::Constant,
+             /* ~ changed by cargo-mutants ~ */
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (1052282) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 6:11: expected DefEq, found Ident("Acct")

---- declarations_are_collected stdout ----

thread 'declarations_are_collected' (1052280) panicked at crates/tla-syntax/tests/parse_specs.rs:46:49:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"Acceptor\")", line: 7, col: 11 }

---- module_name_and_extends stdout ----

thread 'module_name_and_extends' (1052285) panicked at crates/tla-syntax/tests/parse_specs.rs:39:49:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"Acceptor\")", line: 7, col: 11 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    nested_junctions_nest
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 5 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
