*** crates/tla-syntax/src/token.rs:39:9: replace Kw::text -> Option<&'static str> with None

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ replace Kw::text -> Option<&'static str> with None
@@ -31,46 +31,17 @@
     Unchanged,
 }
 
 impl Kw {
     /// How the keyword is spelled, for the rare specification that defines
     /// something by that name. `Proof` stands for a dozen words at once and so
     /// has none.
     pub fn text(self) -> Option<&'static str> {
-        Some(match self {
-            Self::Module => "MODULE",
-            Self::Extends => "EXTENDS",
-            Self::Constant => "CONSTANT",
-            Self::Variable => "VARIABLE",
-            Self::Let => "LET",
-            Self::In => "IN",
-            Self::If => "IF",
-            Self::Then => "THEN",
-            Self::Else => "ELSE",
-            Self::Choose => "CHOOSE",
-            Self::Case => "CASE",
-            Self::Other => "OTHER",
-            Self::Assume => "ASSUME",
-            Self::Theorem => "THEOREM",
-            Self::Instance => "INSTANCE",
-            Self::With => "WITH",
-            Self::Local => "LOCAL",
-            Self::Recursive => "RECURSIVE",
-            Self::Lambda => "LAMBDA",
-            Self::Except => "EXCEPT",
-            Self::True => "TRUE",
-            Self::False => "FALSE",
-            Self::Domain => "DOMAIN",
-            Self::Subset => "SUBSET",
-            Self::Union => "UNION",
-            Self::Enabled => "ENABLED",
-            Self::Unchanged => "UNCHANGED",
-            Self::Proof => return None,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,

---- a_definition_may_be_named_after_a_keyword stdout ----

thread 'a_definition_may_be_named_after_a_keyword' (1427694) panicked at crates/tla-syntax/tests/boundaries.rs:169:55:
TRUE == FALSE: parse error at 2:1: expected a declaration, found Kw(True)

failures:
    a_definition_may_be_named_after_a_keyword

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
