*** crates/tla-syntax/src/token.rs:42:13: delete match arm "IN" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "IN" in Kw::lookup
@@ -34,17 +34,17 @@
 impl Kw {
     pub fn lookup(word: &str) -> Option<Self> {
         Some(match word {
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
-            "IN" => Self::In,
+             /* ~ changed by cargo-mutants ~ */
             "IF" => Self::If,
             "THEN" => Self::Then,
             "ELSE" => Self::Else,
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (1055170) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 31:12: expected DefEq, found Ident("bal")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1055176) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected DefEq, found Ident(\"bal\")", line: 31, col: 12 }

---- junction_lists_are_scoped_by_column stdout ----

thread 'junction_lists_are_scoped_by_column' (1055172) panicked at crates/tla-syntax/tests/parse_specs.rs:66:49:
parses: Error { stage: Parse, message: "expected an identifier, found Op(Forall)", line: 52, col: 15 }

failures:
    declarations_are_collected
    every_fixture_parses
    junction_lists_are_scoped_by_column
    module_name_and_extends
    operator_definitions_keep_their_parameters
    printing_round_trips_through_the_parser

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
