*** crates/tla-syntax/src/token.rs:45:13: delete match arm "ELSE" in Kw::lookup

*** mutation diff:
--- crates/tla-syntax/src/token.rs
+++ delete match arm "ELSE" in Kw::lookup
@@ -37,17 +37,17 @@
             "MODULE" => Self::Module,
             "EXTENDS" => Self::Extends,
             "CONSTANT" | "CONSTANTS" => Self::Constant,
             "VARIABLE" | "VARIABLES" => Self::Variable,
             "LET" => Self::Let,
             "IN" => Self::In,
             "IF" => Self::If,
             "THEN" => Self::Then,
-            "ELSE" => Self::Else,
+             /* ~ changed by cargo-mutants ~ */
             "CHOOSE" => Self::Choose,
             "CASE" => Self::Case,
             "OTHER" => Self::Other,
             "ASSUME" | "ASSUMPTION" => Self::Assume,
             "INSTANCE" => Self::Instance,
             "WITH" => Self::With,
             "LOCAL" => Self::Local,
             "RECURSIVE" => Self::Recursive,

---- every_fixture_parses stdout ----

thread 'every_fixture_parses' (1057885) panicked at crates/tla-syntax/tests/parse_specs.rs:32:13:
BankTransfer.tla: parse error at 30:3: expected Kw(Else), found Ident("ELSE")

---- printing_round_trips_through_the_parser stdout ----

thread 'printing_round_trips_through_the_parser' (1057894) panicked at crates/tla-syntax/tests/parse_specs.rs:161:52:
parses: Error { stage: Parse, message: "expected Kw(Else), found Ident(\"ELSE\")", line: 30, col: 3 }

failures:
    every_fixture_parses
    printing_round_trips_through_the_parser

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
